/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize);
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {

pub const DDS_DATA_TYPE_DEFAULTS_TO_XCDR2: u32 = 1024;
pub const DDS_DATA_TYPE_DEFAULTS_TO_XCDR2_MASK: u32 = 99328;
pub const DDS_DATA_TYPE_CONTAINS_KEY: u32 = 4096;
pub const DDS_DATA_TYPE_IS_MEMCPY_SAFE: i64 = -9223372036854775808;
pub const DDS_CDRSTREAM_MAX_NESTING_DEPTH: u32 = 32;
pub const DDSI_RTPS_CDR_ENC_VERSION_UNDEF: u32 = 0;
pub const DDSI_RTPS_CDR_ENC_VERSION_1: u32 = 1;
pub const DDSI_RTPS_CDR_ENC_VERSION_2: u32 = 2;
pub const DDSI_RTPS_CDR_ENC_FORMAT_PLAIN: u32 = 0;
pub const DDSI_RTPS_CDR_ENC_FORMAT_DELIMITED: u32 = 1;
pub const DDSI_RTPS_CDR_ENC_FORMAT_PL: u32 = 2;
pub const DDS_CDR_HDR_PADDING_MASK: u32 = 3;
pub const DDS_XCDR1_PL_SHORT_MAX_PARAM_ID: u32 = 16128;
pub const DDS_XCDR1_PL_SHORT_MAX_PARAM_LEN: u32 = 65535;
pub const DDS_XCDR1_PL_SHORT_PID_EXTENDED: u32 = 16129;
pub const DDS_XCDR1_PL_SHORT_PID_LIST_END: u32 = 16130;
pub const DDS_XCDR1_PL_SHORT_PID_EXT_LEN: u32 = 8;
pub const DDS_XCDR1_PL_SHORT_FLAG_IMPL_EXT: u32 = 32768;
pub const DDS_XCDR1_PL_SHORT_FLAG_MU: u32 = 16384;
pub const DDS_XCDR1_PL_SHORT_PID_MASK: u32 = 49151;
pub const DDS_XCDR1_PL_LONG_FLAG_IMPL_EXT: u32 = 2147483648;
pub const DDS_XCDR1_PL_LONG_FLAG_MU: u32 = 1073741824;
pub const DDS_XCDR1_PL_LONG_UNSPECIFIED1: u32 = 536870912;
pub const DDS_XCDR1_PL_LONG_UNSPECIFIED2: u32 = 268435456;
pub const DDS_XCDR1_PL_LONG_MID_MASK: u32 = 2415919103;
pub const DDS_CDR_CALCULATED_FLAGS: u32 = 7970;
pub const DDS_PARTICIPANT_FLAGS_NO_DISCOVERY: u32 = 3;
pub const DDSRT_64BIT: u32 = 1;
pub const DDSRT_HAVE_ATOMIC64: u32 = 1;
pub const DDSRT_HAVE_ATOMIC_LIFO: u32 = 1;
pub const DDS_MAX_PSMX_INSTANCES: u32 = 8;
pub const DDS_PSMX_FEATURE_SHARED_MEMORY: u32 = 1;
pub const DDS_PSMX_FEATURE_ZERO_COPY: u32 = 2;
pub const DDS_RHC_NO_STATE_MASK_SET: u32 = 128;
pub type wchar_t = ::std::ffi::c_int;
pub type max_align_t = f64;
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type __int8_t = ::std::ffi::c_schar;
pub type __uint8_t = ::std::ffi::c_uchar;
pub type __int16_t = ::std::ffi::c_short;
pub type __uint16_t = ::std::ffi::c_ushort;
pub type __int32_t = ::std::ffi::c_int;
pub type __uint32_t = ::std::ffi::c_uint;
pub type __int64_t = ::std::ffi::c_longlong;
pub type __uint64_t = ::std::ffi::c_ulonglong;
pub type __darwin_intptr_t = ::std::ffi::c_long;
pub type __darwin_natural_t = ::std::ffi::c_uint;
pub type __darwin_ct_rune_t = ::std::ffi::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::std::ffi::c_char; 128usize],
    pub _mbstateL: ::std::ffi::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 128usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 8usize];
    ["Offset of field: __mbstate_t::__mbstate8"]
        [::std::mem::offset_of!(__mbstate_t, __mbstate8) - 0usize];
    ["Offset of field: __mbstate_t::_mbstateL"]
        [::std::mem::offset_of!(__mbstate_t, _mbstateL) - 0usize];
};
impl Default for __mbstate_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::std::ffi::c_long;
pub type __darwin_size_t = ::std::ffi::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::std::ffi::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::std::ffi::c_int;
pub type __darwin_clock_t = ::std::ffi::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::std::ffi::c_long;
pub type __darwin_time_t = ::std::ffi::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::std::ffi::c_uint;
pub type __darwin_fsfilcnt_t = ::std::ffi::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::std::ffi::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::std::ffi::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::ffi::c_void)>,
    pub __arg: *mut ::std::ffi::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_pthread_handler_rec"]
        [::std::mem::size_of::<__darwin_pthread_handler_rec>() - 24usize];
    ["Alignment of __darwin_pthread_handler_rec"]
        [::std::mem::align_of::<__darwin_pthread_handler_rec>() - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__routine"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __routine) - 0usize];
    ["Offset of field: __darwin_pthread_handler_rec::__arg"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __arg) - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__next"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __next) - 16usize];
};
impl Default for __darwin_pthread_handler_rec {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::std::ffi::c_long,
    pub __opaque: [::std::ffi::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_attr_t"][::std::mem::size_of::<_opaque_pthread_attr_t>() - 64usize];
    ["Alignment of _opaque_pthread_attr_t"]
        [::std::mem::align_of::<_opaque_pthread_attr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_attr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_attr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_attr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_attr_t, __opaque) - 8usize];
};
impl Default for _opaque_pthread_attr_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::std::ffi::c_long,
    pub __opaque: [::std::ffi::c_char; 40usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_cond_t"][::std::mem::size_of::<_opaque_pthread_cond_t>() - 48usize];
    ["Alignment of _opaque_pthread_cond_t"]
        [::std::mem::align_of::<_opaque_pthread_cond_t>() - 8usize];
    ["Offset of field: _opaque_pthread_cond_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_cond_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_cond_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_cond_t, __opaque) - 8usize];
};
impl Default for _opaque_pthread_cond_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::std::ffi::c_long,
    pub __opaque: [::std::ffi::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_condattr_t"]
        [::std::mem::size_of::<_opaque_pthread_condattr_t>() - 16usize];
    ["Alignment of _opaque_pthread_condattr_t"]
        [::std::mem::align_of::<_opaque_pthread_condattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_condattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_condattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_condattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_condattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::ffi::c_long,
    pub __opaque: [::std::ffi::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutex_t"][::std::mem::size_of::<_opaque_pthread_mutex_t>() - 64usize];
    ["Alignment of _opaque_pthread_mutex_t"]
        [::std::mem::align_of::<_opaque_pthread_mutex_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutex_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_mutex_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutex_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_mutex_t, __opaque) - 8usize];
};
impl Default for _opaque_pthread_mutex_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::std::ffi::c_long,
    pub __opaque: [::std::ffi::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutexattr_t"]
        [::std::mem::size_of::<_opaque_pthread_mutexattr_t>() - 16usize];
    ["Alignment of _opaque_pthread_mutexattr_t"]
        [::std::mem::align_of::<_opaque_pthread_mutexattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutexattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_mutexattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutexattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_mutexattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::std::ffi::c_long,
    pub __opaque: [::std::ffi::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_once_t"][::std::mem::size_of::<_opaque_pthread_once_t>() - 16usize];
    ["Alignment of _opaque_pthread_once_t"]
        [::std::mem::align_of::<_opaque_pthread_once_t>() - 8usize];
    ["Offset of field: _opaque_pthread_once_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_once_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_once_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_once_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::std::ffi::c_long,
    pub __opaque: [::std::ffi::c_char; 192usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlock_t"]
        [::std::mem::size_of::<_opaque_pthread_rwlock_t>() - 200usize];
    ["Alignment of _opaque_pthread_rwlock_t"]
        [::std::mem::align_of::<_opaque_pthread_rwlock_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_rwlock_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_rwlock_t, __opaque) - 8usize];
};
impl Default for _opaque_pthread_rwlock_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::std::ffi::c_long,
    pub __opaque: [::std::ffi::c_char; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlockattr_t"]
        [::std::mem::size_of::<_opaque_pthread_rwlockattr_t>() - 24usize];
    ["Alignment of _opaque_pthread_rwlockattr_t"]
        [::std::mem::align_of::<_opaque_pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlockattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_rwlockattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlockattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_rwlockattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: ::std::ffi::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::std::ffi::c_char; 8176usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_t"][::std::mem::size_of::<_opaque_pthread_t>() - 8192usize];
    ["Alignment of _opaque_pthread_t"][::std::mem::align_of::<_opaque_pthread_t>() - 8usize];
    ["Offset of field: _opaque_pthread_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_t::__cleanup_stack"]
        [::std::mem::offset_of!(_opaque_pthread_t, __cleanup_stack) - 8usize];
    ["Offset of field: _opaque_pthread_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_t, __opaque) - 16usize];
};
impl Default for _opaque_pthread_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::std::ffi::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type intmax_t = ::std::ffi::c_long;
pub type uintmax_t = ::std::ffi::c_ulong;
#[doc = " @brief Handle to an entity\n @ingroup entity\n\n A valid entity handle will always have a positive integer value.\n Should the value be negative, it is one of the DDS_RETCODE_*\n error codes."]
pub type dds_entity_t = i32;
#[doc = " @brief Structure of a GUID in any builtin topic sample.\n @ingroup builtintopic"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct dds_builtintopic_guid {
    #[doc = "< 16-byte unique identifier"]
    pub v: [u8; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_builtintopic_guid"][::std::mem::size_of::<dds_builtintopic_guid>() - 16usize];
    ["Alignment of dds_builtintopic_guid"]
        [::std::mem::align_of::<dds_builtintopic_guid>() - 1usize];
    ["Offset of field: dds_builtintopic_guid::v"]
        [::std::mem::offset_of!(dds_builtintopic_guid, v) - 0usize];
};
#[doc = " @brief Structure of a GUID in any builtin topic sample.\n @ingroup builtintopic"]
pub type dds_builtintopic_guid_t = dds_builtintopic_guid;
#[doc = " @brief Structure of a GUID in any builtin topic sample.\n @ingroup builtintopic\n @ref dds_builtintopic_guid_t is a bit of a weird name for what everyone just calls a GUID,\n so let us try and switch to using the more logical one."]
pub type dds_guid_t = dds_builtintopic_guid;
unsafe extern "C" {
    pub fn __assert_rtn(
        arg1: *const ::std::ffi::c_char,
        arg2: *const ::std::ffi::c_char,
        arg3: ::std::ffi::c_int,
        arg4: *const ::std::ffi::c_char,
    ) -> !;
}
pub type rsize_t = ::std::ffi::c_ulong;
pub type __darwin_nl_item = ::std::ffi::c_int;
pub type __darwin_wctrans_t = ::std::ffi::c_int;
pub type __darwin_wctype_t = __uint32_t;
unsafe extern "C" {
    pub fn imaxabs(j: intmax_t) -> intmax_t;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: intmax_t,
    pub rem: intmax_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of imaxdiv_t"][::std::mem::size_of::<imaxdiv_t>() - 16usize];
    ["Alignment of imaxdiv_t"][::std::mem::align_of::<imaxdiv_t>() - 8usize];
    ["Offset of field: imaxdiv_t::quot"][::std::mem::offset_of!(imaxdiv_t, quot) - 0usize];
    ["Offset of field: imaxdiv_t::rem"][::std::mem::offset_of!(imaxdiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
unsafe extern "C" {
    pub fn strtoimax(
        __nptr: *const ::std::ffi::c_char,
        __endptr: *mut *mut ::std::ffi::c_char,
        __base: ::std::ffi::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn strtoumax(
        __nptr: *const ::std::ffi::c_char,
        __endptr: *mut *mut ::std::ffi::c_char,
        __base: ::std::ffi::c_int,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn wcstoimax(
        __nptr: *const wchar_t,
        __endptr: *mut *mut wchar_t,
        __base: ::std::ffi::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn wcstoumax(
        __nptr: *const wchar_t,
        __endptr: *mut *mut wchar_t,
        __base: ::std::ffi::c_int,
    ) -> uintmax_t;
}
#[doc = " Absolute Time definition"]
pub type dds_time_t = i64;
#[doc = " Relative Time definition in nanoseconds"]
pub type dds_duration_t = i64;
unsafe extern "C" {
    #[doc = " @brief Get the current time in nanoseconds since the UNIX Epoch.\n\n @returns Current time."]
    pub fn dds_time() -> dds_time_t;
}
unsafe extern "C" {
    #[doc = " @brief Suspend execution of calling thread until relative time n elapsed.\n\n Execution is suspended for n nanoseconds. Should the call be interrupted,\n the call is re-entered with the remaining time.\n\n @param[in]  reltime  Relative time in nanoseconds."]
    pub fn dds_sleepfor(reltime: dds_duration_t);
}
pub type dds_return_t = i32;
unsafe extern "C" {
    #[doc = " @brief Takes the error value and outputs a string corresponding to it.\n\n @param[in]  ret  Error value to be converted to a string\n\n @returns  String corresponding to the error value"]
    pub fn dds_strretcode(ret: dds_return_t) -> *const ::std::ffi::c_char;
}
pub type __gnuc_va_list = __builtin_va_list;
pub type va_list = __builtin_va_list;
pub type u_int8_t = ::std::ffi::c_uchar;
pub type u_int16_t = ::std::ffi::c_ushort;
pub type u_int32_t = ::std::ffi::c_uint;
pub type u_int64_t = ::std::ffi::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
unsafe extern "C" {
    pub fn renameat(
        arg1: ::std::ffi::c_int,
        arg2: *const ::std::ffi::c_char,
        arg3: ::std::ffi::c_int,
        arg4: *const ::std::ffi::c_char,
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn renamex_np(
        arg1: *const ::std::ffi::c_char,
        arg2: *const ::std::ffi::c_char,
        arg3: ::std::ffi::c_uint,
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn renameatx_np(
        arg1: ::std::ffi::c_int,
        arg2: *const ::std::ffi::c_char,
        arg3: ::std::ffi::c_int,
        arg4: *const ::std::ffi::c_char,
        arg5: ::std::ffi::c_uint,
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn printf(arg1: *const ::std::ffi::c_char, ...) -> ::std::ffi::c_int;
}
pub type fpos_t = __darwin_off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::std::ffi::c_uchar,
    pub _size: ::std::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sbuf"][::std::mem::size_of::<__sbuf>() - 16usize];
    ["Alignment of __sbuf"][::std::mem::align_of::<__sbuf>() - 8usize];
    ["Offset of field: __sbuf::_base"][::std::mem::offset_of!(__sbuf, _base) - 0usize];
    ["Offset of field: __sbuf::_size"][::std::mem::offset_of!(__sbuf, _size) - 8usize];
};
impl Default for __sbuf {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILEX {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::std::ffi::c_uchar,
    pub _r: ::std::ffi::c_int,
    pub _w: ::std::ffi::c_int,
    pub _flags: ::std::ffi::c_short,
    pub _file: ::std::ffi::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::std::ffi::c_int,
    pub _cookie: *mut ::std::ffi::c_void,
    pub _close: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::ffi::c_void) -> ::std::ffi::c_int,
    >,
    pub _read: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::ffi::c_void,
            arg2: *mut ::std::ffi::c_char,
            __n: ::std::ffi::c_int,
        ) -> ::std::ffi::c_int,
    >,
    pub _seek: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::ffi::c_void,
            arg2: fpos_t,
            arg3: ::std::ffi::c_int,
        ) -> fpos_t,
    >,
    pub _write: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::ffi::c_void,
            arg2: *const ::std::ffi::c_char,
            __n: ::std::ffi::c_int,
        ) -> ::std::ffi::c_int,
    >,
    pub _ub: __sbuf,
    pub _extra: *mut __sFILEX,
    pub _ur: ::std::ffi::c_int,
    pub _ubuf: [::std::ffi::c_uchar; 3usize],
    pub _nbuf: [::std::ffi::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::std::ffi::c_int,
    pub _offset: fpos_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sFILE"][::std::mem::size_of::<__sFILE>() - 152usize];
    ["Alignment of __sFILE"][::std::mem::align_of::<__sFILE>() - 8usize];
    ["Offset of field: __sFILE::_p"][::std::mem::offset_of!(__sFILE, _p) - 0usize];
    ["Offset of field: __sFILE::_r"][::std::mem::offset_of!(__sFILE, _r) - 8usize];
    ["Offset of field: __sFILE::_w"][::std::mem::offset_of!(__sFILE, _w) - 12usize];
    ["Offset of field: __sFILE::_flags"][::std::mem::offset_of!(__sFILE, _flags) - 16usize];
    ["Offset of field: __sFILE::_file"][::std::mem::offset_of!(__sFILE, _file) - 18usize];
    ["Offset of field: __sFILE::_bf"][::std::mem::offset_of!(__sFILE, _bf) - 24usize];
    ["Offset of field: __sFILE::_lbfsize"][::std::mem::offset_of!(__sFILE, _lbfsize) - 40usize];
    ["Offset of field: __sFILE::_cookie"][::std::mem::offset_of!(__sFILE, _cookie) - 48usize];
    ["Offset of field: __sFILE::_close"][::std::mem::offset_of!(__sFILE, _close) - 56usize];
    ["Offset of field: __sFILE::_read"][::std::mem::offset_of!(__sFILE, _read) - 64usize];
    ["Offset of field: __sFILE::_seek"][::std::mem::offset_of!(__sFILE, _seek) - 72usize];
    ["Offset of field: __sFILE::_write"][::std::mem::offset_of!(__sFILE, _write) - 80usize];
    ["Offset of field: __sFILE::_ub"][::std::mem::offset_of!(__sFILE, _ub) - 88usize];
    ["Offset of field: __sFILE::_extra"][::std::mem::offset_of!(__sFILE, _extra) - 104usize];
    ["Offset of field: __sFILE::_ur"][::std::mem::offset_of!(__sFILE, _ur) - 112usize];
    ["Offset of field: __sFILE::_ubuf"][::std::mem::offset_of!(__sFILE, _ubuf) - 116usize];
    ["Offset of field: __sFILE::_nbuf"][::std::mem::offset_of!(__sFILE, _nbuf) - 119usize];
    ["Offset of field: __sFILE::_lb"][::std::mem::offset_of!(__sFILE, _lb) - 120usize];
    ["Offset of field: __sFILE::_blksize"][::std::mem::offset_of!(__sFILE, _blksize) - 136usize];
    ["Offset of field: __sFILE::_offset"][::std::mem::offset_of!(__sFILE, _offset) - 144usize];
};
impl Default for __sFILE {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type FILE = __sFILE;
unsafe extern "C" {
    pub static mut __stdinp: *mut FILE;
}
unsafe extern "C" {
    pub static mut __stdoutp: *mut FILE;
}
unsafe extern "C" {
    pub static mut __stderrp: *mut FILE;
}
unsafe extern "C" {
    pub fn clearerr(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn fclose(arg1: *mut FILE) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn feof(arg1: *mut FILE) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn ferror(arg1: *mut FILE) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn fflush(arg1: *mut FILE) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn fgetc(arg1: *mut FILE) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn fgetpos(arg1: *mut FILE, arg2: *mut fpos_t) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn fgets(
        arg1: *mut ::std::ffi::c_char,
        __size: ::std::ffi::c_int,
        arg2: *mut FILE,
    ) -> *mut ::std::ffi::c_char;
}
unsafe extern "C" {
    pub fn fopen(
        __filename: *const ::std::ffi::c_char,
        __mode: *const ::std::ffi::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fprintf(arg1: *mut FILE, arg2: *const ::std::ffi::c_char, ...) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn fputc(arg1: ::std::ffi::c_int, arg2: *mut FILE) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn fputs(arg1: *const ::std::ffi::c_char, arg2: *mut FILE) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn fread(
        __ptr: *mut ::std::ffi::c_void,
        __size: ::std::ffi::c_ulong,
        __nitems: ::std::ffi::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn freopen(
        arg1: *const ::std::ffi::c_char,
        arg2: *const ::std::ffi::c_char,
        arg3: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fscanf(arg1: *mut FILE, arg2: *const ::std::ffi::c_char, ...) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn fseek(
        arg1: *mut FILE,
        arg2: ::std::ffi::c_long,
        arg3: ::std::ffi::c_int,
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn fsetpos(arg1: *mut FILE, arg2: *const fpos_t) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn ftell(arg1: *mut FILE) -> ::std::ffi::c_long;
}
unsafe extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::ffi::c_void,
        __size: ::std::ffi::c_ulong,
        __nitems: ::std::ffi::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn getc(arg1: *mut FILE) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn getchar() -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn gets(arg1: *mut ::std::ffi::c_char) -> *mut ::std::ffi::c_char;
}
unsafe extern "C" {
    pub fn perror(arg1: *const ::std::ffi::c_char);
}
unsafe extern "C" {
    pub fn putc(arg1: ::std::ffi::c_int, arg2: *mut FILE) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn putchar(arg1: ::std::ffi::c_int) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn puts(arg1: *const ::std::ffi::c_char) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn remove(arg1: *const ::std::ffi::c_char) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn rename(
        __old: *const ::std::ffi::c_char,
        __new: *const ::std::ffi::c_char,
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn rewind(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn scanf(arg1: *const ::std::ffi::c_char, ...) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn setbuf(arg1: *mut FILE, arg2: *mut ::std::ffi::c_char);
}
unsafe extern "C" {
    pub fn setvbuf(
        arg1: *mut FILE,
        arg2: *mut ::std::ffi::c_char,
        arg3: ::std::ffi::c_int,
        __size: usize,
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn sprintf(
        arg1: *mut ::std::ffi::c_char,
        arg2: *const ::std::ffi::c_char,
        ...
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn sscanf(
        arg1: *const ::std::ffi::c_char,
        arg2: *const ::std::ffi::c_char,
        ...
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
unsafe extern "C" {
    pub fn tmpnam(arg1: *mut ::std::ffi::c_char) -> *mut ::std::ffi::c_char;
}
unsafe extern "C" {
    pub fn ungetc(arg1: ::std::ffi::c_int, arg2: *mut FILE) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn vfprintf(
        arg1: *mut FILE,
        arg2: *const ::std::ffi::c_char,
        arg3: __builtin_va_list,
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn vprintf(arg1: *const ::std::ffi::c_char, arg2: __builtin_va_list) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn vsprintf(
        arg1: *mut ::std::ffi::c_char,
        arg2: *const ::std::ffi::c_char,
        arg3: __builtin_va_list,
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn ctermid(arg1: *mut ::std::ffi::c_char) -> *mut ::std::ffi::c_char;
}
unsafe extern "C" {
    pub fn fdopen(arg1: ::std::ffi::c_int, arg2: *const ::std::ffi::c_char) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fileno(arg1: *mut FILE) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn pclose(arg1: *mut FILE) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn popen(arg1: *const ::std::ffi::c_char, arg2: *const ::std::ffi::c_char) -> *mut FILE;
}
unsafe extern "C" {
    pub fn __srget(arg1: *mut FILE) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn __svfscanf(
        arg1: *mut FILE,
        arg2: *const ::std::ffi::c_char,
        arg3: va_list,
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn __swbuf(arg1: ::std::ffi::c_int, arg2: *mut FILE) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn flockfile(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn ftrylockfile(arg1: *mut FILE) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn funlockfile(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn getc_unlocked(arg1: *mut FILE) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn getchar_unlocked() -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn putc_unlocked(arg1: ::std::ffi::c_int, arg2: *mut FILE) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn putchar_unlocked(arg1: ::std::ffi::c_int) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn getw(arg1: *mut FILE) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn putw(arg1: ::std::ffi::c_int, arg2: *mut FILE) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn tempnam(
        __dir: *const ::std::ffi::c_char,
        __prefix: *const ::std::ffi::c_char,
    ) -> *mut ::std::ffi::c_char;
}
pub type off_t = __darwin_off_t;
unsafe extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __offset: off_t,
        __whence: ::std::ffi::c_int,
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn ftello(__stream: *mut FILE) -> off_t;
}
unsafe extern "C" {
    pub fn snprintf(
        __str: *mut ::std::ffi::c_char,
        __size: ::std::ffi::c_ulong,
        __format: *const ::std::ffi::c_char,
        ...
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn vfscanf(
        __stream: *mut FILE,
        __format: *const ::std::ffi::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn vscanf(
        __format: *const ::std::ffi::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn vsnprintf(
        __str: *mut ::std::ffi::c_char,
        __size: ::std::ffi::c_ulong,
        __format: *const ::std::ffi::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn vsscanf(
        __str: *const ::std::ffi::c_char,
        __format: *const ::std::ffi::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn dprintf(
        arg1: ::std::ffi::c_int,
        arg2: *const ::std::ffi::c_char,
        ...
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn vdprintf(
        arg1: ::std::ffi::c_int,
        arg2: *const ::std::ffi::c_char,
        arg3: va_list,
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn getdelim(
        __linep: *mut *mut ::std::ffi::c_char,
        __linecapp: *mut usize,
        __delimiter: ::std::ffi::c_int,
        __stream: *mut FILE,
    ) -> isize;
}
unsafe extern "C" {
    pub fn getline(
        __linep: *mut *mut ::std::ffi::c_char,
        __linecapp: *mut usize,
        __stream: *mut FILE,
    ) -> isize;
}
unsafe extern "C" {
    pub fn fmemopen(
        __buf: *mut ::std::ffi::c_void,
        __size: usize,
        __mode: *const ::std::ffi::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn open_memstream(__bufp: *mut *mut ::std::ffi::c_char, __sizep: *mut usize) -> *mut FILE;
}
unsafe extern "C" {
    pub static sys_nerr: ::std::ffi::c_int;
}
unsafe extern "C" {
    pub static sys_errlist: [*const ::std::ffi::c_char; 0usize];
}
unsafe extern "C" {
    pub fn asprintf(
        arg1: *mut *mut ::std::ffi::c_char,
        arg2: *const ::std::ffi::c_char,
        ...
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn ctermid_r(arg1: *mut ::std::ffi::c_char) -> *mut ::std::ffi::c_char;
}
unsafe extern "C" {
    pub fn fgetln(arg1: *mut FILE, __len: *mut usize) -> *mut ::std::ffi::c_char;
}
unsafe extern "C" {
    pub fn fmtcheck(
        arg1: *const ::std::ffi::c_char,
        arg2: *const ::std::ffi::c_char,
    ) -> *const ::std::ffi::c_char;
}
unsafe extern "C" {
    pub fn fpurge(arg1: *mut FILE) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn setbuffer(arg1: *mut FILE, arg2: *mut ::std::ffi::c_char, __size: ::std::ffi::c_int);
}
unsafe extern "C" {
    pub fn setlinebuf(arg1: *mut FILE) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn vasprintf(
        arg1: *mut *mut ::std::ffi::c_char,
        arg2: *const ::std::ffi::c_char,
        arg3: va_list,
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn funopen(
        arg1: *const ::std::ffi::c_void,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::ffi::c_void,
                arg2: *mut ::std::ffi::c_char,
                __n: ::std::ffi::c_int,
            ) -> ::std::ffi::c_int,
        >,
        arg3: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::ffi::c_void,
                arg2: *const ::std::ffi::c_char,
                __n: ::std::ffi::c_int,
            ) -> ::std::ffi::c_int,
        >,
        arg4: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::ffi::c_void,
                arg2: fpos_t,
                arg3: ::std::ffi::c_int,
            ) -> fpos_t,
        >,
        arg5: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::ffi::c_void) -> ::std::ffi::c_int,
        >,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn __snprintf_chk(
        arg1: *mut ::std::ffi::c_char,
        __maxlen: usize,
        arg2: ::std::ffi::c_int,
        arg3: usize,
        arg4: *const ::std::ffi::c_char,
        ...
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn __vsnprintf_chk(
        arg1: *mut ::std::ffi::c_char,
        __maxlen: usize,
        arg2: ::std::ffi::c_int,
        arg3: usize,
        arg4: *const ::std::ffi::c_char,
        arg5: va_list,
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn __sprintf_chk(
        arg1: *mut ::std::ffi::c_char,
        arg2: ::std::ffi::c_int,
        arg3: usize,
        arg4: *const ::std::ffi::c_char,
        ...
    ) -> ::std::ffi::c_int;
}
unsafe extern "C" {
    pub fn __vsprintf_chk(
        arg1: *mut ::std::ffi::c_char,
        arg2: ::std::ffi::c_int,
        arg3: usize,
        arg4: *const ::std::ffi::c_char,
        arg5: va_list,
    ) -> ::std::ffi::c_int;
}
#[doc = " Structure with log message and meta data passed to callbacks."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dds_log_data_t {
    #[doc = " Log category the message falls into."]
    pub priority: u32,
    #[doc = " Log domain id, UINT32_MAX is global."]
    pub domid: u32,
    #[doc = " Filename where message was generated."]
    pub file: *const ::std::ffi::c_char,
    #[doc = " Line number in file where message was generated."]
    pub line: u32,
    #[doc = " Name of function message where message was generated."]
    pub function: *const ::std::ffi::c_char,
    #[doc = " Log message."]
    pub message: *const ::std::ffi::c_char,
    #[doc = " Size of log message."]
    pub size: usize,
    #[doc = " Default log message header length"]
    pub hdrsize: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_log_data_t"][::std::mem::size_of::<dds_log_data_t>() - 56usize];
    ["Alignment of dds_log_data_t"][::std::mem::align_of::<dds_log_data_t>() - 8usize];
    ["Offset of field: dds_log_data_t::priority"]
        [::std::mem::offset_of!(dds_log_data_t, priority) - 0usize];
    ["Offset of field: dds_log_data_t::domid"]
        [::std::mem::offset_of!(dds_log_data_t, domid) - 4usize];
    ["Offset of field: dds_log_data_t::file"]
        [::std::mem::offset_of!(dds_log_data_t, file) - 8usize];
    ["Offset of field: dds_log_data_t::line"]
        [::std::mem::offset_of!(dds_log_data_t, line) - 16usize];
    ["Offset of field: dds_log_data_t::function"]
        [::std::mem::offset_of!(dds_log_data_t, function) - 24usize];
    ["Offset of field: dds_log_data_t::message"]
        [::std::mem::offset_of!(dds_log_data_t, message) - 32usize];
    ["Offset of field: dds_log_data_t::size"]
        [::std::mem::offset_of!(dds_log_data_t, size) - 40usize];
    ["Offset of field: dds_log_data_t::hdrsize"]
        [::std::mem::offset_of!(dds_log_data_t, hdrsize) - 48usize];
};
impl Default for dds_log_data_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Function signature that log and trace callbacks must adhere too."]
pub type dds_log_write_fn_t = ::std::option::Option<
    unsafe extern "C" fn(p: *mut ::std::ffi::c_void, d: *const dds_log_data_t),
>;
unsafe extern "C" {
    pub static dds_log_mask: *mut u32;
}
unsafe extern "C" {
    #[doc = " @brief Set enabled log and trace categories.\n\n @param[in]  cats  Log and trace categories to enable."]
    pub fn dds_set_log_mask(cats: u32);
}
unsafe extern "C" {
    #[doc = " @private"]
    pub fn dds_set_trace_file(file: *mut FILE);
}
unsafe extern "C" {
    #[doc = " @brief Register callback to receive log messages\n\n Callbacks registered to handle log messages will receive messages of type\n info, warning, error and fatal. Messages that fall into the trace category\n will never be delivered to the callback.\n\n This operation is synchronous and only returns once the operation is\n registered with all threads. Meaning that neither callback or userdata will\n be referenced by the DDS stack on return.\n\n @param[in]  callback  Function pointer matching dds_log_write_fn signature\n                       or a null pointer to restore the default sink.\n @param[in]  userdata  User specified data passed along with each invocation\n                       of callback."]
    pub fn dds_set_log_sink(callback: dds_log_write_fn_t, userdata: *mut ::std::ffi::c_void);
}
unsafe extern "C" {
    #[doc = " @brief Register callback to receive trace messages\n\n Callbacks registered to handle trace messages will receive messages of type\n info, warning, error and fatal as well as all message types that fall into\n the trace category depending on the log mask.\n\n This operation is synchronous and only returns once the operation is\n registered with all threads. Meaning that neither callback or\n userdata will be referenced by the DDS stack on return.\n\n @param[in]  callback  Function pointer matching dds_log_write_fn_t signature\n                       or a null pointer to restore the default sink.\n @param[in]  userdata  User specified data passed along with each invocation\n                       of callback."]
    pub fn dds_set_trace_sink(callback: dds_log_write_fn_t, userdata: *mut ::std::ffi::c_void);
}
unsafe extern "C" {
    #[doc = " @brief Write a log or trace message to the global configuration but with\n specific domain (intended solely for use during domain start-up, while\n the domain-specific logging/tracing hasn't been set yet).\n\n Write a log or trace message to one (or both) of the currently active sinks.\n\n Direct use of #dds_log_id is discouraged. Use #DDS_ILOG instead."]
    pub fn dds_log_id(
        cat: u32,
        domid: u32,
        file: *const ::std::ffi::c_char,
        line: u32,
        func: *const ::std::ffi::c_char,
        fmt: *const ::std::ffi::c_char,
        ...
    );
}
unsafe extern "C" {
    #[doc = " @brief Write a log or trace message to the global log/trace.\n\n Write a log or trace message to one (or both) of the currently active sinks.\n\n Direct use of #dds_log is discouraged. Use #DDS_INFO, #DDS_WARNING,\n #DDS_ERROR, #DDS_FATAL or #DDS_LOG instead."]
    pub fn dds_log(
        cat: u32,
        file: *const ::std::ffi::c_char,
        line: u32,
        func: *const ::std::ffi::c_char,
        fmt: *const ::std::ffi::c_char,
        ...
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct dds_cdrstream_allocator {
    pub malloc: ::std::option::Option<unsafe extern "C" fn(size: usize) -> *mut ::std::ffi::c_void>,
    pub realloc: ::std::option::Option<
        unsafe extern "C" fn(
            ptr: *mut ::std::ffi::c_void,
            new_size: usize,
        ) -> *mut ::std::ffi::c_void,
    >,
    pub free: ::std::option::Option<unsafe extern "C" fn(pt: *mut ::std::ffi::c_void)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_cdrstream_allocator"][::std::mem::size_of::<dds_cdrstream_allocator>() - 24usize];
    ["Alignment of dds_cdrstream_allocator"]
        [::std::mem::align_of::<dds_cdrstream_allocator>() - 8usize];
    ["Offset of field: dds_cdrstream_allocator::malloc"]
        [::std::mem::offset_of!(dds_cdrstream_allocator, malloc) - 0usize];
    ["Offset of field: dds_cdrstream_allocator::realloc"]
        [::std::mem::offset_of!(dds_cdrstream_allocator, realloc) - 8usize];
    ["Offset of field: dds_cdrstream_allocator::free"]
        [::std::mem::offset_of!(dds_cdrstream_allocator, free) - 16usize];
};
unsafe extern "C" {
    pub static dds_cdrstream_default_allocator: dds_cdrstream_allocator;
}
#[doc = "< free full sample"]
pub const dds_free_op_t_DDS_FREE_ALL: dds_free_op_t = 7;
#[doc = "< free all sample contents, but leave sample pointer intact"]
pub const dds_free_op_t_DDS_FREE_CONTENTS: dds_free_op_t = 3;
#[doc = "< free only the keyfields in a sample"]
pub const dds_free_op_t_DDS_FREE_KEY: dds_free_op_t = 1;
#[doc = " @brief Freeing operation type\n @ingroup alloc\n What part of a sample to free"]
pub type dds_free_op_t = ::std::ffi::c_uint;
#[doc = " @brief DDS Allocator\n @ingroup alloc\n C-Style allocator API"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct dds_allocator {
    #[doc = "< behave like C malloc"]
    pub malloc: ::std::option::Option<unsafe extern "C" fn(size: usize) -> *mut ::std::ffi::c_void>,
    #[doc = "< behave like C realloc, may be null"]
    pub realloc: ::std::option::Option<
        unsafe extern "C" fn(ptr: *mut ::std::ffi::c_void, size: usize) -> *mut ::std::ffi::c_void,
    >,
    #[doc = "< behave like C free"]
    pub free: ::std::option::Option<unsafe extern "C" fn(ptr: *mut ::std::ffi::c_void)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_allocator"][::std::mem::size_of::<dds_allocator>() - 24usize];
    ["Alignment of dds_allocator"][::std::mem::align_of::<dds_allocator>() - 8usize];
    ["Offset of field: dds_allocator::malloc"]
        [::std::mem::offset_of!(dds_allocator, malloc) - 0usize];
    ["Offset of field: dds_allocator::realloc"]
        [::std::mem::offset_of!(dds_allocator, realloc) - 8usize];
    ["Offset of field: dds_allocator::free"][::std::mem::offset_of!(dds_allocator, free) - 16usize];
};
#[doc = " @brief DDS Allocator\n @ingroup alloc\n C-Style allocator API"]
pub type dds_allocator_t = dds_allocator;
unsafe extern "C" {
    #[doc = " @brief Perform an alloc() with the default allocator.\n @component memory_alloc\n\n @param[in] size number of bytes\n @returns new pointer or NULL if out of memory"]
    pub fn dds_alloc(size: usize) -> *mut ::std::ffi::c_void;
}
unsafe extern "C" {
    #[doc = " @brief Perform a realloc() with the default allocator.\n @component memory_alloc\n\n @param[in] ptr previously alloc()'ed pointer\n @param[in] size new size\n @return new pointer or NULL if out of memory"]
    pub fn dds_realloc(ptr: *mut ::std::ffi::c_void, size: usize) -> *mut ::std::ffi::c_void;
}
unsafe extern "C" {
    #[doc = " @brief Perform a realloc() with the default allocator. Zero out memory.\n @component memory_alloc\n\n @param[in] ptr previously alloc()'ed pointer\n @param[in] size new size\n @return new pointer or NULL if out of memory"]
    pub fn dds_realloc_zero(ptr: *mut ::std::ffi::c_void, size: usize) -> *mut ::std::ffi::c_void;
}
unsafe extern "C" {
    #[doc = " @brief Perform a free() on a memory fragment allocated with the default allocator.\n @component memory_alloc\n\n @param[in] ptr previously alloc()'ed pointer"]
    pub fn dds_free(ptr: *mut ::std::ffi::c_void);
}
pub type dds_alloc_fn_t =
    ::std::option::Option<unsafe extern "C" fn(p: usize) -> *mut ::std::ffi::c_void>;
pub type dds_realloc_fn_t = ::std::option::Option<
    unsafe extern "C" fn(a: *mut ::std::ffi::c_void, b: usize) -> *mut ::std::ffi::c_void,
>;
pub type dds_free_fn_t = ::std::option::Option<unsafe extern "C" fn(p: *mut ::std::ffi::c_void)>;
unsafe extern "C" {
    #[doc = " @brief Allocated a string with size, accounting for the null terminator.\n @component memory_alloc\n\n @param[in] size number of characters\n @returns newly allocated string or NULL if out of memory"]
    pub fn dds_string_alloc(size: usize) -> *mut ::std::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " @brief Duplicate a null-terminated string\n @component memory_alloc\n\n @param[in] str string to duplicate\n @returns newly allocated duplicate string, or NULL if out of memory"]
    pub fn dds_string_dup(str_: *const ::std::ffi::c_char) -> *mut ::std::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " @brief Free a string, equivalent to dds_free\n @component memory_alloc\n\n @param[in] str string to free"]
    pub fn dds_string_free(str_: *mut ::std::ffi::c_char);
}
unsafe extern "C" {
    #[doc = " @brief Free (parts of) a sample according to the \\ref dds_free_op_t\n @component memory_alloc\n\n @param[in] sample sample to free\n @param[in] desc topic descriptor of the type this sample was created from.\n @param[in] op Which parts of the sample to free."]
    pub fn dds_sample_free(
        sample: *mut ::std::ffi::c_void,
        desc: *const dds_topic_descriptor,
        op: dds_free_op_t,
    );
}
#[doc = " return from subroutine, exits top-level\n[RTS,   0,   0, 0]"]
pub const dds_stream_opcode_DDS_OP_RTS: dds_stream_opcode = 0;
#[doc = " data field\n[ADR, nBY,   0, f] [offset]\n[ADR, BLN,   0, f] [offset]\n[ADR, WCHAR,   0, f] [offset]\n[ADR, ENU,   0, f] [offset] [max]\n[ADR, BMK,   0, f] [offset] [bits-high] [bits-low]\n[ADR, STR,   0, f] [offset]\n[ADR, WSTR,   0, f] [offset]\n[ADR, BST,   0, f] [offset] [max-size]\n[ADR, BWSTR,   0, f] [offset] [max-size]\n\n[ADR, SEQ, nBY, f] [offset]\n[ADR, SEQ, BLN, f] [offset]\n[ADR, SEQ, WCHAR, f] [offset]\n[ADR, SEQ, ENU, f] [offset] [max]\n[ADR, SEQ, BMK, f] [offset] [bits-high] [bits-low]\n[ADR, SEQ, STR, f] [offset]\n[ADR, SEQ, WSTR, f] [offset]\n[ADR, SEQ, BST, f] [offset] [max-size]\n[ADR, SEQ, BWSTR, f] [offset] [max-size]\n[ADR, SEQ,   s, f] [offset] [elem-size] [next-insn, elem-insn]\nwhere s = {SEQ,ARR,UNI,STU,BSQ}\n[ADR, SEQ, EXT, f] *** not supported\n\n[ADR, BSQ, nBY, f] [offset] [sbound]\n[ADR, BSQ, BLN, f] [offset] [sbound]\n[ADR, BSQ, WCHAR, f] [offset] [sbound]\n[ADR, BSQ, ENU, f] [offset] [sbound] [max]\n[ADR, BSQ, BMK, f] [offset] [sbound] [bits-high] [bits-low]\n[ADR, BSQ, STR, f] [offset] [sbound]\n[ADR, BSQ, WSTR, f] [offset] [sbound]\n[ADR, BSQ, BST, f] [offset] [sbound] [max-size]\n[ADR, BSQ, BWSTR, f] [offset] [sbound] [max-size]\n[ADR, BSQ,   s, f] [offset] [sbound] [elem-size] [next-insn, elem-insn]\nwhere s = {SEQ,ARR,UNI,STU,BSQ}\n[ADR, BSQ, EXT, f] *** not supported\n\n[ADR, ARR, nBY, f] [offset] [alen]\n[ADR, ARR, BLN, f] [offset] [alen]\n[ADR, ARR, WCHAR, f] [offset] [alen]\n[ADR, ARR, ENU, f] [offset] [alen] [max]\n[ADR, ARR, BMK, f] [offset] [alen] [bits-high] [bits-low]\n[ADR, ARR, STR, f] [offset] [alen]\n[ADR, ARR, WSTR, f] [offset] [alen]\n[ADR, ARR, BST, f] [offset] [alen] [0] [max-size]\n[ADR, ARR, BWSTR, f] [offset] [alen] [0] [max-size]\n[ADR, ARR,   s, f] [offset] [alen] [next-insn, elem-insn] [elem-size]\nwhere s = {SEQ,ARR,UNI,STU,BSQ}\n[ADR, ARR, EXT, f] *** not supported\n\n[ADR, UNI,   d, z] [offset] [alen] [next-insn, cases]\n[ADR, UNI, ENU, z] [offset] [alen] [next-insn, cases] [max]\n[ADR, UNI, EXT, f] *** not supported\nwhere\nd = discriminant type of {1BY,2BY,4BY,BLN}\nz = default present/not present (DDS_OP_FLAG_DEF)\noffset = discriminant offset\nmax = max enum value\nfollowed by alen case labels: in JEQ format\n\n[ADR, e | EXT,   0, f] [offset] [next-insn, elem-insn] [elem-size iff \"external\" flag e is set, or flag f has DDS_OP_FLAG_OPT]\n[ADR, STU,   0, f] *** not supported\nwhere\ns            = subtype\ne            = external: stored as external data (pointer) (DDS_OP_FLAG_EXT)\nf            = flags:\n- key/not key (DDS_OP_FLAG_KEY)\n- base type member, used with EXT type (DDS_OP_FLAG_BASE)\n- optional (DDS_OP_FLAG_OPT)\n- must-understand (DDS_OP_FLAG_MU)\n- storage size, only for ENU and BMK (n << DDS_OP_FLAG_SZ_SHIFT)\n[offset]     = field offset from start of element in memory\n[elem-size]  = element size in memory (elem-size is only included in case 'external' flag is set)\n[max-size]   = string bound + 1\n[max]        = max enum value\n[bits-..]    = identified bits in the bitmask, split into high and low 32 bits\n[alen]       = array length, number of cases\n[sbound]     = bounded sequence maximum number of elements\n[next-insn]  = (unsigned 16 bits) offset to instruction for next field, from start of insn\n[elem-insn]  = (unsigned 16 bits) offset to first instruction for element, from start of insn\n[cases]      = (unsigned 16 bits) offset to first case label, from start of insn"]
pub const dds_stream_opcode_DDS_OP_ADR: dds_stream_opcode = 16777216;
#[doc = " jump-to-subroutine (e.g. used for recursive types and appendable unions)\n[JSR,   0, e]\nwhere\ne = (signed 16 bits) offset to first instruction in subroutine, from start of insn\ninstruction sequence must end in RTS, execution resumes at instruction\nfollowing JSR"]
pub const dds_stream_opcode_DDS_OP_JSR: dds_stream_opcode = 33554432;
#[doc = " jump-if-equal, used for union cases:\n[JEQ, nBY, 0] [disc] [offset]\n[JEQ, BLN, 0] [disc] [offset]\n[JEQ, STR, 0] [disc] [offset]\n[JEQ, s,   i] [disc] [offset]\n[JEQ4, e | nBY, 0] [disc] [offset] 0\n[JEQ4, e | STR, 0] [disc] [offset] 0\n[JEQ4, e | ENU, f] [disc] [offset] [max]\n[JEQ4, EXT, 0] *** not supported, use STU/UNI for external defined types\n[JEQ4, e | s, i] [disc] [offset] [elem-size iff \"external\" flag e is set, else 0]\nwhere\ne  = external: stored as external data (pointer) (DDS_OP_FLAG_EXT)\ns  = subtype other than {nBY,STR} for JEQ and {nBY,STR,ENU,EXT} for JEQ4\n(note that BMK cannot be inline, because it needs 2 additional instructions\nfor the bits that are identified in the bitmask type)\ni  = (unsigned 16 bits) offset to first instruction for case, from start of insn\ninstruction sequence must end in RTS, at which point executes continues\nat the next field's instruction as specified by the union\nf  = size flags for ENU instruction\n\nNote that the JEQ instruction is deprecated and replaced by the JEQ4 instruction. The\nIDL compiler only generates JEQ4 for union cases, the JEQ instruction is included here\nfor backwards compatibility (topic descriptors generated with a previous version of IDLC)"]
pub const dds_stream_opcode_DDS_OP_JEQ: dds_stream_opcode = 50331648;
#[doc = " XCDR2 delimited CDR (inserts DHEADER before type)\n[DLC, 0, 0]"]
pub const dds_stream_opcode_DDS_OP_DLC: dds_stream_opcode = 67108864;
#[doc = " XCDR2 parameter list CDR (inserts DHEADER before type and EMHEADER before each member)\n[PLC, 0, 0]\nfollowed by a list of JEQ instructions"]
pub const dds_stream_opcode_DDS_OP_PLC: dds_stream_opcode = 83886080;
#[doc = "[PLM,   f, elem-insn] [member id]\nfor members of aggregated mutable types (pl-cdr):\nwhere\nf           = flags:\n- jump to base type (DDS_OP_FLAG_BASE)\n[elem-insn] = (unsigned 16 bits) offset to instruction for element, from start of insn\nwhen FLAG_BASE is set, this is the offset of the PLM list of the base type\n[member id] = id for this member (0 in case FLAG_BASE is set)"]
pub const dds_stream_opcode_DDS_OP_PLM: dds_stream_opcode = 100663296;
#[doc = " Key offset list\n[KOF, 0, n] [offset-1] ... [offset-n]\nwhere\nn      = number of key offsets in following ops\noffset = Offset of the key field relative to the previous offset, repeated n times when key is\nin a nested struct. In case of inheritance of mutable structs, a single offset of\nthe key member relative to the first op of the top-level type (index 0)."]
pub const dds_stream_opcode_DDS_OP_KOF: dds_stream_opcode = 117440512;
#[doc = " see comment for JEQ/JEQ4 above"]
pub const dds_stream_opcode_DDS_OP_JEQ4: dds_stream_opcode = 134217728;
#[doc = " [MID, 0, elem-insn] [member id]\nFor members of aggregated final and appendable types. Currently only for optional members\nthe member ID is included, to facilitate adding the parameter header in XCDR1 data\nrepresentation.\nwhere\n[elem-insn] = (unsigned 16 bits) offset to instruction for element, from start of insn\n[member id] = id for this member"]
pub const dds_stream_opcode_DDS_OP_MID: dds_stream_opcode = 150994944;
#[doc = " @ingroup serialization\n @brief Topic encoding instruction types"]
pub type dds_stream_opcode = ::std::ffi::c_uint;
#[doc = "< one byte simple type (char, octet)"]
pub const dds_stream_typecode_DDS_OP_VAL_1BY: dds_stream_typecode = 1;
#[doc = "< two byte simple type ((unsigned) short)"]
pub const dds_stream_typecode_DDS_OP_VAL_2BY: dds_stream_typecode = 2;
#[doc = "< four byte simple type ((unsigned) long, float)"]
pub const dds_stream_typecode_DDS_OP_VAL_4BY: dds_stream_typecode = 3;
#[doc = "< eight byte simple type ((unsigned) long long, double)"]
pub const dds_stream_typecode_DDS_OP_VAL_8BY: dds_stream_typecode = 4;
#[doc = "< string"]
pub const dds_stream_typecode_DDS_OP_VAL_STR: dds_stream_typecode = 5;
#[doc = "< bounded string"]
pub const dds_stream_typecode_DDS_OP_VAL_BST: dds_stream_typecode = 6;
#[doc = "< sequence"]
pub const dds_stream_typecode_DDS_OP_VAL_SEQ: dds_stream_typecode = 7;
#[doc = "< array"]
pub const dds_stream_typecode_DDS_OP_VAL_ARR: dds_stream_typecode = 8;
#[doc = "< union"]
pub const dds_stream_typecode_DDS_OP_VAL_UNI: dds_stream_typecode = 9;
#[doc = "< struct"]
pub const dds_stream_typecode_DDS_OP_VAL_STU: dds_stream_typecode = 10;
#[doc = "< bounded sequence"]
pub const dds_stream_typecode_DDS_OP_VAL_BSQ: dds_stream_typecode = 11;
#[doc = "< enumerated value (long)"]
pub const dds_stream_typecode_DDS_OP_VAL_ENU: dds_stream_typecode = 12;
#[doc = "< field with external definition"]
pub const dds_stream_typecode_DDS_OP_VAL_EXT: dds_stream_typecode = 13;
#[doc = "< boolean"]
pub const dds_stream_typecode_DDS_OP_VAL_BLN: dds_stream_typecode = 14;
#[doc = "< bitmask"]
pub const dds_stream_typecode_DDS_OP_VAL_BMK: dds_stream_typecode = 15;
#[doc = "< wstring (UTF-16)"]
pub const dds_stream_typecode_DDS_OP_VAL_WSTR: dds_stream_typecode = 16;
#[doc = "< bounded wstring (UTF-16)"]
pub const dds_stream_typecode_DDS_OP_VAL_BWSTR: dds_stream_typecode = 17;
#[doc = "< wchar: UTF-16, no surrogates allowed"]
pub const dds_stream_typecode_DDS_OP_VAL_WCHAR: dds_stream_typecode = 18;
#[doc = " @ingroup serialization\n @brief datatypes as recognized by serialization VM."]
pub type dds_stream_typecode = ::std::ffi::c_uint;
#[doc = "< one byte simple type (char, octet)"]
pub const dds_stream_typecode_primary_DDS_OP_TYPE_1BY: dds_stream_typecode_primary = 65536;
#[doc = "< two byte simple type ((unsigned) short)"]
pub const dds_stream_typecode_primary_DDS_OP_TYPE_2BY: dds_stream_typecode_primary = 131072;
#[doc = "< four byte simple type ((unsigned) long, float)"]
pub const dds_stream_typecode_primary_DDS_OP_TYPE_4BY: dds_stream_typecode_primary = 196608;
#[doc = "< eight byte simple type ((unsigned) long long, double)"]
pub const dds_stream_typecode_primary_DDS_OP_TYPE_8BY: dds_stream_typecode_primary = 262144;
#[doc = "< string"]
pub const dds_stream_typecode_primary_DDS_OP_TYPE_STR: dds_stream_typecode_primary = 327680;
#[doc = "< bounded string"]
pub const dds_stream_typecode_primary_DDS_OP_TYPE_BST: dds_stream_typecode_primary = 393216;
#[doc = "< sequence"]
pub const dds_stream_typecode_primary_DDS_OP_TYPE_SEQ: dds_stream_typecode_primary = 458752;
#[doc = "< array"]
pub const dds_stream_typecode_primary_DDS_OP_TYPE_ARR: dds_stream_typecode_primary = 524288;
#[doc = "< union"]
pub const dds_stream_typecode_primary_DDS_OP_TYPE_UNI: dds_stream_typecode_primary = 589824;
#[doc = "< struct"]
pub const dds_stream_typecode_primary_DDS_OP_TYPE_STU: dds_stream_typecode_primary = 655360;
#[doc = "< bounded sequence"]
pub const dds_stream_typecode_primary_DDS_OP_TYPE_BSQ: dds_stream_typecode_primary = 720896;
#[doc = "< enumerated value (long)"]
pub const dds_stream_typecode_primary_DDS_OP_TYPE_ENU: dds_stream_typecode_primary = 786432;
#[doc = "< field with external definition"]
pub const dds_stream_typecode_primary_DDS_OP_TYPE_EXT: dds_stream_typecode_primary = 851968;
#[doc = "< boolean"]
pub const dds_stream_typecode_primary_DDS_OP_TYPE_BLN: dds_stream_typecode_primary = 917504;
#[doc = "< bitmask"]
pub const dds_stream_typecode_primary_DDS_OP_TYPE_BMK: dds_stream_typecode_primary = 983040;
#[doc = "< wstring (UTF-16)"]
pub const dds_stream_typecode_primary_DDS_OP_TYPE_WSTR: dds_stream_typecode_primary = 1048576;
#[doc = "< bounded wstring (UTF-16)"]
pub const dds_stream_typecode_primary_DDS_OP_TYPE_BWSTR: dds_stream_typecode_primary = 1114112;
#[doc = "< wchar: UTF-16, no surrogates allowed"]
pub const dds_stream_typecode_primary_DDS_OP_TYPE_WCHAR: dds_stream_typecode_primary = 1179648;
#[doc = " @ingroup serialization\n @brief primary type code for DDS_OP_ADR, DDS_OP_JEQ\n Convinience pre-bitshifted values."]
pub type dds_stream_typecode_primary = ::std::ffi::c_uint;
#[doc = "< one byte simple type (char, octet)"]
pub const dds_stream_typecode_subtype_DDS_OP_SUBTYPE_1BY: dds_stream_typecode_subtype = 256;
#[doc = "< two byte simple type ((unsigned) short)"]
pub const dds_stream_typecode_subtype_DDS_OP_SUBTYPE_2BY: dds_stream_typecode_subtype = 512;
#[doc = "< four byte simple type ((unsigned) long, float)"]
pub const dds_stream_typecode_subtype_DDS_OP_SUBTYPE_4BY: dds_stream_typecode_subtype = 768;
#[doc = "< eight byte simple type ((unsigned) long long, double)"]
pub const dds_stream_typecode_subtype_DDS_OP_SUBTYPE_8BY: dds_stream_typecode_subtype = 1024;
#[doc = "< string"]
pub const dds_stream_typecode_subtype_DDS_OP_SUBTYPE_STR: dds_stream_typecode_subtype = 1280;
#[doc = "< bounded string"]
pub const dds_stream_typecode_subtype_DDS_OP_SUBTYPE_BST: dds_stream_typecode_subtype = 1536;
#[doc = "< sequence"]
pub const dds_stream_typecode_subtype_DDS_OP_SUBTYPE_SEQ: dds_stream_typecode_subtype = 1792;
#[doc = "< array"]
pub const dds_stream_typecode_subtype_DDS_OP_SUBTYPE_ARR: dds_stream_typecode_subtype = 2048;
#[doc = "< union"]
pub const dds_stream_typecode_subtype_DDS_OP_SUBTYPE_UNI: dds_stream_typecode_subtype = 2304;
#[doc = "< struct"]
pub const dds_stream_typecode_subtype_DDS_OP_SUBTYPE_STU: dds_stream_typecode_subtype = 2560;
#[doc = "< bounded sequence"]
pub const dds_stream_typecode_subtype_DDS_OP_SUBTYPE_BSQ: dds_stream_typecode_subtype = 2816;
#[doc = "< enumerated value (long)"]
pub const dds_stream_typecode_subtype_DDS_OP_SUBTYPE_ENU: dds_stream_typecode_subtype = 3072;
#[doc = "< boolean"]
pub const dds_stream_typecode_subtype_DDS_OP_SUBTYPE_BLN: dds_stream_typecode_subtype = 3584;
#[doc = "< bitmask"]
pub const dds_stream_typecode_subtype_DDS_OP_SUBTYPE_BMK: dds_stream_typecode_subtype = 3840;
#[doc = "< wstring"]
pub const dds_stream_typecode_subtype_DDS_OP_SUBTYPE_WSTR: dds_stream_typecode_subtype = 4096;
#[doc = "< bounded wstring"]
pub const dds_stream_typecode_subtype_DDS_OP_SUBTYPE_BWSTR: dds_stream_typecode_subtype = 4352;
#[doc = "< wchar: UTF-16, no surrogates allowed"]
pub const dds_stream_typecode_subtype_DDS_OP_SUBTYPE_WCHAR: dds_stream_typecode_subtype = 4608;
#[doc = " @ingroup serialization\n @brief sub-type code\n  - encodes element type for DDS_OP_TYPE_{SEQ,ARR},\n  - discriminant type for DDS_OP_TYPE_UNI\n Convinience pre-bitshifted values."]
pub type dds_stream_typecode_subtype = ::std::ffi::c_uint;
#[doc = " @ingroup implementation\n @brief Datastructure of a Sequence type\n Container for a sequence of bytes. The general model of this type is also used in IDL output,\n where the uint8_t * _buffer is replaced by the appropriate subtype of what is contained."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dds_sequence {
    #[doc = "< Allocated space in _buffer"]
    pub _maximum: u32,
    #[doc = "< Used space in _buffer"]
    pub _length: u32,
    #[doc = "< Sequence of bytes"]
    pub _buffer: *mut u8,
    #[doc = "< Whether a CycloneDDS _free method should free the contained buffer.\nif you put in your own allocated _buffer set this to false to avoid\nCycloneDDS calling free() on it."]
    pub _release: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_sequence"][::std::mem::size_of::<dds_sequence>() - 24usize];
    ["Alignment of dds_sequence"][::std::mem::align_of::<dds_sequence>() - 8usize];
    ["Offset of field: dds_sequence::_maximum"]
        [::std::mem::offset_of!(dds_sequence, _maximum) - 0usize];
    ["Offset of field: dds_sequence::_length"]
        [::std::mem::offset_of!(dds_sequence, _length) - 4usize];
    ["Offset of field: dds_sequence::_buffer"]
        [::std::mem::offset_of!(dds_sequence, _buffer) - 8usize];
    ["Offset of field: dds_sequence::_release"]
        [::std::mem::offset_of!(dds_sequence, _release) - 16usize];
};
impl Default for dds_sequence {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @ingroup implementation\n @brief Datastructure of a Sequence type\n Container for a sequence of bytes. The general model of this type is also used in IDL output,\n where the uint8_t * _buffer is replaced by the appropriate subtype of what is contained."]
pub type dds_sequence_t = dds_sequence;
#[doc = " @ingroup implementation\n @brief Key Descriptor\n Used to describe a named key field in a type with the offset from the start of a struct."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dds_key_descriptor {
    #[doc = "< name of keyfield"]
    pub m_name: *const ::std::ffi::c_char,
    #[doc = "< offset from pointer"]
    pub m_offset: u32,
    #[doc = "< m_idx'th key of type"]
    pub m_idx: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_key_descriptor"][::std::mem::size_of::<dds_key_descriptor>() - 16usize];
    ["Alignment of dds_key_descriptor"][::std::mem::align_of::<dds_key_descriptor>() - 8usize];
    ["Offset of field: dds_key_descriptor::m_name"]
        [::std::mem::offset_of!(dds_key_descriptor, m_name) - 0usize];
    ["Offset of field: dds_key_descriptor::m_offset"]
        [::std::mem::offset_of!(dds_key_descriptor, m_offset) - 8usize];
    ["Offset of field: dds_key_descriptor::m_idx"]
        [::std::mem::offset_of!(dds_key_descriptor, m_idx) - 12usize];
};
impl Default for dds_key_descriptor {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @ingroup implementation\n @brief Key Descriptor\n Used to describe a named key field in a type with the offset from the start of a struct."]
pub type dds_key_descriptor_t = dds_key_descriptor;
#[doc = " @ingroup topic_definition\n @brief Simple sized byte container to hold serialized type info\n Holds XTypes information (TypeInformation, TypeMapping) for a\n type"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dds_type_meta_ser {
    #[doc = "< data pointer"]
    pub data: *const ::std::ffi::c_uchar,
    #[doc = "< data size"]
    pub sz: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_type_meta_ser"][::std::mem::size_of::<dds_type_meta_ser>() - 16usize];
    ["Alignment of dds_type_meta_ser"][::std::mem::align_of::<dds_type_meta_ser>() - 8usize];
    ["Offset of field: dds_type_meta_ser::data"]
        [::std::mem::offset_of!(dds_type_meta_ser, data) - 0usize];
    ["Offset of field: dds_type_meta_ser::sz"]
        [::std::mem::offset_of!(dds_type_meta_ser, sz) - 8usize];
};
impl Default for dds_type_meta_ser {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Topic Descriptor\n @ingroup topic_definition\n @warning Unstable/Private API\n Contains all meta information about a type, usually produced by the IDL compiler\n Since this type is not intended for public consumption it can change without warning."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dds_topic_descriptor {
    #[doc = "< Size of topic type"]
    pub m_size: u32,
    #[doc = "< Alignment of topic type"]
    pub m_align: u32,
    #[doc = "< Flags"]
    pub m_flagset: u32,
    #[doc = "< Number of keys (can be 0)"]
    pub m_nkeys: u32,
    #[doc = "< Type name"]
    pub m_typename: *const ::std::ffi::c_char,
    #[doc = "< Key descriptors (NULL iff m_nkeys 0)"]
    pub m_keys: *const dds_key_descriptor_t,
    #[doc = "< Number of ops in m_ops"]
    pub m_nops: u32,
    #[doc = "< Marshalling meta data"]
    pub m_ops: *const u32,
    #[doc = "< XML topic description meta data"]
    pub m_meta: *const ::std::ffi::c_char,
    #[doc = "< XCDR2 serialized TypeInformation, only present if flag DDS_TOPIC_XTYPES_METADATA is set"]
    pub type_information: dds_type_meta_ser,
    #[doc = "< XCDR2 serialized TypeMapping: maps type-id to type object and minimal to complete type id,\nonly present if flag DDS_TOPIC_XTYPES_METADATA is set"]
    pub type_mapping: dds_type_meta_ser,
    #[doc = "< restrictions on the data representations allowed for the top-level type for this topic,\nonly present if flag DDS_TOPIC_RESTRICT_DATA_REPRESENTATION"]
    pub restrict_data_representation: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_topic_descriptor"][::std::mem::size_of::<dds_topic_descriptor>() - 96usize];
    ["Alignment of dds_topic_descriptor"][::std::mem::align_of::<dds_topic_descriptor>() - 8usize];
    ["Offset of field: dds_topic_descriptor::m_size"]
        [::std::mem::offset_of!(dds_topic_descriptor, m_size) - 0usize];
    ["Offset of field: dds_topic_descriptor::m_align"]
        [::std::mem::offset_of!(dds_topic_descriptor, m_align) - 4usize];
    ["Offset of field: dds_topic_descriptor::m_flagset"]
        [::std::mem::offset_of!(dds_topic_descriptor, m_flagset) - 8usize];
    ["Offset of field: dds_topic_descriptor::m_nkeys"]
        [::std::mem::offset_of!(dds_topic_descriptor, m_nkeys) - 12usize];
    ["Offset of field: dds_topic_descriptor::m_typename"]
        [::std::mem::offset_of!(dds_topic_descriptor, m_typename) - 16usize];
    ["Offset of field: dds_topic_descriptor::m_keys"]
        [::std::mem::offset_of!(dds_topic_descriptor, m_keys) - 24usize];
    ["Offset of field: dds_topic_descriptor::m_nops"]
        [::std::mem::offset_of!(dds_topic_descriptor, m_nops) - 32usize];
    ["Offset of field: dds_topic_descriptor::m_ops"]
        [::std::mem::offset_of!(dds_topic_descriptor, m_ops) - 40usize];
    ["Offset of field: dds_topic_descriptor::m_meta"]
        [::std::mem::offset_of!(dds_topic_descriptor, m_meta) - 48usize];
    ["Offset of field: dds_topic_descriptor::type_information"]
        [::std::mem::offset_of!(dds_topic_descriptor, type_information) - 56usize];
    ["Offset of field: dds_topic_descriptor::type_mapping"]
        [::std::mem::offset_of!(dds_topic_descriptor, type_mapping) - 72usize];
    ["Offset of field: dds_topic_descriptor::restrict_data_representation"]
        [::std::mem::offset_of!(dds_topic_descriptor, restrict_data_representation) - 88usize];
};
impl Default for dds_topic_descriptor {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Topic Descriptor\n @ingroup topic_definition\n @warning Unstable/Private API\n Contains all meta information about a type, usually produced by the IDL compiler\n Since this type is not intended for public consumption it can change without warning."]
pub type dds_topic_descriptor_t = dds_topic_descriptor;
#[doc = "< Retrieving any entity"]
pub const dds_entity_kind_DDS_KIND_DONTCARE: dds_entity_kind = 0;
#[doc = "< Topic entity"]
pub const dds_entity_kind_DDS_KIND_TOPIC: dds_entity_kind = 1;
#[doc = "< Domain Participant entity"]
pub const dds_entity_kind_DDS_KIND_PARTICIPANT: dds_entity_kind = 2;
#[doc = "< Reader entity"]
pub const dds_entity_kind_DDS_KIND_READER: dds_entity_kind = 3;
#[doc = "< Writer entity"]
pub const dds_entity_kind_DDS_KIND_WRITER: dds_entity_kind = 4;
#[doc = "< Subscriber entity"]
pub const dds_entity_kind_DDS_KIND_SUBSCRIBER: dds_entity_kind = 5;
#[doc = "< Publisher entity"]
pub const dds_entity_kind_DDS_KIND_PUBLISHER: dds_entity_kind = 6;
#[doc = "< ReadCondition entity"]
pub const dds_entity_kind_DDS_KIND_COND_READ: dds_entity_kind = 7;
#[doc = "< QueryCondition entity"]
pub const dds_entity_kind_DDS_KIND_COND_QUERY: dds_entity_kind = 8;
#[doc = "< GuardCondition entity"]
pub const dds_entity_kind_DDS_KIND_COND_GUARD: dds_entity_kind = 9;
#[doc = "< WaitSet entity"]
pub const dds_entity_kind_DDS_KIND_WAITSET: dds_entity_kind = 10;
#[doc = "< Domain entity"]
pub const dds_entity_kind_DDS_KIND_DOMAIN: dds_entity_kind = 11;
#[doc = "< CycloneDDS library entity"]
pub const dds_entity_kind_DDS_KIND_CYCLONEDDS: dds_entity_kind = 12;
#[doc = " @brief DDS Entity Kind constants\n @ingroup internal\n @warning Unstable/Private API\n Used throughout the library to indicate what entity is what."]
pub type dds_entity_kind = ::std::ffi::c_uint;
#[doc = " @brief DDS Entity Kind constants\n @ingroup internal\n @warning Unstable/Private API\n Used throughout the library to indicate what entity is what."]
pub use self::dds_entity_kind as dds_entity_kind_t;
#[doc = " @ingroup internal\n @warning Private API\n @brief Instance handles are uint64_t behind the scenes"]
pub type dds_instance_handle_t = u64;
#[doc = " @ingroup domain\n @brief Domain IDs are 32 bit unsigned integers."]
pub type dds_domainid_t = u32;
#[doc = "< locate the topic anywhere CycloneDDS knows about"]
pub const dds_find_scope_DDS_FIND_SCOPE_GLOBAL: dds_find_scope = 0;
#[doc = "< locate the topic locally within domain boundaries"]
pub const dds_find_scope_DDS_FIND_SCOPE_LOCAL_DOMAIN: dds_find_scope = 1;
#[doc = "< locate the topic within the current participant"]
pub const dds_find_scope_DDS_FIND_SCOPE_PARTICIPANT: dds_find_scope = 2;
#[doc = " @ingroup topic\n @brief Scope for dds_find_topic()"]
pub type dds_find_scope = ::std::ffi::c_uint;
#[doc = " @ingroup topic\n @brief Scope for dds_find_topic()"]
pub use self::dds_find_scope as dds_find_scope_t;
#[doc = "< XTypes Minimal Type ID"]
pub const dds_typeid_kind_DDS_TYPEID_MINIMAL: dds_typeid_kind = 0;
#[doc = "< XTypes Complete Type ID"]
pub const dds_typeid_kind_DDS_TYPEID_COMPLETE: dds_typeid_kind = 1;
#[doc = " @ingroup builtintopic\n @brief Type identifier kind for getting endpoint type identifier"]
pub type dds_typeid_kind = ::std::ffi::c_uint;
#[doc = " @ingroup builtintopic\n @brief Type identifier kind for getting endpoint type identifier"]
pub use self::dds_typeid_kind as dds_typeid_kind_t;
unsafe extern "C" {
    #[doc = " @brief Enable or disable write batching.\n @component domain\n\n Overrides default configuration setting for write batching (Internal/WriteBatch).\n\n @param[in] enable Enables or disables write batching for all writers."]
    pub fn dds_write_set_batch(enable: bool);
}
#[doc = "< Invalid Policy"]
pub const dds_qos_policy_id_DDS_INVALID_QOS_POLICY_ID: dds_qos_policy_id = 0;
#[doc = "< Userdata policy dds_qset_userdata()"]
pub const dds_qos_policy_id_DDS_USERDATA_QOS_POLICY_ID: dds_qos_policy_id = 1;
#[doc = "< Durability policy dds_qset_durability()"]
pub const dds_qos_policy_id_DDS_DURABILITY_QOS_POLICY_ID: dds_qos_policy_id = 2;
#[doc = "< Presentation policy dds_qset_presentation()"]
pub const dds_qos_policy_id_DDS_PRESENTATION_QOS_POLICY_ID: dds_qos_policy_id = 3;
#[doc = "< Deadline policy dds_qset_deadline()"]
pub const dds_qos_policy_id_DDS_DEADLINE_QOS_POLICY_ID: dds_qos_policy_id = 4;
#[doc = "< LatencyBudget policy dds_qset_latency_budget()"]
pub const dds_qos_policy_id_DDS_LATENCYBUDGET_QOS_POLICY_ID: dds_qos_policy_id = 5;
#[doc = "< Ownership policy dds_qset_ownership()"]
pub const dds_qos_policy_id_DDS_OWNERSHIP_QOS_POLICY_ID: dds_qos_policy_id = 6;
#[doc = "< OwnershipStrength policy dds_qset_ownership_strength()"]
pub const dds_qos_policy_id_DDS_OWNERSHIPSTRENGTH_QOS_POLICY_ID: dds_qos_policy_id = 7;
#[doc = "< Liveliness policy dds_qset_liveliness()"]
pub const dds_qos_policy_id_DDS_LIVELINESS_QOS_POLICY_ID: dds_qos_policy_id = 8;
#[doc = "< TimeBasedFilter policy dds_qset_time_based_filter()"]
pub const dds_qos_policy_id_DDS_TIMEBASEDFILTER_QOS_POLICY_ID: dds_qos_policy_id = 9;
#[doc = "< Partition policy dds_qset_partition()"]
pub const dds_qos_policy_id_DDS_PARTITION_QOS_POLICY_ID: dds_qos_policy_id = 10;
#[doc = "< Reliability policy dds_qset_reliability()"]
pub const dds_qos_policy_id_DDS_RELIABILITY_QOS_POLICY_ID: dds_qos_policy_id = 11;
#[doc = "< DestinationOrder policy dds_qset_destination_order()"]
pub const dds_qos_policy_id_DDS_DESTINATIONORDER_QOS_POLICY_ID: dds_qos_policy_id = 12;
#[doc = "< History policy dds_qset_history()"]
pub const dds_qos_policy_id_DDS_HISTORY_QOS_POLICY_ID: dds_qos_policy_id = 13;
#[doc = "< ResourceLimits policy dds_qset_resource_limits()"]
pub const dds_qos_policy_id_DDS_RESOURCELIMITS_QOS_POLICY_ID: dds_qos_policy_id = 14;
#[doc = "< EntityFactory policy"]
pub const dds_qos_policy_id_DDS_ENTITYFACTORY_QOS_POLICY_ID: dds_qos_policy_id = 15;
#[doc = "< WriterDataLifecycle policy dds_qset_writer_data_lifecycle()"]
pub const dds_qos_policy_id_DDS_WRITERDATALIFECYCLE_QOS_POLICY_ID: dds_qos_policy_id = 16;
#[doc = "< ReaderDataLifecycle policy dds_qset_reader_data_lifecycle()"]
pub const dds_qos_policy_id_DDS_READERDATALIFECYCLE_QOS_POLICY_ID: dds_qos_policy_id = 17;
#[doc = "< Topicdata policy dds_qset_topicdata()"]
pub const dds_qos_policy_id_DDS_TOPICDATA_QOS_POLICY_ID: dds_qos_policy_id = 18;
#[doc = "< Groupdata policy dds_qset_groupdata()"]
pub const dds_qos_policy_id_DDS_GROUPDATA_QOS_POLICY_ID: dds_qos_policy_id = 19;
#[doc = "< TransportPriority policy dds_qset_transport_priority()"]
pub const dds_qos_policy_id_DDS_TRANSPORTPRIORITY_QOS_POLICY_ID: dds_qos_policy_id = 20;
#[doc = "< Livespan policy dds_qset_lifespan()"]
pub const dds_qos_policy_id_DDS_LIFESPAN_QOS_POLICY_ID: dds_qos_policy_id = 21;
#[doc = "< DurabilityService policy dds_qset_durability_service()"]
pub const dds_qos_policy_id_DDS_DURABILITYSERVICE_QOS_POLICY_ID: dds_qos_policy_id = 22;
#[doc = "< Property policy dds_qset_property()"]
pub const dds_qos_policy_id_DDS_PROPERTY_QOS_POLICY_ID: dds_qos_policy_id = 23;
#[doc = "< TypeConsistencyEnforcement policy dds_qset_type_consistency_enforcements()"]
pub const dds_qos_policy_id_DDS_TYPE_CONSISTENCY_ENFORCEMENT_QOS_POLICY_ID: dds_qos_policy_id = 24;
#[doc = "< DataRepresentation policy dds_qset_data_representation()"]
pub const dds_qos_policy_id_DDS_DATA_REPRESENTATION_QOS_POLICY_ID: dds_qos_policy_id = 25;
#[doc = " @brief Qos Policy IDs\n @ingroup internal\n Used internally to mark the QoS policy type"]
pub type dds_qos_policy_id = ::std::ffi::c_uint;
#[doc = " @brief Qos Policy IDs\n @ingroup internal\n Used internally to mark the QoS policy type"]
pub use self::dds_qos_policy_id as dds_qos_policy_id_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dds_qos {
    _unused: [u8; 0],
}
#[doc = " @brief QoS datatype\n @ingroup qos\n QoS structure is opaque"]
pub type dds_qos_t = dds_qos;
#[doc = "< Volatile durability"]
pub const dds_durability_kind_DDS_DURABILITY_VOLATILE: dds_durability_kind = 0;
#[doc = "< Transient Local durability"]
pub const dds_durability_kind_DDS_DURABILITY_TRANSIENT_LOCAL: dds_durability_kind = 1;
#[doc = "< Transient durability"]
pub const dds_durability_kind_DDS_DURABILITY_TRANSIENT: dds_durability_kind = 2;
#[doc = "< Persistent durability"]
pub const dds_durability_kind_DDS_DURABILITY_PERSISTENT: dds_durability_kind = 3;
#[doc = " @brief Durability QoS: Applies to Topic, DataReader, DataWriter\n @ingroup qos"]
pub type dds_durability_kind = ::std::ffi::c_uint;
#[doc = " @brief Durability QoS: Applies to Topic, DataReader, DataWriter\n @ingroup qos"]
pub use self::dds_durability_kind as dds_durability_kind_t;
#[doc = "< Keep Last history"]
pub const dds_history_kind_DDS_HISTORY_KEEP_LAST: dds_history_kind = 0;
#[doc = "< Keep All history"]
pub const dds_history_kind_DDS_HISTORY_KEEP_ALL: dds_history_kind = 1;
#[doc = " @brief History QoS: Applies to Topic, DataReader, DataWriter\n @ingroup qos"]
pub type dds_history_kind = ::std::ffi::c_uint;
#[doc = " @brief History QoS: Applies to Topic, DataReader, DataWriter\n @ingroup qos"]
pub use self::dds_history_kind as dds_history_kind_t;
#[doc = "< Shared Ownership"]
pub const dds_ownership_kind_DDS_OWNERSHIP_SHARED: dds_ownership_kind = 0;
#[doc = "< Exclusive Ownership"]
pub const dds_ownership_kind_DDS_OWNERSHIP_EXCLUSIVE: dds_ownership_kind = 1;
#[doc = " @brief Ownership QoS: Applies to Topic, DataReader, DataWriter\n @ingroup qos"]
pub type dds_ownership_kind = ::std::ffi::c_uint;
#[doc = " @brief Ownership QoS: Applies to Topic, DataReader, DataWriter\n @ingroup qos"]
pub use self::dds_ownership_kind as dds_ownership_kind_t;
#[doc = "< Automatic liveliness"]
pub const dds_liveliness_kind_DDS_LIVELINESS_AUTOMATIC: dds_liveliness_kind = 0;
#[doc = "< Manual by Participant liveliness"]
pub const dds_liveliness_kind_DDS_LIVELINESS_MANUAL_BY_PARTICIPANT: dds_liveliness_kind = 1;
#[doc = "< Manual by Topic liveliness"]
pub const dds_liveliness_kind_DDS_LIVELINESS_MANUAL_BY_TOPIC: dds_liveliness_kind = 2;
#[doc = " @brief Liveliness QoS: Applies to Topic, DataReader, DataWriter\n @ingroup qos"]
pub type dds_liveliness_kind = ::std::ffi::c_uint;
#[doc = " @brief Liveliness QoS: Applies to Topic, DataReader, DataWriter\n @ingroup qos"]
pub use self::dds_liveliness_kind as dds_liveliness_kind_t;
#[doc = "< Best Effort reliability"]
pub const dds_reliability_kind_DDS_RELIABILITY_BEST_EFFORT: dds_reliability_kind = 0;
#[doc = "< Reliable reliability"]
pub const dds_reliability_kind_DDS_RELIABILITY_RELIABLE: dds_reliability_kind = 1;
#[doc = " @brief Reliability QoS: Applies to Topic, DataReader, DataWriter\n @ingroup qos"]
pub type dds_reliability_kind = ::std::ffi::c_uint;
#[doc = " @brief Reliability QoS: Applies to Topic, DataReader, DataWriter\n @ingroup qos"]
pub use self::dds_reliability_kind as dds_reliability_kind_t;
#[doc = "< order by reception timestamp"]
pub const dds_destination_order_kind_DDS_DESTINATIONORDER_BY_RECEPTION_TIMESTAMP:
    dds_destination_order_kind = 0;
#[doc = "< order by source timestamp"]
pub const dds_destination_order_kind_DDS_DESTINATIONORDER_BY_SOURCE_TIMESTAMP:
    dds_destination_order_kind = 1;
#[doc = " @brief DestinationOrder QoS: Applies to Topic, DataReader, DataWriter\n @ingroup qos"]
pub type dds_destination_order_kind = ::std::ffi::c_uint;
#[doc = " @brief DestinationOrder QoS: Applies to Topic, DataReader, DataWriter\n @ingroup qos"]
pub use self::dds_destination_order_kind as dds_destination_order_kind_t;
#[doc = "< presentation scope per instance"]
pub const dds_presentation_access_scope_kind_DDS_PRESENTATION_INSTANCE:
    dds_presentation_access_scope_kind = 0;
#[doc = "< presentation scope per topic"]
pub const dds_presentation_access_scope_kind_DDS_PRESENTATION_TOPIC:
    dds_presentation_access_scope_kind = 1;
#[doc = "< presentation scope per group"]
pub const dds_presentation_access_scope_kind_DDS_PRESENTATION_GROUP:
    dds_presentation_access_scope_kind = 2;
#[doc = " @brief Presentation QoS: Applies to Publisher, Subscriber\n @ingroup qos"]
pub type dds_presentation_access_scope_kind = ::std::ffi::c_uint;
#[doc = " @brief Presentation QoS: Applies to Publisher, Subscriber\n @ingroup qos"]
pub use self::dds_presentation_access_scope_kind as dds_presentation_access_scope_kind_t;
#[doc = "< Don't ignore local data"]
pub const dds_ignorelocal_kind_DDS_IGNORELOCAL_NONE: dds_ignorelocal_kind = 0;
#[doc = "< Ignore local data from same participant"]
pub const dds_ignorelocal_kind_DDS_IGNORELOCAL_PARTICIPANT: dds_ignorelocal_kind = 1;
#[doc = "< Ignore local data from same process"]
pub const dds_ignorelocal_kind_DDS_IGNORELOCAL_PROCESS: dds_ignorelocal_kind = 2;
#[doc = " @brief Ignore-local QoS: Applies to DataReader, DataWriter\n @ingroup qos"]
pub type dds_ignorelocal_kind = ::std::ffi::c_uint;
#[doc = " @brief Ignore-local QoS: Applies to DataReader, DataWriter\n @ingroup qos"]
pub use self::dds_ignorelocal_kind as dds_ignorelocal_kind_t;
#[doc = "< Do not allow type coercion"]
pub const dds_type_consistency_kind_DDS_TYPE_CONSISTENCY_DISALLOW_TYPE_COERCION:
    dds_type_consistency_kind = 0;
#[doc = "< Allow type coercion"]
pub const dds_type_consistency_kind_DDS_TYPE_CONSISTENCY_ALLOW_TYPE_COERCION:
    dds_type_consistency_kind = 1;
#[doc = " @brief Type-consistency QoS: Applies to DataReader, DataWriter\n @ingroup qos"]
pub type dds_type_consistency_kind = ::std::ffi::c_uint;
#[doc = " @brief Type-consistency QoS: Applies to DataReader, DataWriter\n @ingroup qos"]
pub use self::dds_type_consistency_kind as dds_type_consistency_kind_t;
#[doc = " @brief Data Representation QoS: Applies to Topic, DataReader, DataWriter\n @ingroup qos"]
pub type dds_data_representation_id_t = i16;
unsafe extern "C" {
    #[doc = " @ingroup qos\n @component qos_obj\n @brief Allocate memory and initialize default QoS-policies\n\n @returns - Pointer to the initialized dds_qos_t structure, NULL if unsuccessful."]
    pub fn dds_create_qos() -> *mut dds_qos_t;
}
unsafe extern "C" {
    #[doc = " @ingroup qos\n @component qos_obj\n @brief Delete memory allocated to QoS-policies structure\n\n @param[in] qos - Pointer to dds_qos_t structure"]
    pub fn dds_delete_qos(qos: *mut dds_qos_t);
}
unsafe extern "C" {
    #[doc = " @ingroup qos\n @component qos_obj\n @brief Reset a QoS-policies structure to default values\n\n @param[in,out] qos - Pointer to the dds_qos_t structure"]
    pub fn dds_reset_qos(qos: *mut dds_qos_t);
}
unsafe extern "C" {
    #[doc = " @ingroup qos\n @component qos_obj\n @brief Copy all QoS-policies from one structure to another\n\n @param[in,out] dst - Pointer to the destination dds_qos_t structure\n @param[in] src - Pointer to the source dds_qos_t structure\n\n @returns - Return-code indicating success or failure"]
    pub fn dds_copy_qos(dst: *mut dds_qos_t, src: *const dds_qos_t) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup qos\n @component qos_obj\n @brief Copy all QoS-policies from one structure to another, unless already set\n\n Policies are copied from src to dst, unless src already has the policy set to a non-default value.\n\n @param[in,out] dst - Pointer to the destination qos structure\n @param[in] src - Pointer to the source qos structure"]
    pub fn dds_merge_qos(dst: *mut dds_qos_t, src: *const dds_qos_t);
}
unsafe extern "C" {
    #[doc = " @ingroup qos\n @component qos_obj\n @brief Check if two qos structures contain the same set of QoS-policies.\n\n @param[in] a - Pointer to a qos structure\n @param[in] b - Pointer to a qos structure\n\n @returns whether the two qos structures contain the same set of QoS-policies"]
    pub fn dds_qos_equal(a: *const dds_qos_t, b: *const dds_qos_t) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the userdata of a qos structure.\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the userdata\n @param[in] value - Pointer to the userdata\n @param[in] sz - Size of userdata stored in value"]
    pub fn dds_qset_userdata(qos: *mut dds_qos_t, value: *const ::std::ffi::c_void, sz: usize);
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the topicdata of a qos structure.\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the topicdata\n @param[in] value - Pointer to the topicdata\n @param[in] sz - Size of the topicdata stored in value"]
    pub fn dds_qset_topicdata(qos: *mut dds_qos_t, value: *const ::std::ffi::c_void, sz: usize);
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the groupdata of a qos structure.\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the groupdata\n @param[in] value - Pointer to the group data\n @param[in] sz - Size of groupdata stored in value"]
    pub fn dds_qset_groupdata(qos: *mut dds_qos_t, value: *const ::std::ffi::c_void, sz: usize);
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the durability policy of a qos structure.\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the policy\n @param[in] kind - Durability kind value"]
    pub fn dds_qset_durability(qos: *mut dds_qos_t, kind: dds_durability_kind_t);
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the history policy of a qos structure.\n\n Note that depth is only relevant for keep last. If you want limited history for keep all, use dds_qset_resource_limits().\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the policy\n @param[in] kind - History kind value\n @param[in] depth - History depth value"]
    pub fn dds_qset_history(qos: *mut dds_qos_t, kind: dds_history_kind_t, depth: i32);
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the resource limits policy of a qos structure.\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the policy\n @param[in] max_samples - Number of samples resource-limit value\n @param[in] max_instances - Number of instances resource-limit value\n @param[in] max_samples_per_instance - Number of samples per instance resource-limit value"]
    pub fn dds_qset_resource_limits(
        qos: *mut dds_qos_t,
        max_samples: i32,
        max_instances: i32,
        max_samples_per_instance: i32,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the presentation policy of a qos structure.\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the policy\n @param[in] access_scope - Access-scope kind\n @param[in] coherent_access - Coherent access enable value\n @param[in] ordered_access - Ordered access enable value"]
    pub fn dds_qset_presentation(
        qos: *mut dds_qos_t,
        access_scope: dds_presentation_access_scope_kind_t,
        coherent_access: bool,
        ordered_access: bool,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the lifespan policy of a qos structure.\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the policy\n @param[in] lifespan - Lifespan duration (expiration time relative to source timestamp of a sample)"]
    pub fn dds_qset_lifespan(qos: *mut dds_qos_t, lifespan: dds_duration_t);
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the deadline policy of a qos structure.\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the policy\n @param[in] deadline - Deadline duration"]
    pub fn dds_qset_deadline(qos: *mut dds_qos_t, deadline: dds_duration_t);
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the latency-budget policy of a qos structure\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the policy\n @param[in] duration - Latency budget duration"]
    pub fn dds_qset_latency_budget(qos: *mut dds_qos_t, duration: dds_duration_t);
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the ownership policy of a qos structure\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the policy\n @param[in] kind - Ownership kind"]
    pub fn dds_qset_ownership(qos: *mut dds_qos_t, kind: dds_ownership_kind_t);
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the ownership strength policy of a qos structure\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the policy\n @param[in] value - Ownership strength value"]
    pub fn dds_qset_ownership_strength(qos: *mut dds_qos_t, value: i32);
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the liveliness policy of a qos structure\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the policy\n @param[in] kind - Liveliness kind\n @param[in] lease_duration - Lease duration"]
    pub fn dds_qset_liveliness(
        qos: *mut dds_qos_t,
        kind: dds_liveliness_kind_t,
        lease_duration: dds_duration_t,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the time-based filter policy of a qos structure\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the policy\n @param[in] minimum_separation - Minimum duration between sample delivery for an instance"]
    pub fn dds_qset_time_based_filter(qos: *mut dds_qos_t, minimum_separation: dds_duration_t);
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the partition policy of a qos structure\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the policy\n @param[in] n - Number of partitions stored in ps\n @param[in] ps - Pointer to string(s) storing partition name(s)"]
    pub fn dds_qset_partition(qos: *mut dds_qos_t, n: u32, ps: *mut *const ::std::ffi::c_char);
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Convenience function to set the partition policy of a qos structure to a\n single name.  Name may be a null pointer.\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the policy\n @param[in] name - Pointer to the name"]
    pub fn dds_qset_partition1(qos: *mut dds_qos_t, name: *const ::std::ffi::c_char);
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the reliability policy of a qos structure\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the policy\n @param[in] kind - Reliability kind\n @param[in] max_blocking_time - Max blocking duration applied when kind is reliable. This is how long the writer will block when its history is full."]
    pub fn dds_qset_reliability(
        qos: *mut dds_qos_t,
        kind: dds_reliability_kind_t,
        max_blocking_time: dds_duration_t,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the transport-priority policy of a qos structure\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the policy\n @param[in] value - Priority value"]
    pub fn dds_qset_transport_priority(qos: *mut dds_qos_t, value: i32);
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the destination-order policy of a qos structure\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the policy\n @param[in] kind - Destination-order kind"]
    pub fn dds_qset_destination_order(qos: *mut dds_qos_t, kind: dds_destination_order_kind_t);
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the writer data-lifecycle policy of a qos structure\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the policy\n @param[in] autodispose - Automatic disposal of unregistered instances"]
    pub fn dds_qset_writer_data_lifecycle(qos: *mut dds_qos_t, autodispose: bool);
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the reader data-lifecycle policy of a qos structure\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the policy\n @param[in] autopurge_nowriter_samples_delay - Delay for purging of samples from instances in a no-writers state\n @param[in] autopurge_disposed_samples_delay - Delay for purging of samples from disposed instances"]
    pub fn dds_qset_reader_data_lifecycle(
        qos: *mut dds_qos_t,
        autopurge_nowriter_samples_delay: dds_duration_t,
        autopurge_disposed_samples_delay: dds_duration_t,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the writer batching policy of a qos structure\n\n When batching is disabled, each write/dispose/unregister operation results in its own\n RTPS message that is sent out onto the transport.  For small data types, this means\n most messages (and hence network packets) are small.  As a consequence the fixed cost\n of processing a message (or packet) increases load.\n\n Enabling write batching causes the samples to be aggregated into a single larger RTPS\n message.  This improves efficiency by spreading the fixed cost out over more samples.\n Naturally this increases latency a bit.\n\n The batching mechanism may or may not send out packets on a write/&c. operation.  It\n buffers only a limited amount and will send out what has been buffered when a new\n write/&c. can not be added.  To guarantee that the buffered data is sent, one must call\n \"dds_flush\".\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the policy\n @param[in] batch_updates - Whether writes should be batched"]
    pub fn dds_qset_writer_batching(qos: *mut dds_qos_t, batch_updates: bool);
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the durability-service policy of a qos structure\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the policy\n @param[in] service_cleanup_delay - Delay for purging of abandoned instances from the durability service\n @param[in] history_kind - History policy kind applied by the durability service\n @param[in] history_depth - History policy depth applied by the durability service\n @param[in] max_samples - Number of samples resource-limit policy applied by the durability service\n @param[in] max_instances - Number of instances resource-limit policy applied by the durability service\n @param[in] max_samples_per_instance - Number of samples per instance resource-limit policy applied by the durability service"]
    pub fn dds_qset_durability_service(
        qos: *mut dds_qos_t,
        service_cleanup_delay: dds_duration_t,
        history_kind: dds_history_kind_t,
        history_depth: i32,
        max_samples: i32,
        max_instances: i32,
        max_samples_per_instance: i32,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the ignore-local policy of a qos structure\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the policy\n @param[in] ignore - True if readers and writers owned by the same participant should be ignored"]
    pub fn dds_qset_ignorelocal(qos: *mut dds_qos_t, ignore: dds_ignorelocal_kind_t);
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Stores a property with the provided name and string value in a qos structure.\n\n In the case a property with the provided name already exists in the qos structure,\n the value for this entry is overwritten with the provided string value. If more than\n one property with the provided name exists, only the value of the first of these\n properties is updated.\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the property\n @param[in] name - Pointer to name of the property\n @param[in] value - Pointer to a (null-terminated) string that will be stored"]
    pub fn dds_qset_prop(
        qos: *mut dds_qos_t,
        name: *const ::std::ffi::c_char,
        value: *const ::std::ffi::c_char,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Stores a property with the provided name and string value and propagate in a qos structure.\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the property\n @param[in] name - Pointer to name of the property\n @param[in] value - Pointer to a (null-terminated) string that will be stored\n @param[in] propagate - Whether to propagate the property over discovery or not"]
    pub fn dds_qset_prop_propagate(
        qos: *mut dds_qos_t,
        name: *const ::std::ffi::c_char,
        value: *const ::std::ffi::c_char,
        propagate: bool,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Removes the property with the provided name from a qos structure.\n\n In case more than one property exists with this name, only the first property\n is removed.\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that contains the property\n @param[in] name - Pointer to name of the property"]
    pub fn dds_qunset_prop(qos: *mut dds_qos_t, name: *const ::std::ffi::c_char);
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Stores the provided binary data as a property in a qos structure\n\n In the case a property with the provided name already exists in the qos structure,\n the value for this entry is overwritten with the provided data. If more than one\n property with the provided name exists, only the value of the first of these\n properties is updated.\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the property\n @param[in] name - Pointer to name of the property\n @param[in] value - Pointer to data to be stored in the property\n @param[in] sz - Size of the data"]
    pub fn dds_qset_bprop(
        qos: *mut dds_qos_t,
        name: *const ::std::ffi::c_char,
        value: *const ::std::ffi::c_void,
        sz: usize,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Stores the provided binary data and propagate as a property in a qos structure\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the property\n @param[in] name - Pointer to name of the property\n @param[in] value - Pointer to data to be stored in the property\n @param[in] sz - Size of the data\n @param[in] propagate - Whether to propagate the property over discovery or not"]
    pub fn dds_qset_bprop_propagate(
        qos: *mut dds_qos_t,
        name: *const ::std::ffi::c_char,
        value: *const ::std::ffi::c_void,
        sz: usize,
        propagate: bool,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Removes the binary property with the provided name from a qos structure.\n\n In case more than one binary property exists with this name, only the first binary\n property is removed.\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that contains the binary property\n @param[in] name - Pointer to name of the property"]
    pub fn dds_qunset_bprop(qos: *mut dds_qos_t, name: *const ::std::ffi::c_char);
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the type consistency enforcement policy of a qos structure\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the policy\n @param[in] kind - Type consistency policy kind\n @param[in] ignore_sequence_bounds - Ignore sequence bounds in type assignability checking\n @param[in] ignore_string_bounds - Ignore string bounds in type assignability checking\n @param[in] ignore_member_names - Ignore member names in type assignability checking\n @param[in] prevent_type_widening - Prevent type widening in type assignability checking\n @param[in] force_type_validation - Force type validation in assignability checking"]
    pub fn dds_qset_type_consistency(
        qos: *mut dds_qos_t,
        kind: dds_type_consistency_kind_t,
        ignore_sequence_bounds: bool,
        ignore_string_bounds: bool,
        ignore_member_names: bool,
        prevent_type_widening: bool,
        force_type_validation: bool,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the data representation of a qos structure\n\n @param[in,out] qos    - Pointer to a dds_qos_t structure that will store the policy\n @param[in]     n      - Number of data representation values\n @param[in]     values - Data representation values"]
    pub fn dds_qset_data_representation(
        qos: *mut dds_qos_t,
        n: u32,
        values: *const dds_data_representation_id_t,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the entity name.\n\n When using this QoS to initialize a participant, publisher, subscriber, reader or writer\n it will take the name set here. This name is visible over discovery and can be used\n to make sense of network in tooling.\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that will store the entity name.\n @param[in] name - Pointer to the entity name to set."]
    pub fn dds_qset_entity_name(qos: *mut dds_qos_t, name: *const ::std::ffi::c_char);
}
unsafe extern "C" {
    #[doc = " @ingroup qos_setters\n @component qos_obj\n @brief Set the enabled PSMX Instances in a qos structure\n\n @param[in,out] qos    - Pointer to a dds_qos_t structure that will store the policy\n @param[in]     n      - Number of PSMX Instances Names in `values`\n @param[in]     values - Array of PSMX Instance Names"]
    pub fn dds_qset_psmx_instances(
        qos: *mut dds_qos_t,
        n: u32,
        values: *mut *const ::std::ffi::c_char,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the userdata from a qos structure\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] value - Pointer that will store the userdata.  If sz = 0, then a null pointer, else it is a pointer to an allocated buffer of sz+1 bytes where the last byte is always 0\n @param[in,out] sz - Pointer that will store the size of userdata\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_userdata(
        qos: *const dds_qos_t,
        value: *mut *mut ::std::ffi::c_void,
        sz: *mut usize,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the topicdata from a qos structure\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] value - Pointer that will store the topicdata.  If sz = 0, then a null pointer, else it is a pointer to an allocated buffer of sz+1 bytes where the last byte is always 0\n @param[in,out] sz - Pointer that will store the size of topicdata\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_topicdata(
        qos: *const dds_qos_t,
        value: *mut *mut ::std::ffi::c_void,
        sz: *mut usize,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the groupdata from a qos structure\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] value - Pointer that will store the groupdata.  If sz = 0, then a null pointer, else it is a pointer to an allocated buffer of sz+1 bytes where the last byte is always 0\n @param[in,out] sz - Pointer that will store the size of groupdata\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_groupdata(
        qos: *const dds_qos_t,
        value: *mut *mut ::std::ffi::c_void,
        sz: *mut usize,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the durability policy from a qos structure\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] kind - Pointer that will store the durability kind\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_durability(qos: *const dds_qos_t, kind: *mut dds_durability_kind_t) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the history policy from a qos structure\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] kind - Pointer that will store the history kind (optional)\n @param[in,out] depth - Pointer that will store the history depth (optional)\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_history(
        qos: *const dds_qos_t,
        kind: *mut dds_history_kind_t,
        depth: *mut i32,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the resource-limits policy from a qos structure\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] max_samples - Pointer that will store the number of samples resource-limit (optional)\n @param[in,out] max_instances - Pointer that will store the number of instances resource-limit (optional)\n @param[in,out] max_samples_per_instance - Pointer that will store the number of samples per instance resource-limit (optional)\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_resource_limits(
        qos: *const dds_qos_t,
        max_samples: *mut i32,
        max_instances: *mut i32,
        max_samples_per_instance: *mut i32,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the presentation policy from a qos structure\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] access_scope - Pointer that will store access scope kind (optional)\n @param[in,out] coherent_access - Pointer that will store coherent access enable value (optional)\n @param[in,out] ordered_access - Pointer that will store orderede access enable value (optional)\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_presentation(
        qos: *const dds_qos_t,
        access_scope: *mut dds_presentation_access_scope_kind_t,
        coherent_access: *mut bool,
        ordered_access: *mut bool,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the lifespan policy from a qos structure\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] lifespan - Pointer that will store lifespan duration\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_lifespan(qos: *const dds_qos_t, lifespan: *mut dds_duration_t) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the deadline policy from a qos structure\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] deadline - Pointer that will store deadline duration\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_deadline(qos: *const dds_qos_t, deadline: *mut dds_duration_t) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the latency-budget policy from a qos structure\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] duration - Pointer that will store latency-budget duration\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_latency_budget(qos: *const dds_qos_t, duration: *mut dds_duration_t) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the ownership policy from a qos structure\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] kind - Pointer that will store the ownership kind\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_ownership(qos: *const dds_qos_t, kind: *mut dds_ownership_kind_t) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the ownership strength qos policy\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] value - Pointer that will store the ownership strength value\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_ownership_strength(qos: *const dds_qos_t, value: *mut i32) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the liveliness qos policy\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] kind - Pointer that will store the liveliness kind (optional)\n @param[in,out] lease_duration - Pointer that will store the liveliness lease duration (optional)\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_liveliness(
        qos: *const dds_qos_t,
        kind: *mut dds_liveliness_kind_t,
        lease_duration: *mut dds_duration_t,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the time-based filter qos policy\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] minimum_separation - Pointer that will store the minimum separation duration (optional)\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_time_based_filter(
        qos: *const dds_qos_t,
        minimum_separation: *mut dds_duration_t,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the partition qos policy\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] n - Pointer that will store the number of partitions (optional)\n @param[in,out] ps - Pointer that will store the string(s) containing partition name(s) (optional)\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_partition(
        qos: *const dds_qos_t,
        n: *mut u32,
        ps: *mut *mut *mut ::std::ffi::c_char,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the reliability qos policy\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] kind - Pointer that will store the reliability kind (optional)\n @param[in,out] max_blocking_time - Pointer that will store the max blocking time for reliable reliability (optional)\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_reliability(
        qos: *const dds_qos_t,
        kind: *mut dds_reliability_kind_t,
        max_blocking_time: *mut dds_duration_t,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the transport priority qos policy\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] value - Pointer that will store the transport priority value\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_transport_priority(qos: *const dds_qos_t, value: *mut i32) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the destination-order qos policy\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] kind - Pointer that will store the destination-order kind\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_destination_order(
        qos: *const dds_qos_t,
        kind: *mut dds_destination_order_kind_t,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the writer data-lifecycle qos policy\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] autodispose - Pointer that will store the autodispose unregistered instances enable value\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_writer_data_lifecycle(qos: *const dds_qos_t, autodispose: *mut bool) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the reader data-lifecycle qos policy\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] autopurge_nowriter_samples_delay - Pointer that will store the delay for auto-purging samples from instances in a no-writer state (optional)\n @param[in,out] autopurge_disposed_samples_delay - Pointer that will store the delay for auto-purging of disposed instances (optional)\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_reader_data_lifecycle(
        qos: *const dds_qos_t,
        autopurge_nowriter_samples_delay: *mut dds_duration_t,
        autopurge_disposed_samples_delay: *mut dds_duration_t,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the writer batching qos policy\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] batch_updates - Pointer that will store the batching enable value\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_writer_batching(qos: *const dds_qos_t, batch_updates: *mut bool) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the durability-service qos policy values.\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out]  service_cleanup_delay - Pointer that will store the delay for purging of abandoned instances from the durability service (optional)\n @param[in,out] history_kind - Pointer that will store history policy kind applied by the durability service (optional)\n @param[in,out] history_depth - Pointer that will store history policy depth applied by the durability service (optional)\n @param[in,out] max_samples - Pointer that will store number of samples resource-limit policy applied by the durability service (optional)\n @param[in,out] max_instances - Pointer that will store number of instances resource-limit policy applied by the durability service (optional)\n @param[in,out] max_samples_per_instance - Pointer that will store number of samples per instance resource-limit policy applied by the durability service (optional)\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_durability_service(
        qos: *const dds_qos_t,
        service_cleanup_delay: *mut dds_duration_t,
        history_kind: *mut dds_history_kind_t,
        history_depth: *mut i32,
        max_samples: *mut i32,
        max_instances: *mut i32,
        max_samples_per_instance: *mut i32,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the ignore-local qos policy\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] ignore - Pointer that will store whether to ignore readers/writers owned by the same participant (optional)\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_ignorelocal(qos: *const dds_qos_t, ignore: *mut dds_ignorelocal_kind_t)
        -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Gets the names of the properties from a qos structure.\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that contains properties\n @param[in,out] n - Pointer to number of property names that are returned (optional)\n @param[in,out] names - Pointer that will store the string(s) containing property name(s) (optional). This function will allocate the memory for the list of names and for the strings containing the names; the caller gets ownership of the allocated memory\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_propnames(
        qos: *const dds_qos_t,
        n: *mut u32,
        names: *mut *mut *mut ::std::ffi::c_char,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the value of the property with the provided name from a qos structure.\n\n In case more than one property exists with this name, the value for the first\n property with this name will be returned.\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that contains the property\n @param[in] name - Pointer to name of the property\n @param[in,out] value - Pointer to a string that will store the value of the property. The memory for storing the string value will be allocated by this function and the caller gets ownership of the allocated memory\n\n @returns - false iff any of the arguments is invalid, the qos is not present in the qos object or there was no property found with the provided name"]
    pub fn dds_qget_prop(
        qos: *const dds_qos_t,
        name: *const ::std::ffi::c_char,
        value: *mut *mut ::std::ffi::c_char,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the value of the property with the provided name and propagate from a qos structure.\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that contains the property\n @param[in] name - Pointer to name of the property\n @param[in,out] value - Pointer to a string that will store the value of the property. The memory for storing the string value will be allocated by this function and the caller gets ownership of the allocated memory\n @param[in,out] propagate - Pointer that will store if property gets propagated or not\n\n @returns - false if any of the arguments is invalid, the qos is not present in the qos object or there was no property found with the provided name"]
    pub fn dds_qget_prop_propagate(
        qos: *const dds_qos_t,
        name: *const ::std::ffi::c_char,
        value: *mut *mut ::std::ffi::c_char,
        propagate: *mut bool,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Gets the names of the binary properties from a qos structure.\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that contains binary properties\n @param[in,out] n - Pointer to number of binary property names that are returned (optional)\n @param[in,out] names - Pointer that will store the string(s) containing binary property name(s) (optional). This function will allocate the memory for the list of names and for the strings containing the names; the caller gets ownership of the allocated memory\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_bpropnames(
        qos: *const dds_qos_t,
        n: *mut u32,
        names: *mut *mut *mut ::std::ffi::c_char,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the value of the binary property with the provided name from a qos structure.\n\n In case more than one binary property exists with this name, the value for the first\n binary property with this name will be returned.\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that contains the property\n @param[in] name - Pointer to name of the binary property\n @param[in,out] value - Pointer to a buffer that will store the value of the property. If sz = 0 then a NULL pointer. The memory for storing the value will be allocated by this function and the caller gets ownership of the allocated memory\n @param[in,out] sz - Pointer that will store the size of the returned buffer.\n\n @returns - false iff any of the arguments is invalid, the qos is not present in the qos object or there was no binary property found with the provided name"]
    pub fn dds_qget_bprop(
        qos: *const dds_qos_t,
        name: *const ::std::ffi::c_char,
        value: *mut *mut ::std::ffi::c_void,
        sz: *mut usize,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the value of the binary property with the provided name and propagate from a qos structure.\n\n @param[in,out] qos - Pointer to a dds_qos_t structure that contains the property\n @param[in] name - Pointer to name of the binary property\n @param[in,out] value - Pointer to a buffer that will store the value of the property. If sz = 0 then a NULL pointer. The memory for storing the value will be allocated by this function and the caller gets ownership of the allocated memory\n @param[in,out] sz - Pointer that will store the size of the returned buffer.\n @param[in,out] propagate - Pointer that will store if property gets propagated or not\n\n @returns - false iff any of the arguments is invalid, the qos is not present in the qos object or there was no binary property found with the provided name"]
    pub fn dds_qget_bprop_propagate(
        qos: *const dds_qos_t,
        name: *const ::std::ffi::c_char,
        value: *mut *mut ::std::ffi::c_void,
        sz: *mut usize,
        propagate: *mut bool,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the type consistency enforcement qos policy values.\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] kind - Pointer that will store the type consistency enforcement kind (optional)\n @param[in,out] ignore_sequence_bounds - Pointer that will store the boolean value for ignoring sequence bounds in type assignability checking (optional)\n @param[in,out] ignore_string_bounds - Pointer that will store the boolean value for ignoring string bounds in type assignability checking (optional)\n @param[in,out] ignore_member_names - Pointer that will store the boolean value for ignoring member names in type assignability checking (optional)\n @param[in,out] prevent_type_widening - Pointer that will store the boolean value to prevent type widening in type assignability checking (optional)\n @param[in,out] force_type_validation - Pointer that will store the boolean value to force type validation in assignability checking (optional)\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_type_consistency(
        qos: *const dds_qos_t,
        kind: *mut dds_type_consistency_kind_t,
        ignore_sequence_bounds: *mut bool,
        ignore_string_bounds: *mut bool,
        ignore_member_names: *mut bool,
        prevent_type_widening: *mut bool,
        force_type_validation: *mut bool,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the data representation qos policy value.\n\n Returns the data representation values that are set in the provided QoS object\n and stores the number of values in out parameter 'n'. In case the 'values' parameter\n is provided, this function will allocate a buffer that contains the data representation\n values, and set 'values' to point to this buffer. It is the responsibility of the caller\n to free the memory of this buffer.\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the policy\n @param[in,out] n - Pointer that will store the number of data representation values\n @param[in,out] values - Pointer that will store the data representation values (optional)\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object"]
    pub fn dds_qget_data_representation(
        qos: *const dds_qos_t,
        n: *mut u32,
        values: *mut *mut dds_data_representation_id_t,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Get the entity name from a qos structure\n\n @param[in] qos - Pointer to a dds_qos_t structure storing the entity name\n @param[in,out] name - Pointer to a string that will store the returned entity name\n\n @returns - false iff any of the arguments is invalid or the qos is not present in the qos object\n            or if a buffer to store the name could not be allocated."]
    pub fn dds_qget_entity_name(qos: *const dds_qos_t, name: *mut *mut ::std::ffi::c_char) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup qos_getters\n @component qos_obj\n @brief Gets the names of the PSMX Instances set in a qos structure\n\n @param qos     Pointer to a dds_qos_t structure\n @param n_out   Number of PSMX Instance Names returned\n @param values  Array of pointers to PSMX instance Names\n @return bool indicating success or failure"]
    pub fn dds_qget_psmx_instances(
        qos: *const dds_qos_t,
        n_out: *mut u32,
        values: *mut *mut *mut ::std::ffi::c_char,
    ) -> bool;
}
pub type dds_fail_fn = ::std::option::Option<
    unsafe extern "C" fn(arg1: *const ::std::ffi::c_char, arg2: *const ::std::ffi::c_char),
>;
unsafe extern "C" {
    pub fn dds_fail_set(fn_: dds_fail_fn);
}
unsafe extern "C" {
    pub fn dds_fail_get() -> dds_fail_fn;
}
unsafe extern "C" {
    pub fn dds_err_str(err: dds_return_t) -> *const ::std::ffi::c_char;
}
unsafe extern "C" {
    pub fn dds_fail(msg: *const ::std::ffi::c_char, where_: *const ::std::ffi::c_char);
}
unsafe extern "C" {
    pub fn dds_err_check(
        err: dds_return_t,
        flags: ::std::ffi::c_uint,
        where_: *const ::std::ffi::c_char,
    ) -> bool;
}
#[doc = " @ingroup dcps_status\n @brief DCPS_Status_OfferedDeadlineMissed\n DOC_TODO"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct dds_offered_deadline_missed_status {
    #[doc = "< DOC_TODO"]
    pub total_count: u32,
    #[doc = "< DOC_TODO"]
    pub total_count_change: i32,
    #[doc = "< DOC_TODO"]
    pub last_instance_handle: dds_instance_handle_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_offered_deadline_missed_status"]
        [::std::mem::size_of::<dds_offered_deadline_missed_status>() - 16usize];
    ["Alignment of dds_offered_deadline_missed_status"]
        [::std::mem::align_of::<dds_offered_deadline_missed_status>() - 8usize];
    ["Offset of field: dds_offered_deadline_missed_status::total_count"]
        [::std::mem::offset_of!(dds_offered_deadline_missed_status, total_count) - 0usize];
    ["Offset of field: dds_offered_deadline_missed_status::total_count_change"]
        [::std::mem::offset_of!(dds_offered_deadline_missed_status, total_count_change) - 4usize];
    ["Offset of field: dds_offered_deadline_missed_status::last_instance_handle"]
        [::std::mem::offset_of!(dds_offered_deadline_missed_status, last_instance_handle) - 8usize];
};
#[doc = " @ingroup dcps_status\n @brief DCPS_Status_OfferedDeadlineMissed\n DOC_TODO"]
pub type dds_offered_deadline_missed_status_t = dds_offered_deadline_missed_status;
#[doc = " @ingroup dcps_status\n @brief DCPS_Status_OfferedIncompatibleQoS\n DOC_TODO"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct dds_offered_incompatible_qos_status {
    #[doc = "< DOC_TODO"]
    pub total_count: u32,
    #[doc = "< DOC_TODO"]
    pub total_count_change: i32,
    #[doc = "< DOC_TODO"]
    pub last_policy_id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_offered_incompatible_qos_status"]
        [::std::mem::size_of::<dds_offered_incompatible_qos_status>() - 12usize];
    ["Alignment of dds_offered_incompatible_qos_status"]
        [::std::mem::align_of::<dds_offered_incompatible_qos_status>() - 4usize];
    ["Offset of field: dds_offered_incompatible_qos_status::total_count"]
        [::std::mem::offset_of!(dds_offered_incompatible_qos_status, total_count) - 0usize];
    ["Offset of field: dds_offered_incompatible_qos_status::total_count_change"]
        [::std::mem::offset_of!(dds_offered_incompatible_qos_status, total_count_change) - 4usize];
    ["Offset of field: dds_offered_incompatible_qos_status::last_policy_id"]
        [::std::mem::offset_of!(dds_offered_incompatible_qos_status, last_policy_id) - 8usize];
};
#[doc = " @ingroup dcps_status\n @brief DCPS_Status_OfferedIncompatibleQoS\n DOC_TODO"]
pub type dds_offered_incompatible_qos_status_t = dds_offered_incompatible_qos_status;
#[doc = " @ingroup dcps_status\n @brief DCPS_Status_PublicationMatched\n DOC_TODO"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct dds_publication_matched_status {
    #[doc = "< DOC_TODO"]
    pub total_count: u32,
    #[doc = "< DOC_TODO"]
    pub total_count_change: i32,
    #[doc = "< DOC_TODO"]
    pub current_count: u32,
    #[doc = "< DOC_TODO"]
    pub current_count_change: i32,
    #[doc = "< DOC_TODO"]
    pub last_subscription_handle: dds_instance_handle_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_publication_matched_status"]
        [::std::mem::size_of::<dds_publication_matched_status>() - 24usize];
    ["Alignment of dds_publication_matched_status"]
        [::std::mem::align_of::<dds_publication_matched_status>() - 8usize];
    ["Offset of field: dds_publication_matched_status::total_count"]
        [::std::mem::offset_of!(dds_publication_matched_status, total_count) - 0usize];
    ["Offset of field: dds_publication_matched_status::total_count_change"]
        [::std::mem::offset_of!(dds_publication_matched_status, total_count_change) - 4usize];
    ["Offset of field: dds_publication_matched_status::current_count"]
        [::std::mem::offset_of!(dds_publication_matched_status, current_count) - 8usize];
    ["Offset of field: dds_publication_matched_status::current_count_change"]
        [::std::mem::offset_of!(dds_publication_matched_status, current_count_change) - 12usize];
    ["Offset of field: dds_publication_matched_status::last_subscription_handle"][::std::mem::offset_of!(
        dds_publication_matched_status,
        last_subscription_handle
    ) - 16usize];
};
#[doc = " @ingroup dcps_status\n @brief DCPS_Status_PublicationMatched\n DOC_TODO"]
pub type dds_publication_matched_status_t = dds_publication_matched_status;
#[doc = " @ingroup dcps_status\n @brief DCPS_Status_LivelinessLost\n DOC_TODO"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct dds_liveliness_lost_status {
    #[doc = "< DOC_TODO"]
    pub total_count: u32,
    #[doc = "< DOC_TODO"]
    pub total_count_change: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_liveliness_lost_status"]
        [::std::mem::size_of::<dds_liveliness_lost_status>() - 8usize];
    ["Alignment of dds_liveliness_lost_status"]
        [::std::mem::align_of::<dds_liveliness_lost_status>() - 4usize];
    ["Offset of field: dds_liveliness_lost_status::total_count"]
        [::std::mem::offset_of!(dds_liveliness_lost_status, total_count) - 0usize];
    ["Offset of field: dds_liveliness_lost_status::total_count_change"]
        [::std::mem::offset_of!(dds_liveliness_lost_status, total_count_change) - 4usize];
};
#[doc = " @ingroup dcps_status\n @brief DCPS_Status_LivelinessLost\n DOC_TODO"]
pub type dds_liveliness_lost_status_t = dds_liveliness_lost_status;
#[doc = " @ingroup dcps_status\n @brief DCPS_Status_SubscriptionMatched\n DOC_TODO"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct dds_subscription_matched_status {
    #[doc = "< DOC_TODO"]
    pub total_count: u32,
    #[doc = "< DOC_TODO"]
    pub total_count_change: i32,
    #[doc = "< DOC_TODO"]
    pub current_count: u32,
    #[doc = "< DOC_TODO"]
    pub current_count_change: i32,
    #[doc = "< DOC_TODO"]
    pub last_publication_handle: dds_instance_handle_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_subscription_matched_status"]
        [::std::mem::size_of::<dds_subscription_matched_status>() - 24usize];
    ["Alignment of dds_subscription_matched_status"]
        [::std::mem::align_of::<dds_subscription_matched_status>() - 8usize];
    ["Offset of field: dds_subscription_matched_status::total_count"]
        [::std::mem::offset_of!(dds_subscription_matched_status, total_count) - 0usize];
    ["Offset of field: dds_subscription_matched_status::total_count_change"]
        [::std::mem::offset_of!(dds_subscription_matched_status, total_count_change) - 4usize];
    ["Offset of field: dds_subscription_matched_status::current_count"]
        [::std::mem::offset_of!(dds_subscription_matched_status, current_count) - 8usize];
    ["Offset of field: dds_subscription_matched_status::current_count_change"]
        [::std::mem::offset_of!(dds_subscription_matched_status, current_count_change) - 12usize];
    ["Offset of field: dds_subscription_matched_status::last_publication_handle"][::std::mem::offset_of!(
        dds_subscription_matched_status,
        last_publication_handle
    ) - 16usize];
};
#[doc = " @ingroup dcps_status\n @brief DCPS_Status_SubscriptionMatched\n DOC_TODO"]
pub type dds_subscription_matched_status_t = dds_subscription_matched_status;
#[doc = "< DOC_TODO"]
pub const dds_sample_rejected_status_kind_DDS_NOT_REJECTED: dds_sample_rejected_status_kind = 0;
#[doc = "< DOC_TODO"]
pub const dds_sample_rejected_status_kind_DDS_REJECTED_BY_INSTANCES_LIMIT:
    dds_sample_rejected_status_kind = 1;
#[doc = "< DOC_TODO"]
pub const dds_sample_rejected_status_kind_DDS_REJECTED_BY_SAMPLES_LIMIT:
    dds_sample_rejected_status_kind = 2;
#[doc = "< DOC_TODO"]
pub const dds_sample_rejected_status_kind_DDS_REJECTED_BY_SAMPLES_PER_INSTANCE_LIMIT:
    dds_sample_rejected_status_kind = 3;
#[doc = " @ingroup dcps_status\n @brief Rejected Status\n DOC_TODO"]
pub type dds_sample_rejected_status_kind = ::std::ffi::c_uint;
#[doc = " @ingroup dcps_status\n @brief DCPS_Status_SampleRejected\n DOC_TODO"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dds_sample_rejected_status {
    #[doc = "< DOC_TODO"]
    pub total_count: u32,
    #[doc = "< DOC_TODO"]
    pub total_count_change: i32,
    #[doc = "< DOC_TODO"]
    pub last_reason: dds_sample_rejected_status_kind,
    #[doc = "< DOC_TODO"]
    pub last_instance_handle: dds_instance_handle_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_sample_rejected_status"]
        [::std::mem::size_of::<dds_sample_rejected_status>() - 24usize];
    ["Alignment of dds_sample_rejected_status"]
        [::std::mem::align_of::<dds_sample_rejected_status>() - 8usize];
    ["Offset of field: dds_sample_rejected_status::total_count"]
        [::std::mem::offset_of!(dds_sample_rejected_status, total_count) - 0usize];
    ["Offset of field: dds_sample_rejected_status::total_count_change"]
        [::std::mem::offset_of!(dds_sample_rejected_status, total_count_change) - 4usize];
    ["Offset of field: dds_sample_rejected_status::last_reason"]
        [::std::mem::offset_of!(dds_sample_rejected_status, last_reason) - 8usize];
    ["Offset of field: dds_sample_rejected_status::last_instance_handle"]
        [::std::mem::offset_of!(dds_sample_rejected_status, last_instance_handle) - 16usize];
};
impl Default for dds_sample_rejected_status {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @ingroup dcps_status\n @brief DCPS_Status_SampleRejected\n DOC_TODO"]
pub type dds_sample_rejected_status_t = dds_sample_rejected_status;
#[doc = " @ingroup dcps_status\n @brief DCPS_Status_LivelinessChanged\n DOC_TODO"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct dds_liveliness_changed_status {
    #[doc = "< DOC_TODO"]
    pub alive_count: u32,
    #[doc = "< DOC_TODO"]
    pub not_alive_count: u32,
    #[doc = "< DOC_TODO"]
    pub alive_count_change: i32,
    #[doc = "< DOC_TODO"]
    pub not_alive_count_change: i32,
    #[doc = "< DOC_TODO"]
    pub last_publication_handle: dds_instance_handle_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_liveliness_changed_status"]
        [::std::mem::size_of::<dds_liveliness_changed_status>() - 24usize];
    ["Alignment of dds_liveliness_changed_status"]
        [::std::mem::align_of::<dds_liveliness_changed_status>() - 8usize];
    ["Offset of field: dds_liveliness_changed_status::alive_count"]
        [::std::mem::offset_of!(dds_liveliness_changed_status, alive_count) - 0usize];
    ["Offset of field: dds_liveliness_changed_status::not_alive_count"]
        [::std::mem::offset_of!(dds_liveliness_changed_status, not_alive_count) - 4usize];
    ["Offset of field: dds_liveliness_changed_status::alive_count_change"]
        [::std::mem::offset_of!(dds_liveliness_changed_status, alive_count_change) - 8usize];
    ["Offset of field: dds_liveliness_changed_status::not_alive_count_change"]
        [::std::mem::offset_of!(dds_liveliness_changed_status, not_alive_count_change) - 12usize];
    ["Offset of field: dds_liveliness_changed_status::last_publication_handle"]
        [::std::mem::offset_of!(dds_liveliness_changed_status, last_publication_handle) - 16usize];
};
#[doc = " @ingroup dcps_status\n @brief DCPS_Status_LivelinessChanged\n DOC_TODO"]
pub type dds_liveliness_changed_status_t = dds_liveliness_changed_status;
#[doc = " @ingroup dcps_status\n @brief DCPS_Status_RequestedDeadlineMissed\n DOC_TODO"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct dds_requested_deadline_missed_status {
    #[doc = "< DOC_TODO"]
    pub total_count: u32,
    #[doc = "< DOC_TODO"]
    pub total_count_change: i32,
    #[doc = "< DOC_TODO"]
    pub last_instance_handle: dds_instance_handle_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_requested_deadline_missed_status"]
        [::std::mem::size_of::<dds_requested_deadline_missed_status>() - 16usize];
    ["Alignment of dds_requested_deadline_missed_status"]
        [::std::mem::align_of::<dds_requested_deadline_missed_status>() - 8usize];
    ["Offset of field: dds_requested_deadline_missed_status::total_count"]
        [::std::mem::offset_of!(dds_requested_deadline_missed_status, total_count) - 0usize];
    ["Offset of field: dds_requested_deadline_missed_status::total_count_change"]
        [::std::mem::offset_of!(dds_requested_deadline_missed_status, total_count_change) - 4usize];
    ["Offset of field: dds_requested_deadline_missed_status::last_instance_handle"][::std::mem::offset_of!(
        dds_requested_deadline_missed_status,
        last_instance_handle
    ) - 8usize];
};
#[doc = " @ingroup dcps_status\n @brief DCPS_Status_RequestedDeadlineMissed\n DOC_TODO"]
pub type dds_requested_deadline_missed_status_t = dds_requested_deadline_missed_status;
#[doc = " @ingroup dcps_status\n @brief DCPS_Status_RequestedIncompatibleQoS\n DOC_TODO"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct dds_requested_incompatible_qos_status {
    #[doc = "< DOC_TODO"]
    pub total_count: u32,
    #[doc = "< DOC_TODO"]
    pub total_count_change: i32,
    #[doc = "< DOC_TODO"]
    pub last_policy_id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_requested_incompatible_qos_status"]
        [::std::mem::size_of::<dds_requested_incompatible_qos_status>() - 12usize];
    ["Alignment of dds_requested_incompatible_qos_status"]
        [::std::mem::align_of::<dds_requested_incompatible_qos_status>() - 4usize];
    ["Offset of field: dds_requested_incompatible_qos_status::total_count"]
        [::std::mem::offset_of!(dds_requested_incompatible_qos_status, total_count) - 0usize];
    ["Offset of field: dds_requested_incompatible_qos_status::total_count_change"][::std::mem::offset_of!(
        dds_requested_incompatible_qos_status,
        total_count_change
    ) - 4usize];
    ["Offset of field: dds_requested_incompatible_qos_status::last_policy_id"]
        [::std::mem::offset_of!(dds_requested_incompatible_qos_status, last_policy_id) - 8usize];
};
#[doc = " @ingroup dcps_status\n @brief DCPS_Status_RequestedIncompatibleQoS\n DOC_TODO"]
pub type dds_requested_incompatible_qos_status_t = dds_requested_incompatible_qos_status;
#[doc = " @ingroup dcps_status\n @brief DCPS_Status_SampleLost\n DOC_TODO"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct dds_sample_lost_status {
    #[doc = "< DOC_TODO"]
    pub total_count: u32,
    #[doc = "< DOC_TODO"]
    pub total_count_change: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_sample_lost_status"][::std::mem::size_of::<dds_sample_lost_status>() - 8usize];
    ["Alignment of dds_sample_lost_status"]
        [::std::mem::align_of::<dds_sample_lost_status>() - 4usize];
    ["Offset of field: dds_sample_lost_status::total_count"]
        [::std::mem::offset_of!(dds_sample_lost_status, total_count) - 0usize];
    ["Offset of field: dds_sample_lost_status::total_count_change"]
        [::std::mem::offset_of!(dds_sample_lost_status, total_count_change) - 4usize];
};
#[doc = " @ingroup dcps_status\n @brief DCPS_Status_SampleLost\n DOC_TODO"]
pub type dds_sample_lost_status_t = dds_sample_lost_status;
#[doc = " @ingroup dcps_status\n @brief DCPS_Status_InconsistentTopic\n DOC_TODO"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct dds_inconsistent_topic_status {
    #[doc = "< DOC_TODO"]
    pub total_count: u32,
    #[doc = "< DOC_TODO"]
    pub total_count_change: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_inconsistent_topic_status"]
        [::std::mem::size_of::<dds_inconsistent_topic_status>() - 8usize];
    ["Alignment of dds_inconsistent_topic_status"]
        [::std::mem::align_of::<dds_inconsistent_topic_status>() - 4usize];
    ["Offset of field: dds_inconsistent_topic_status::total_count"]
        [::std::mem::offset_of!(dds_inconsistent_topic_status, total_count) - 0usize];
    ["Offset of field: dds_inconsistent_topic_status::total_count_change"]
        [::std::mem::offset_of!(dds_inconsistent_topic_status, total_count_change) - 4usize];
};
#[doc = " @ingroup dcps_status\n @brief DCPS_Status_InconsistentTopic\n DOC_TODO"]
pub type dds_inconsistent_topic_status_t = dds_inconsistent_topic_status;
unsafe extern "C" {
    #[doc = " @ingroup dcps_status_getters\n @component entity_status\n @brief Get INCONSISTENT_TOPIC status\n\n This operation gets the status value corresponding to INCONSISTENT_TOPIC\n and reset the status. The value can be obtained, only if the status is enabled for an entity.\n NULL value for status is allowed and it will reset the trigger value when status is enabled.\n\n @param[in]  topic  The topic entity to get the status\n @param[out] status The pointer to @ref dds_inconsistent_topic_status_t to get the status\n\n @returns  0 - Success\n @returns <0 - Failure\n\n @retval DDS_RETCODE_ERROR\n                  An internal error has occurred.\n @retval DDS_RETCODE_BAD_PARAMETER\n                  One of the given arguments is not valid.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n                  The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n                  The entity has already been deleted."]
    pub fn dds_get_inconsistent_topic_status(
        topic: dds_entity_t,
        status: *mut dds_inconsistent_topic_status_t,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup dcps_status_getters\n @component entity_status\n @brief Get PUBLICATION_MATCHED status\n\n This operation gets the status value corresponding to PUBLICATION_MATCHED\n and reset the status. The value can be obtained, only if the status is enabled for an entity.\n NULL value for status is allowed and it will reset the trigger value when status is enabled.\n\n @param[in]  writer  The writer entity to get the status\n @param[out] status  The pointer to @ref dds_publication_matched_status_t to get the status\n\n @returns  0 - Success\n @returns <0 - Failure\n\n @retval DDS_RETCODE_ERROR\n                  An internal error has occurred.\n @retval DDS_RETCODE_BAD_PARAMETER\n                  One of the given arguments is not valid.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n                  The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n                  The entity has already been deleted."]
    pub fn dds_get_publication_matched_status(
        writer: dds_entity_t,
        status: *mut dds_publication_matched_status_t,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup dcps_status_getters\n @component entity_status\n @brief Get LIVELINESS_LOST status\n\n This operation gets the status value corresponding to LIVELINESS_LOST\n and reset the status. The value can be obtained, only if the status is enabled for an entity.\n NULL value for status is allowed and it will reset the trigger value when status is enabled.\n\n @param[in]  writer  The writer entity to get the status\n @param[out] status  The pointer to @ref dds_liveliness_lost_status_t to get the status\n\n @returns  0 - Success\n @returns <0 - Failure\n\n @retval DDS_RETCODE_ERROR\n                  An internal error has occurred.\n @retval DDS_RETCODE_BAD_PARAMETER\n                  One of the given arguments is not valid.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n                  The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n                  The entity has already been deleted."]
    pub fn dds_get_liveliness_lost_status(
        writer: dds_entity_t,
        status: *mut dds_liveliness_lost_status_t,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup dcps_status_getters\n @component entity_status\n @brief Get OFFERED_DEADLINE_MISSED status\n\n This operation gets the status value corresponding to OFFERED_DEADLINE_MISSED\n and reset the status. The value can be obtained, only if the status is enabled for an entity.\n NULL value for status is allowed and it will reset the trigger value when status is enabled.\n\n @param[in]  writer  The writer entity to get the status\n @param[out] status  The pointer to @ref dds_offered_deadline_missed_status_t to get the status\n\n @returns  0 - Success\n @returns <0 - Failure\n\n @retval DDS_RETCODE_ERROR\n                  An internal error has occurred.\n @retval DDS_RETCODE_BAD_PARAMETER\n                  One of the given arguments is not valid.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n                  The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n                  The entity has already been deleted."]
    pub fn dds_get_offered_deadline_missed_status(
        writer: dds_entity_t,
        status: *mut dds_offered_deadline_missed_status_t,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup dcps_status_getters\n @component entity_status\n @brief Get OFFERED_INCOMPATIBLE_QOS status\n\n This operation gets the status value corresponding to OFFERED_INCOMPATIBLE_QOS\n and reset the status. The value can be obtained, only if the status is enabled for an entity.\n NULL value for status is allowed and it will reset the trigger value when status is enabled.\n\n @param[in]  writer  The writer entity to get the status\n @param[out] status  The pointer to @ref dds_offered_incompatible_qos_status_t to get the status\n\n @returns  0 - Success\n @returns <0 - Failure\n\n @retval DDS_RETCODE_ERROR\n                  An internal error has occurred.\n @retval DDS_RETCODE_BAD_PARAMETER\n                  One of the given arguments is not valid.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n                  The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n                  The entity has already been deleted."]
    pub fn dds_get_offered_incompatible_qos_status(
        writer: dds_entity_t,
        status: *mut dds_offered_incompatible_qos_status_t,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup dcps_status_getters\n @component entity_status\n @brief Get SUBSCRIPTION_MATCHED status\n\n This operation gets the status value corresponding to SUBSCRIPTION_MATCHED\n and reset the status. The value can be obtained, only if the status is enabled for an entity.\n NULL value for status is allowed and it will reset the trigger value when status is enabled.\n\n @param[in]  reader  The reader entity to get the status\n @param[out] status  The pointer to @ref dds_subscription_matched_status_t to get the status\n\n @returns  0 - Success\n @returns <0 - Failure\n\n @retval DDS_RETCODE_ERROR\n                  An internal error has occurred.\n @retval DDS_RETCODE_BAD_PARAMETER\n                  One of the given arguments is not valid.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n                  The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n                  The entity has already been deleted."]
    pub fn dds_get_subscription_matched_status(
        reader: dds_entity_t,
        status: *mut dds_subscription_matched_status_t,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup dcps_status_getters\n @component entity_status\n @brief Get LIVELINESS_CHANGED status\n\n This operation gets the status value corresponding to LIVELINESS_CHANGED\n and reset the status. The value can be obtained, only if the status is enabled for an entity.\n NULL value for status is allowed and it will reset the trigger value when status is enabled.\n\n @param[in]  reader  The reader entity to get the status\n @param[out] status  The pointer to @ref dds_liveliness_changed_status_t to get the status\n\n @returns  0 - Success\n @returns <0 - Failure\n\n @retval DDS_RETCODE_ERROR\n                  An internal error has occurred.\n @retval DDS_RETCODE_BAD_PARAMETER\n                  One of the given arguments is not valid.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n                  The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n                  The entity has already been deleted."]
    pub fn dds_get_liveliness_changed_status(
        reader: dds_entity_t,
        status: *mut dds_liveliness_changed_status_t,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup dcps_status_getters\n @component entity_status\n @brief Get SAMPLE_REJECTED status\n\n This operation gets the status value corresponding to SAMPLE_REJECTED\n and reset the status. The value can be obtained, only if the status is enabled for an entity.\n NULL value for status is allowed and it will reset the trigger value when status is enabled.\n\n @param[in]  reader  The reader entity to get the status\n @param[out] status  The pointer to @ref dds_sample_rejected_status_t to get the status\n\n @returns  0 - Success\n @returns <0 - Failure\n\n @retval DDS_RETCODE_ERROR\n                  An internal error has occurred.\n @retval DDS_RETCODE_BAD_PARAMETER\n                  One of the given arguments is not valid.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n                  The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n                  The entity has already been deleted."]
    pub fn dds_get_sample_rejected_status(
        reader: dds_entity_t,
        status: *mut dds_sample_rejected_status_t,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup dcps_status_getters\n @component entity_status\n @brief Get SAMPLE_LOST status\n\n This operation gets the status value corresponding to SAMPLE_LOST\n and reset the status. The value can be obtained, only if the status is enabled for an entity.\n NULL value for status is allowed and it will reset the trigger value when status is enabled.\n\n @param[in]  reader  The reader entity to get the status\n @param[out] status  The pointer to @ref dds_sample_lost_status_t to get the status\n\n @returns A dds_return_t indicating success or failure\n\n @retval DDS_RETCODE_OK\n            Success\n @retval DDS_RETCODE_ERROR\n            An internal error has occurred.\n @retval DDS_RETCODE_BAD_PARAMETER\n            One of the given arguments is not valid.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n            The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n            The entity has already been deleted."]
    pub fn dds_get_sample_lost_status(
        reader: dds_entity_t,
        status: *mut dds_sample_lost_status_t,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup dcps_status_getters\n @component entity_status\n @brief Get REQUESTED_DEADLINE_MISSED status\n\n This operation gets the status value corresponding to REQUESTED_DEADLINE_MISSED\n and reset the status. The value can be obtained, only if the status is enabled for an entity.\n NULL value for status is allowed and it will reset the trigger value when status is enabled.\n\n @param[in]  reader  The reader entity to get the status\n @param[out] status  The pointer to @ref dds_requested_deadline_missed_status_t to get the status\n\n @returns A dds_return_t indicating success or failure\n\n @retval DDS_RETCODE_OK\n            Success\n @retval DDS_RETCODE_ERROR\n            An internal error has occurred.\n @retval DDS_RETCODE_BAD_PARAMETER\n            One of the given arguments is not valid.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n            The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n            The entity has already been deleted."]
    pub fn dds_get_requested_deadline_missed_status(
        reader: dds_entity_t,
        status: *mut dds_requested_deadline_missed_status_t,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup dcps_status_getters\n @component entity_status\n @brief Get REQUESTED_INCOMPATIBLE_QOS status\n\n This operation gets the status value corresponding to REQUESTED_INCOMPATIBLE_QOS\n and reset the status. The value can be obtained, only if the status is enabled for an entity.\n NULL value for status is allowed and it will reset the trigger value when status is enabled.\n\n @param[in]  reader  The reader entity to get the status\n @param[out] status  The pointer to @ref dds_requested_incompatible_qos_status_t to get the status\n\n @returns A dds_return_t indicating success or failure\n\n @retval DDS_RETCODE_OK\n            Success\n @retval DDS_RETCODE_ERROR\n            An internal error has occurred.\n @retval DDS_RETCODE_BAD_PARAMETER\n            One of the given arguments is not valid.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n            The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n            The entity has already been deleted."]
    pub fn dds_get_requested_incompatible_qos_status(
        reader: dds_entity_t,
        status: *mut dds_requested_incompatible_qos_status_t,
    ) -> dds_return_t;
}
pub type dds_on_inconsistent_topic_fn = ::std::option::Option<
    unsafe extern "C" fn(
        topic: dds_entity_t,
        status: dds_inconsistent_topic_status_t,
        arg: *mut ::std::ffi::c_void,
    ),
>;
pub type dds_on_liveliness_lost_fn = ::std::option::Option<
    unsafe extern "C" fn(
        writer: dds_entity_t,
        status: dds_liveliness_lost_status_t,
        arg: *mut ::std::ffi::c_void,
    ),
>;
pub type dds_on_offered_deadline_missed_fn = ::std::option::Option<
    unsafe extern "C" fn(
        writer: dds_entity_t,
        status: dds_offered_deadline_missed_status_t,
        arg: *mut ::std::ffi::c_void,
    ),
>;
pub type dds_on_offered_incompatible_qos_fn = ::std::option::Option<
    unsafe extern "C" fn(
        writer: dds_entity_t,
        status: dds_offered_incompatible_qos_status_t,
        arg: *mut ::std::ffi::c_void,
    ),
>;
pub type dds_on_data_on_readers_fn = ::std::option::Option<
    unsafe extern "C" fn(subscriber: dds_entity_t, arg: *mut ::std::ffi::c_void),
>;
pub type dds_on_sample_lost_fn = ::std::option::Option<
    unsafe extern "C" fn(
        reader: dds_entity_t,
        status: dds_sample_lost_status_t,
        arg: *mut ::std::ffi::c_void,
    ),
>;
pub type dds_on_data_available_fn =
    ::std::option::Option<unsafe extern "C" fn(reader: dds_entity_t, arg: *mut ::std::ffi::c_void)>;
pub type dds_on_sample_rejected_fn = ::std::option::Option<
    unsafe extern "C" fn(
        reader: dds_entity_t,
        status: dds_sample_rejected_status_t,
        arg: *mut ::std::ffi::c_void,
    ),
>;
pub type dds_on_liveliness_changed_fn = ::std::option::Option<
    unsafe extern "C" fn(
        reader: dds_entity_t,
        status: dds_liveliness_changed_status_t,
        arg: *mut ::std::ffi::c_void,
    ),
>;
pub type dds_on_requested_deadline_missed_fn = ::std::option::Option<
    unsafe extern "C" fn(
        reader: dds_entity_t,
        status: dds_requested_deadline_missed_status_t,
        arg: *mut ::std::ffi::c_void,
    ),
>;
pub type dds_on_requested_incompatible_qos_fn = ::std::option::Option<
    unsafe extern "C" fn(
        reader: dds_entity_t,
        status: dds_requested_incompatible_qos_status_t,
        arg: *mut ::std::ffi::c_void,
    ),
>;
pub type dds_on_publication_matched_fn = ::std::option::Option<
    unsafe extern "C" fn(
        writer: dds_entity_t,
        status: dds_publication_matched_status_t,
        arg: *mut ::std::ffi::c_void,
    ),
>;
pub type dds_on_subscription_matched_fn = ::std::option::Option<
    unsafe extern "C" fn(
        reader: dds_entity_t,
        status: dds_subscription_matched_status_t,
        arg: *mut ::std::ffi::c_void,
    ),
>;
#[doc = " @brief DDS Listener struct (opaque)\n @ingroup listener"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dds_listener {
    _unused: [u8; 0],
}
#[doc = " @brief DDS Listener type (opaque)\n @ingroup listener"]
pub type dds_listener_t = dds_listener;
unsafe extern "C" {
    #[doc = " @ingroup listener\n @component listener_obj\n @brief Allocate memory and initializes to default values (@ref DDS_LUNSET) of a listener\n\n @param[in] arg optional pointer that will be passed on to the listener callbacks\n\n @returns Returns a pointer to the allocated memory for dds_listener_t structure."]
    pub fn dds_create_listener(arg: *mut ::std::ffi::c_void) -> *mut dds_listener_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener\n @component listener_obj\n @brief Delete the memory allocated to listener structure\n\n @param[in] listener pointer to the listener struct to delete"]
    pub fn dds_delete_listener(listener: *mut dds_listener_t);
}
unsafe extern "C" {
    #[doc = " @ingroup listener\n @component listener_obj\n @brief Reset the listener structure contents to @ref DDS_LUNSET\n\n @param[in,out] listener pointer to the listener struct to reset"]
    pub fn dds_reset_listener(listener: *mut dds_listener_t);
}
unsafe extern "C" {
    #[doc = " @ingroup listener\n @component listener_obj\n @brief Copy the listener callbacks from source to destination\n\n @param[in,out] dst The pointer to the destination listener structure, where the content is to copied\n @param[in] src The pointer to the source listener structure to be copied"]
    pub fn dds_copy_listener(dst: *mut dds_listener_t, src: *const dds_listener_t);
}
unsafe extern "C" {
    #[doc = " @ingroup listener\n @component listener_obj\n @brief Copy the listener callbacks from source to destination, unless already set\n\n Any listener callbacks already set in @p dst (including NULL) are skipped, only\n those set to DDS_LUNSET are copied from @p src.\n\n @param[in,out] dst The pointer to the destination listener structure, where the content is merged\n @param[in] src The pointer to the source listener structure to be copied"]
    pub fn dds_merge_listener(dst: *mut dds_listener_t, src: *const dds_listener_t);
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the data_available callback and argument in the listener structure.\n\n @remark: See also the remark on @ref DDS_DATA_AVAILABLE_STATUS)\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer\n @param[in] arg callback argument that is passed uninterpreted to the callback function\n @param[in] reset_on_invoke whether or not the status should be cleared when the listener callback is invoked\n\n @retval DDS_RETCODE_OK success\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lset_data_available_arg(
        listener: *mut dds_listener_t,
        callback: dds_on_data_available_fn,
        arg: *mut ::std::ffi::c_void,
        reset_on_invoke: bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the data_on_readers callback and argument in the listener structure.\n\n @remark: See also the remark on @ref DDS_DATA_AVAILABLE_STATUS)\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer\n @param[in] arg callback argument that is passed uninterpreted to the callback function\n @param[in] reset_on_invoke whether or not the status should be cleared when the listener callback is invoked\n\n @retval DDS_RETCODE_OK success\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lset_data_on_readers_arg(
        listener: *mut dds_listener_t,
        callback: dds_on_data_on_readers_fn,
        arg: *mut ::std::ffi::c_void,
        reset_on_invoke: bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the inconsistent_topic callback and argument in the listener structure.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer\n @param[in] arg callback argument that is passed uninterpreted to the callback function\n @param[in] reset_on_invoke whether or not the status should be cleared when the listener callback is invoked\n\n @retval DDS_RETCODE_OK success\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lset_inconsistent_topic_arg(
        listener: *mut dds_listener_t,
        callback: dds_on_inconsistent_topic_fn,
        arg: *mut ::std::ffi::c_void,
        reset_on_invoke: bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the liveliness_changed callback and argument in the listener structure.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer\n @param[in] arg callback argument that is passed uninterpreted to the callback function\n @param[in] reset_on_invoke whether or not the status should be cleared when the listener callback is invoked\n\n @retval DDS_RETCODE_OK success\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lset_liveliness_changed_arg(
        listener: *mut dds_listener_t,
        callback: dds_on_liveliness_changed_fn,
        arg: *mut ::std::ffi::c_void,
        reset_on_invoke: bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the liveliness_lost callback and argument in the listener structure.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer\n @param[in] arg callback argument that is passed uninterpreted to the callback function\n @param[in] reset_on_invoke whether or not the status should be cleared when the listener callback is invoked\n\n @retval DDS_RETCODE_OK success\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lset_liveliness_lost_arg(
        listener: *mut dds_listener_t,
        callback: dds_on_liveliness_lost_fn,
        arg: *mut ::std::ffi::c_void,
        reset_on_invoke: bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the offered_deadline_missed callback and argument in the listener structure.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer\n @param[in] arg callback argument that is passed uninterpreted to the callback function\n @param[in] reset_on_invoke whether or not the status should be cleared when the listener callback is invoked\n\n @retval DDS_RETCODE_OK success\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lset_offered_deadline_missed_arg(
        listener: *mut dds_listener_t,
        callback: dds_on_offered_deadline_missed_fn,
        arg: *mut ::std::ffi::c_void,
        reset_on_invoke: bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the offered_incompatible_qos callback and argument in the listener structure.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer\n @param[in] arg callback argument that is passed uninterpreted to the callback function\n @param[in] reset_on_invoke whether or not the status should be cleared when the listener callback is invoked\n\n @retval DDS_RETCODE_OK success\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lset_offered_incompatible_qos_arg(
        listener: *mut dds_listener_t,
        callback: dds_on_offered_incompatible_qos_fn,
        arg: *mut ::std::ffi::c_void,
        reset_on_invoke: bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the publication_matched callback and argument in the listener structure.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer\n @param[in] arg callback argument that is passed uninterpreted to the callback function\n @param[in] reset_on_invoke whether or not the status should be cleared when the listener callback is invoked\n\n @retval DDS_RETCODE_OK success\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lset_publication_matched_arg(
        listener: *mut dds_listener_t,
        callback: dds_on_publication_matched_fn,
        arg: *mut ::std::ffi::c_void,
        reset_on_invoke: bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the requested_deadline_missed callback and argument in the listener structure.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer\n @param[in] arg callback argument that is passed uninterpreted to the callback function\n @param[in] reset_on_invoke whether or not the status should be cleared when the listener callback is invoked\n\n @retval DDS_RETCODE_OK success\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lset_requested_deadline_missed_arg(
        listener: *mut dds_listener_t,
        callback: dds_on_requested_deadline_missed_fn,
        arg: *mut ::std::ffi::c_void,
        reset_on_invoke: bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the requested_incompatible_qos callback and argument in the listener structure.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer\n @param[in] arg callback argument that is passed uninterpreted to the callback function\n @param[in] reset_on_invoke whether or not the status should be cleared when the listener callback is invoked\n\n @retval DDS_RETCODE_OK success\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lset_requested_incompatible_qos_arg(
        listener: *mut dds_listener_t,
        callback: dds_on_requested_incompatible_qos_fn,
        arg: *mut ::std::ffi::c_void,
        reset_on_invoke: bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the sample_lost callback and argument in the listener structure.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer\n @param[in] arg callback argument that is passed uninterpreted to the callback function\n @param[in] reset_on_invoke whether or not the status should be cleared when the listener callback is invoked\n\n @retval DDS_RETCODE_OK success\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lset_sample_lost_arg(
        listener: *mut dds_listener_t,
        callback: dds_on_sample_lost_fn,
        arg: *mut ::std::ffi::c_void,
        reset_on_invoke: bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the sample_rejected callback and argument in the listener structure.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer\n @param[in] arg callback argument that is passed uninterpreted to the callback function\n @param[in] reset_on_invoke whether or not the status should be cleared when the listener callback is invoked\n\n @retval DDS_RETCODE_OK success\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lset_sample_rejected_arg(
        listener: *mut dds_listener_t,
        callback: dds_on_sample_rejected_fn,
        arg: *mut ::std::ffi::c_void,
        reset_on_invoke: bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the subscription_matched callback and argument in the listener structure.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer\n @param[in] arg callback argument that is passed uninterpreted to the callback function\n @param[in] reset_on_invoke whether or not the status should be cleared when the listener callback is invoked\n\n @retval DDS_RETCODE_OK success\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lset_subscription_matched_arg(
        listener: *mut dds_listener_t,
        callback: dds_on_subscription_matched_fn,
        arg: *mut ::std::ffi::c_void,
        reset_on_invoke: bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the inconsistent_topic callback in the listener structure.\n\n Equivalent to calling @ref dds_lset_inconsistent_topic_arg with arg set to the argument passed in\n dds_create_listener() and reset_on_invoke to true, and throwing away the result.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer"]
    pub fn dds_lset_inconsistent_topic(
        listener: *mut dds_listener_t,
        callback: dds_on_inconsistent_topic_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the liveliness_lost callback in the listener structure.\n\n Equivalent to calling @ref dds_lset_liveliness_lost_arg with arg set to the argument passed in\n dds_create_listener() and reset_on_invoke to true, and throwing away the result.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer"]
    pub fn dds_lset_liveliness_lost(
        listener: *mut dds_listener_t,
        callback: dds_on_liveliness_lost_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the offered_deadline_missed callback in the listener structure.\n\n Equivalent to calling @ref dds_lset_offered_deadline_missed_arg with arg set to the argument passed in\n dds_create_listener() and reset_on_invoke to true, and throwing away the result.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer"]
    pub fn dds_lset_offered_deadline_missed(
        listener: *mut dds_listener_t,
        callback: dds_on_offered_deadline_missed_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the offered_incompatible_qos callback in the listener structure.\n\n Equivalent to calling @ref dds_lset_offered_incompatible_qos_arg with arg set to the argument passed in\n dds_create_listener() and reset_on_invoke to true, and throwing away the result.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer"]
    pub fn dds_lset_offered_incompatible_qos(
        listener: *mut dds_listener_t,
        callback: dds_on_offered_incompatible_qos_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the data_on_readers callback in the listener structure.\n\n Equivalent to calling @ref dds_lset_data_on_readers_arg with arg set to the argument passed in\n dds_create_listener() and reset_on_invoke to true, and throwing away the result.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer"]
    pub fn dds_lset_data_on_readers(
        listener: *mut dds_listener_t,
        callback: dds_on_data_on_readers_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the sample_lost callback in the listener structure.\n\n Equivalent to calling @ref dds_lset_sample_lost_arg with arg set to the argument passed in\n dds_create_listener() and reset_on_invoke to true, and throwing away the result.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer"]
    pub fn dds_lset_sample_lost(listener: *mut dds_listener_t, callback: dds_on_sample_lost_fn);
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the data_available callback in the listener structure.\n\n @remark: See also the remark on @ref DDS_DATA_AVAILABLE_STATUS)\n\n Equivalent to calling @ref dds_lset_data_available_arg with arg set to the argument passed in\n dds_create_listener() and reset_on_invoke to true, and throwing away the result.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer"]
    pub fn dds_lset_data_available(
        listener: *mut dds_listener_t,
        callback: dds_on_data_available_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the sample_rejected callback in the listener structure.\n\n Equivalent to calling @ref dds_lset_sample_rejected_arg with arg set to the argument passed in\n dds_create_listener() and reset_on_invoke to true, and throwing away the result.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer"]
    pub fn dds_lset_sample_rejected(
        listener: *mut dds_listener_t,
        callback: dds_on_sample_rejected_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the liveliness_changed callback in the listener structure.\n\n Equivalent to calling @ref dds_lset_liveliness_changed_arg with arg set to the argument passed in\n dds_create_listener() and reset_on_invoke to true, and throwing away the result.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer"]
    pub fn dds_lset_liveliness_changed(
        listener: *mut dds_listener_t,
        callback: dds_on_liveliness_changed_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the requested_deadline_missed callback in the listener structure.\n\n Equivalent to calling @ref dds_lset_requested_deadline_missed_arg with arg set to the argument passed in\n dds_create_listener() and reset_on_invoke to true, and throwing away the result.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer"]
    pub fn dds_lset_requested_deadline_missed(
        listener: *mut dds_listener_t,
        callback: dds_on_requested_deadline_missed_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the requested_incompatible_qos callback in the listener structure.\n\n Equivalent to calling @ref dds_lset_requested_incompatible_qos_arg with arg set to the argument passed in\n dds_create_listener() and reset_on_invoke to true, and throwing away the result.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer"]
    pub fn dds_lset_requested_incompatible_qos(
        listener: *mut dds_listener_t,
        callback: dds_on_requested_incompatible_qos_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the publication_matched callback in the listener structure.\n\n Equivalent to calling @ref dds_lset_publication_matched_arg with arg set to the argument passed in\n dds_create_listener() and reset_on_invoke to true, and throwing away the result.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer"]
    pub fn dds_lset_publication_matched(
        listener: *mut dds_listener_t,
        callback: dds_on_publication_matched_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_setters\n @component listener_obj\n @brief Set the subscription_matched callback in the listener structure.\n\n Equivalent to calling @ref dds_lset_subscription_matched_arg with arg set to the argument passed in\n dds_create_listener() and reset_on_invoke to true, and throwing away the result.\n\n @param[in,out] listener listener structure to update\n @param[in] callback the callback to set or a null pointer"]
    pub fn dds_lset_subscription_matched(
        listener: *mut dds_listener_t,
        callback: dds_on_subscription_matched_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the data_available callback from the listener structure.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer\n @param[out] arg Callback argument pointer; may be a null pointer\n @param[out] reset_on_invoke Whether the status is reset by listener invocation; may be a null pointer\n\n @retval DDS_RETCODE_OK if successful\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lget_data_available_arg(
        listener: *const dds_listener_t,
        callback: *mut dds_on_data_available_fn,
        arg: *mut *mut ::std::ffi::c_void,
        reset_on_invoke: *mut bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the data_on_readers callback from the listener structure.\n\n @remark: See also the remark on @ref DDS_DATA_AVAILABLE_STATUS)\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer\n @param[out] arg Callback argument pointer; may be a null pointer\n @param[out] reset_on_invoke Whether the status is reset by listener invocation; may be a null pointer\n\n @retval DDS_RETCODE_OK if successful\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lget_data_on_readers_arg(
        listener: *const dds_listener_t,
        callback: *mut dds_on_data_on_readers_fn,
        arg: *mut *mut ::std::ffi::c_void,
        reset_on_invoke: *mut bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the inconsistent_topic callback from the listener structure.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer\n @param[out] arg Callback argument pointer; may be a null pointer\n @param[out] reset_on_invoke Whether the status is reset by listener invocation; may be a null pointer\n\n @retval DDS_RETCODE_OK if successful\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lget_inconsistent_topic_arg(
        listener: *const dds_listener_t,
        callback: *mut dds_on_inconsistent_topic_fn,
        arg: *mut *mut ::std::ffi::c_void,
        reset_on_invoke: *mut bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the liveliness_changed callback from the listener structure.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer\n @param[out] arg Callback argument pointer; may be a null pointer\n @param[out] reset_on_invoke Whether the status is reset by listener invocation; may be a null pointer\n\n @retval DDS_RETCODE_OK if successful\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lget_liveliness_changed_arg(
        listener: *const dds_listener_t,
        callback: *mut dds_on_liveliness_changed_fn,
        arg: *mut *mut ::std::ffi::c_void,
        reset_on_invoke: *mut bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the liveliness_lost callback from the listener structure.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer\n @param[out] arg Callback argument pointer; may be a null pointer\n @param[out] reset_on_invoke Whether the status is reset by listener invocation; may be a null pointer\n\n @retval DDS_RETCODE_OK if successful\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lget_liveliness_lost_arg(
        listener: *const dds_listener_t,
        callback: *mut dds_on_liveliness_lost_fn,
        arg: *mut *mut ::std::ffi::c_void,
        reset_on_invoke: *mut bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the offered_deadline_missed callback from the listener structure.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer\n @param[out] arg Callback argument pointer; may be a null pointer\n @param[out] reset_on_invoke Whether the status is reset by listener invocation; may be a null pointer\n\n @retval DDS_RETCODE_OK if successful\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lget_offered_deadline_missed_arg(
        listener: *const dds_listener_t,
        callback: *mut dds_on_offered_deadline_missed_fn,
        arg: *mut *mut ::std::ffi::c_void,
        reset_on_invoke: *mut bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the offered_incompatible_qos callback from the listener structure.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer\n @param[out] arg Callback argument pointer; may be a null pointer\n @param[out] reset_on_invoke Whether the status is reset by listener invocation; may be a null pointer\n\n @retval DDS_RETCODE_OK if successful\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lget_offered_incompatible_qos_arg(
        listener: *const dds_listener_t,
        callback: *mut dds_on_offered_incompatible_qos_fn,
        arg: *mut *mut ::std::ffi::c_void,
        reset_on_invoke: *mut bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the publication_matched callback from the listener structure.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer\n @param[out] arg Callback argument pointer; may be a null pointer\n @param[out] reset_on_invoke Whether the status is reset by listener invocation; may be a null pointer\n\n @retval DDS_RETCODE_OK if successful\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lget_publication_matched_arg(
        listener: *const dds_listener_t,
        callback: *mut dds_on_publication_matched_fn,
        arg: *mut *mut ::std::ffi::c_void,
        reset_on_invoke: *mut bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the subscription_matched callback from the listener structure.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer\n @param[out] arg Callback argument pointer; may be a null pointer\n @param[out] reset_on_invoke Whether the status is reset by listener invocation; may be a null pointer\n\n @retval DDS_RETCODE_OK if successful\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lget_requested_deadline_missed_arg(
        listener: *const dds_listener_t,
        callback: *mut dds_on_requested_deadline_missed_fn,
        arg: *mut *mut ::std::ffi::c_void,
        reset_on_invoke: *mut bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the requested_incompatible_qos callback from the listener structure.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer\n @param[out] arg Callback argument pointer; may be a null pointer\n @param[out] reset_on_invoke Whether the status is reset by listener invocation; may be a null pointer\n\n @retval DDS_RETCODE_OK if successful\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lget_requested_incompatible_qos_arg(
        listener: *const dds_listener_t,
        callback: *mut dds_on_requested_incompatible_qos_fn,
        arg: *mut *mut ::std::ffi::c_void,
        reset_on_invoke: *mut bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the sample_lost callback from the listener structure.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer\n @param[out] arg Callback argument pointer; may be a null pointer\n @param[out] reset_on_invoke Whether the status is reset by listener invocation; may be a null pointer\n\n @retval DDS_RETCODE_OK if successful\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lget_sample_lost_arg(
        listener: *const dds_listener_t,
        callback: *mut dds_on_sample_lost_fn,
        arg: *mut *mut ::std::ffi::c_void,
        reset_on_invoke: *mut bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the sample_rejected callback from the listener structure.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer\n @param[out] arg Callback argument pointer; may be a null pointer\n @param[out] reset_on_invoke Whether the status is reset by listener invocation; may be a null pointer\n\n @retval DDS_RETCODE_OK if successful\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lget_sample_rejected_arg(
        listener: *const dds_listener_t,
        callback: *mut dds_on_sample_rejected_fn,
        arg: *mut *mut ::std::ffi::c_void,
        reset_on_invoke: *mut bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the subscription_matched callback from the listener structure.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer\n @param[out] arg Callback argument pointer; may be a null pointer\n @param[out] reset_on_invoke Whether the status is reset by listener invocation; may be a null pointer\n\n @retval DDS_RETCODE_OK if successful\n @retval DDS_RETCODE_BAD_PARAMETER listener is a null pointer"]
    pub fn dds_lget_subscription_matched_arg(
        listener: *const dds_listener_t,
        callback: *mut dds_on_subscription_matched_fn,
        arg: *mut *mut ::std::ffi::c_void,
        reset_on_invoke: *mut bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the inconsistent_topic callback from the listener structure\n\n Equivalent to calling @ref dds_lget_inconsistent_topic_arg with arg and reset_on_invoke set to a null pointer and throwing away the result.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer"]
    pub fn dds_lget_inconsistent_topic(
        listener: *const dds_listener_t,
        callback: *mut dds_on_inconsistent_topic_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the liveliness_lost callback from the listener structure.\n\n Equivalent to calling @ref dds_lget_liveliness_lost_arg with arg and reset_on_invoke set to a null pointer and throwing away the result.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer"]
    pub fn dds_lget_liveliness_lost(
        listener: *const dds_listener_t,
        callback: *mut dds_on_liveliness_lost_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the offered_deadline_missed callback from the listener structure.\n\n Equivalent to calling @ref dds_lget_offered_deadline_missed_arg with arg and reset_on_invoke set to a null pointer and throwing away the result.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer"]
    pub fn dds_lget_offered_deadline_missed(
        listener: *const dds_listener_t,
        callback: *mut dds_on_offered_deadline_missed_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the offered_incompatible_qos callback from the listener structure.\n\n Equivalent to calling @ref dds_lget_offered_incompatible_qos_arg with arg and reset_on_invoke set to a null pointer and throwing away the result.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer"]
    pub fn dds_lget_offered_incompatible_qos(
        listener: *const dds_listener_t,
        callback: *mut dds_on_offered_incompatible_qos_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the data_on_readers callback from the listener structure.\n\n Equivalent to calling @ref dds_lget_data_on_readers_arg with arg and reset_on_invoke set to a null pointer and throwing away the result.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer"]
    pub fn dds_lget_data_on_readers(
        listener: *const dds_listener_t,
        callback: *mut dds_on_data_on_readers_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the sample_lost callback from the listener structure.\n\n Equivalent to calling @ref dds_lget_sample_lost_arg with arg and reset_on_invoke set to a null pointer and throwing away the result.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer"]
    pub fn dds_lget_sample_lost(
        listener: *const dds_listener_t,
        callback: *mut dds_on_sample_lost_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the data_available callback from the listener structure.\n\n Equivalent to calling @ref dds_lget_data_available_arg with arg and reset_on_invoke set to a null pointer and throwing away the result.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer"]
    pub fn dds_lget_data_available(
        listener: *const dds_listener_t,
        callback: *mut dds_on_data_available_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the sample_rejected callback from the listener structure.\n\n Equivalent to calling @ref dds_lget_sample_rejected_arg with arg and reset_on_invoke set to a null pointer and throwing away the result.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer"]
    pub fn dds_lget_sample_rejected(
        listener: *const dds_listener_t,
        callback: *mut dds_on_sample_rejected_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the liveliness_changed callback from the listener structure.\n\n Equivalent to calling @ref dds_lget_liveliness_changed_arg with arg and reset_on_invoke set to a null pointer and throwing away the result.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer"]
    pub fn dds_lget_liveliness_changed(
        listener: *const dds_listener_t,
        callback: *mut dds_on_liveliness_changed_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the requested_deadline_missed callback from the listener structure.\n\n Equivalent to calling @ref dds_lget_requested_deadline_missed_arg with arg and reset_on_invoke set to a null pointer and throwing away the result.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer"]
    pub fn dds_lget_requested_deadline_missed(
        listener: *const dds_listener_t,
        callback: *mut dds_on_requested_deadline_missed_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the requested_incompatible_qos callback from the listener structure.\n\n Equivalent to calling @ref dds_lget_requested_incompatible_qos_arg with arg and reset_on_invoke set to a null pointer and throwing away the result.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer"]
    pub fn dds_lget_requested_incompatible_qos(
        listener: *const dds_listener_t,
        callback: *mut dds_on_requested_incompatible_qos_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the publication_matched callback from the listener structure.\n\n Equivalent to calling @ref dds_lget_publication_matched_arg with arg and reset_on_invoke set to a null pointer and throwing away the result.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer"]
    pub fn dds_lget_publication_matched(
        listener: *const dds_listener_t,
        callback: *mut dds_on_publication_matched_fn,
    );
}
unsafe extern "C" {
    #[doc = " @ingroup listener_getters\n @component listener_obj\n @brief Get the subscription_matched callback from the listener structure.\n\n Equivalent to calling @ref dds_lget_subscription_matched_arg with arg and reset_on_invoke set to a null pointer and throwing away the result.\n\n @param[in] listener The pointer to the listener structure, where the callback will be retrieved from\n @param[out] callback Callback function; may be a null pointer"]
    pub fn dds_lget_subscription_matched(
        listener: *const dds_listener_t,
        callback: *mut dds_on_subscription_matched_fn,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ddsi_typeinfo {
    _unused: [u8; 0],
}
#[doc = " @brief Dynamic Type\n @ingroup dynamic_type\n\n Representation of a dynamically created type. This struct has an opaque pointer\n to the type in the type system. During construction of the type (setting properties\n and adding members), the internal type has the state 'CONSTRUCTION'. Once the type\n is registered, the state is updated to 'RESOLVED' and the type cannot be modified.\n\n The 'ret' member of this struct holds the return code of operations performed on\n this type. In case this value is not DDS_RETCODE_OK, the type cannot be used for\n further processing (e.g. adding members, registering the type, etc.).\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dds_dynamic_type {
    pub x: [*mut ::std::ffi::c_void; 2usize],
    pub ret: dds_return_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_dynamic_type"][::std::mem::size_of::<dds_dynamic_type>() - 24usize];
    ["Alignment of dds_dynamic_type"][::std::mem::align_of::<dds_dynamic_type>() - 8usize];
    ["Offset of field: dds_dynamic_type::x"][::std::mem::offset_of!(dds_dynamic_type, x) - 0usize];
    ["Offset of field: dds_dynamic_type::ret"]
        [::std::mem::offset_of!(dds_dynamic_type, ret) - 16usize];
};
impl Default for dds_dynamic_type {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Dynamic Type\n @ingroup dynamic_type\n\n Representation of a dynamically created type. This struct has an opaque pointer\n to the type in the type system. During construction of the type (setting properties\n and adding members), the internal type has the state 'CONSTRUCTION'. Once the type\n is registered, the state is updated to 'RESOLVED' and the type cannot be modified.\n\n The 'ret' member of this struct holds the return code of operations performed on\n this type. In case this value is not DDS_RETCODE_OK, the type cannot be used for\n further processing (e.g. adding members, registering the type, etc.).\n"]
pub type dds_dynamic_type_t = dds_dynamic_type;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_NONE: dds_dynamic_type_kind = 0;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_BOOLEAN: dds_dynamic_type_kind = 1;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_BYTE: dds_dynamic_type_kind = 2;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_INT16: dds_dynamic_type_kind = 3;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_INT32: dds_dynamic_type_kind = 4;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_INT64: dds_dynamic_type_kind = 5;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_UINT16: dds_dynamic_type_kind = 6;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_UINT32: dds_dynamic_type_kind = 7;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_UINT64: dds_dynamic_type_kind = 8;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_FLOAT32: dds_dynamic_type_kind = 9;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_FLOAT64: dds_dynamic_type_kind = 10;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_FLOAT128: dds_dynamic_type_kind = 11;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_INT8: dds_dynamic_type_kind = 12;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_UINT8: dds_dynamic_type_kind = 13;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_CHAR8: dds_dynamic_type_kind = 14;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_CHAR16: dds_dynamic_type_kind = 15;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_STRING8: dds_dynamic_type_kind = 16;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_STRING16: dds_dynamic_type_kind = 17;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_ENUMERATION: dds_dynamic_type_kind = 18;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_BITMASK: dds_dynamic_type_kind = 19;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_ALIAS: dds_dynamic_type_kind = 20;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_ARRAY: dds_dynamic_type_kind = 21;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_SEQUENCE: dds_dynamic_type_kind = 22;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_MAP: dds_dynamic_type_kind = 23;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_STRUCTURE: dds_dynamic_type_kind = 24;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_UNION: dds_dynamic_type_kind = 25;
pub const dds_dynamic_type_kind_DDS_DYNAMIC_BITSET: dds_dynamic_type_kind = 26;
#[doc = " @brief Dynamic Type Kind\n @ingroup dynamic_type\n\n Enumeration with the type kind values that can be used to create a dynamic type."]
pub type dds_dynamic_type_kind = ::std::ffi::c_uint;
#[doc = " @brief Dynamic Type Kind\n @ingroup dynamic_type\n\n Enumeration with the type kind values that can be used to create a dynamic type."]
pub use self::dds_dynamic_type_kind as dds_dynamic_type_kind_t;
pub const dds_dynamic_type_spec_kind_DDS_DYNAMIC_TYPE_KIND_UNSET: dds_dynamic_type_spec_kind = 0;
pub const dds_dynamic_type_spec_kind_DDS_DYNAMIC_TYPE_KIND_DEFINITION: dds_dynamic_type_spec_kind =
    1;
pub const dds_dynamic_type_spec_kind_DDS_DYNAMIC_TYPE_KIND_PRIMITIVE: dds_dynamic_type_spec_kind =
    2;
#[doc = " @ingroup dynamic_type\n\n Dynamic Type specification kind"]
pub type dds_dynamic_type_spec_kind = ::std::ffi::c_uint;
#[doc = " @ingroup dynamic_type\n\n Dynamic Type specification kind"]
pub use self::dds_dynamic_type_spec_kind as dds_dynamic_type_spec_kind_t;
#[doc = " @ingroup dynamic_type\n\n Dynamic Type specification: a reference to dynamic type, which can be a primitive type\n kind (just the type kind enumeration value), or a (primitive or non-primitive) dynamic\n type reference."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dds_dynamic_type_spec {
    pub kind: dds_dynamic_type_spec_kind_t,
    pub type_: dds_dynamic_type_spec__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union dds_dynamic_type_spec__bindgen_ty_1 {
    pub type_: dds_dynamic_type_t,
    pub primitive: dds_dynamic_type_kind_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_dynamic_type_spec__bindgen_ty_1"]
        [::std::mem::size_of::<dds_dynamic_type_spec__bindgen_ty_1>() - 24usize];
    ["Alignment of dds_dynamic_type_spec__bindgen_ty_1"]
        [::std::mem::align_of::<dds_dynamic_type_spec__bindgen_ty_1>() - 8usize];
    ["Offset of field: dds_dynamic_type_spec__bindgen_ty_1::type_"]
        [::std::mem::offset_of!(dds_dynamic_type_spec__bindgen_ty_1, type_) - 0usize];
    ["Offset of field: dds_dynamic_type_spec__bindgen_ty_1::primitive"]
        [::std::mem::offset_of!(dds_dynamic_type_spec__bindgen_ty_1, primitive) - 0usize];
};
impl Default for dds_dynamic_type_spec__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_dynamic_type_spec"][::std::mem::size_of::<dds_dynamic_type_spec>() - 32usize];
    ["Alignment of dds_dynamic_type_spec"]
        [::std::mem::align_of::<dds_dynamic_type_spec>() - 8usize];
    ["Offset of field: dds_dynamic_type_spec::kind"]
        [::std::mem::offset_of!(dds_dynamic_type_spec, kind) - 0usize];
    ["Offset of field: dds_dynamic_type_spec::type_"]
        [::std::mem::offset_of!(dds_dynamic_type_spec, type_) - 8usize];
};
impl Default for dds_dynamic_type_spec {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @ingroup dynamic_type\n\n Dynamic Type specification: a reference to dynamic type, which can be a primitive type\n kind (just the type kind enumeration value), or a (primitive or non-primitive) dynamic\n type reference."]
pub type dds_dynamic_type_spec_t = dds_dynamic_type_spec;
#[doc = " @brief Dynamic Type descriptor\n @ingroup dynamic_type\n\n Structure that holds the properties for creating a Dynamic Type. For each type kind,\n specific member fields are applicable and/or required."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dds_dynamic_type_descriptor {
    #[doc = "< Type kind. Required for all types."]
    pub kind: dds_dynamic_type_kind_t,
    #[doc = "< Type name. Required for struct, union, alias, enum, bitmask, array, sequence."]
    pub name: *const ::std::ffi::c_char,
    #[doc = "< Option base type for a struct, or (required) aliased type in case of an alias type."]
    pub base_type: dds_dynamic_type_spec_t,
    #[doc = "< Discriminator type for a union (required)."]
    pub discriminator_type: dds_dynamic_type_spec_t,
    #[doc = "< Number of bounds for array and sequence types. In case of sequence, this can be 0 (unbounded) or 1."]
    pub num_bounds: u32,
    #[doc = "< Bounds for array (0..num_bounds) and sequence (single value)"]
    pub bounds: *const u32,
    #[doc = "< Element type for array and sequence, required."]
    pub element_type: dds_dynamic_type_spec_t,
    #[doc = "< Key element type for map type"]
    pub key_element_type: dds_dynamic_type_spec_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_dynamic_type_descriptor"]
        [::std::mem::size_of::<dds_dynamic_type_descriptor>() - 160usize];
    ["Alignment of dds_dynamic_type_descriptor"]
        [::std::mem::align_of::<dds_dynamic_type_descriptor>() - 8usize];
    ["Offset of field: dds_dynamic_type_descriptor::kind"]
        [::std::mem::offset_of!(dds_dynamic_type_descriptor, kind) - 0usize];
    ["Offset of field: dds_dynamic_type_descriptor::name"]
        [::std::mem::offset_of!(dds_dynamic_type_descriptor, name) - 8usize];
    ["Offset of field: dds_dynamic_type_descriptor::base_type"]
        [::std::mem::offset_of!(dds_dynamic_type_descriptor, base_type) - 16usize];
    ["Offset of field: dds_dynamic_type_descriptor::discriminator_type"]
        [::std::mem::offset_of!(dds_dynamic_type_descriptor, discriminator_type) - 48usize];
    ["Offset of field: dds_dynamic_type_descriptor::num_bounds"]
        [::std::mem::offset_of!(dds_dynamic_type_descriptor, num_bounds) - 80usize];
    ["Offset of field: dds_dynamic_type_descriptor::bounds"]
        [::std::mem::offset_of!(dds_dynamic_type_descriptor, bounds) - 88usize];
    ["Offset of field: dds_dynamic_type_descriptor::element_type"]
        [::std::mem::offset_of!(dds_dynamic_type_descriptor, element_type) - 96usize];
    ["Offset of field: dds_dynamic_type_descriptor::key_element_type"]
        [::std::mem::offset_of!(dds_dynamic_type_descriptor, key_element_type) - 128usize];
};
impl Default for dds_dynamic_type_descriptor {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Dynamic Type descriptor\n @ingroup dynamic_type\n\n Structure that holds the properties for creating a Dynamic Type. For each type kind,\n specific member fields are applicable and/or required."]
pub type dds_dynamic_type_descriptor_t = dds_dynamic_type_descriptor;
#[doc = " @brief Dynamic Type Member descriptor\n @ingroup dynamic_type\n\n Structure that holds the properities for adding a member to a dynamic type. Depending on\n the member type, different fields apply and are required."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dds_dynamic_member_descriptor {
    #[doc = "< Name of the member, required"]
    pub name: *const ::std::ffi::c_char,
    #[doc = "< Identifier of the member, applicable for struct and union members. DDS_DYNAMIC_MEMBER_ID_AUTO can be used to indicate the next available id (current max + 1) should be used."]
    pub id: u32,
    #[doc = "< Member type, required for struct and union members."]
    pub type_: dds_dynamic_type_spec_t,
    #[doc = "< Default value for the member"]
    pub default_value: *mut ::std::ffi::c_char,
    #[doc = "< Member index, applicable for struct and union members. DDS_DYNAMIC_MEMBER_INDEX_START and DDS_DYNAMIC_MEMBER_INDEX_END can be used to add a member as first or last member in the parent type."]
    pub index: u32,
    #[doc = "< Number of labels, required for union members in case not default_label"]
    pub num_labels: u32,
    #[doc = "< Labels for a union member, 1..n required for union members in case not default_label"]
    pub labels: *mut i32,
    #[doc = "< Is default union member"]
    pub default_label: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_dynamic_member_descriptor"]
        [::std::mem::size_of::<dds_dynamic_member_descriptor>() - 80usize];
    ["Alignment of dds_dynamic_member_descriptor"]
        [::std::mem::align_of::<dds_dynamic_member_descriptor>() - 8usize];
    ["Offset of field: dds_dynamic_member_descriptor::name"]
        [::std::mem::offset_of!(dds_dynamic_member_descriptor, name) - 0usize];
    ["Offset of field: dds_dynamic_member_descriptor::id"]
        [::std::mem::offset_of!(dds_dynamic_member_descriptor, id) - 8usize];
    ["Offset of field: dds_dynamic_member_descriptor::type_"]
        [::std::mem::offset_of!(dds_dynamic_member_descriptor, type_) - 16usize];
    ["Offset of field: dds_dynamic_member_descriptor::default_value"]
        [::std::mem::offset_of!(dds_dynamic_member_descriptor, default_value) - 48usize];
    ["Offset of field: dds_dynamic_member_descriptor::index"]
        [::std::mem::offset_of!(dds_dynamic_member_descriptor, index) - 56usize];
    ["Offset of field: dds_dynamic_member_descriptor::num_labels"]
        [::std::mem::offset_of!(dds_dynamic_member_descriptor, num_labels) - 60usize];
    ["Offset of field: dds_dynamic_member_descriptor::labels"]
        [::std::mem::offset_of!(dds_dynamic_member_descriptor, labels) - 64usize];
    ["Offset of field: dds_dynamic_member_descriptor::default_label"]
        [::std::mem::offset_of!(dds_dynamic_member_descriptor, default_label) - 72usize];
};
impl Default for dds_dynamic_member_descriptor {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Dynamic Type Member descriptor\n @ingroup dynamic_type\n\n Structure that holds the properities for adding a member to a dynamic type. Depending on\n the member type, different fields apply and are required."]
pub type dds_dynamic_member_descriptor_t = dds_dynamic_member_descriptor;
pub const dds_dynamic_type_extensibility_DDS_DYNAMIC_TYPE_EXT_FINAL:
    dds_dynamic_type_extensibility = 0;
pub const dds_dynamic_type_extensibility_DDS_DYNAMIC_TYPE_EXT_APPENDABLE:
    dds_dynamic_type_extensibility = 1;
pub const dds_dynamic_type_extensibility_DDS_DYNAMIC_TYPE_EXT_MUTABLE:
    dds_dynamic_type_extensibility = 2;
#[doc = " @ingroup dynamic_type\n\n Dynamic Type extensibility"]
pub type dds_dynamic_type_extensibility = ::std::ffi::c_uint;
#[doc = "< The member ID are assigned sequential"]
pub const dds_dynamic_type_autoid_DDS_DYNAMIC_TYPE_AUTOID_SEQUENTIAL: dds_dynamic_type_autoid = 0;
#[doc = "< The member ID is the hash of the member's name"]
pub const dds_dynamic_type_autoid_DDS_DYNAMIC_TYPE_AUTOID_HASH: dds_dynamic_type_autoid = 1;
#[doc = " @ingroup dynamic_type\n\n Dynamic Type automatic member ID kind"]
pub type dds_dynamic_type_autoid = ::std::ffi::c_uint;
pub const dds_dynamic_type_enum_value_kind_DDS_DYNAMIC_ENUM_LITERAL_VALUE_NEXT_AVAIL:
    dds_dynamic_type_enum_value_kind = 0;
pub const dds_dynamic_type_enum_value_kind_DDS_DYNAMIC_ENUM_LITERAL_VALUE_EXPLICIT:
    dds_dynamic_type_enum_value_kind = 1;
#[doc = " @brief Enum value kind\n\n see @ref dds_dynamic_enum_literal_value"]
pub type dds_dynamic_type_enum_value_kind = ::std::ffi::c_uint;
#[doc = " @ingroup dynamic_type\n\n Dynamic Enumeration type literal value kind and value. Can be set to NEXT_AVAIL to indicate\n that the current max value + 1 should be used for this member, or an explicit value can be\n provided."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dds_dynamic_enum_literal_value {
    pub value_kind: dds_dynamic_type_enum_value_kind,
    pub value: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_dynamic_enum_literal_value"]
        [::std::mem::size_of::<dds_dynamic_enum_literal_value>() - 8usize];
    ["Alignment of dds_dynamic_enum_literal_value"]
        [::std::mem::align_of::<dds_dynamic_enum_literal_value>() - 4usize];
    ["Offset of field: dds_dynamic_enum_literal_value::value_kind"]
        [::std::mem::offset_of!(dds_dynamic_enum_literal_value, value_kind) - 0usize];
    ["Offset of field: dds_dynamic_enum_literal_value::value"]
        [::std::mem::offset_of!(dds_dynamic_enum_literal_value, value) - 4usize];
};
impl Default for dds_dynamic_enum_literal_value {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @ingroup dynamic_type\n\n Dynamic Enumeration type literal value kind and value. Can be set to NEXT_AVAIL to indicate\n that the current max value + 1 should be used for this member, or an explicit value can be\n provided."]
pub type dds_dynamic_enum_literal_value_t = dds_dynamic_enum_literal_value;
unsafe extern "C" {
    #[doc = " @brief Create a new Dynamic Type\n @ingroup dynamic_type\n @component dynamic_type_api\n\n Creates a new Dynamic Type, using the properties that are set in the type descriptor.\n In case these properties include a base-type, element-type or discriminator type, the\n ownership of these types is transferred to the newly created type.\n\n @param[in] entity A DDS entity (any entity, except the pseudo root entity identified by DDS_CYCLONEDDS_HANDLE). This entity is used to get the type library of the entity's domain, to add the type to.\n @param[in] descriptor The Dynamic Type descriptor.\n\n @return dds_dynamic_type_t A Dynamic Type reference for the created type.\n\n @retval DDS_RETCODE_OK\n            The type is created successfully.\n @retval DDS_RETCODE_BAD_PARAMETER\n            One or more of the provided parameters are invalid.\n @retval DDS_RETCODE_UNSUPPORTED\n            The provided type kind is not supported.\n @retval DDS_RETCODE_OUT_OF_RESOURCES\n            Not enough resources to create the type."]
    pub fn dds_dynamic_type_create(
        entity: dds_entity_t,
        descriptor: dds_dynamic_type_descriptor_t,
    ) -> dds_dynamic_type_t;
}
unsafe extern "C" {
    #[doc = " @brief Set the extensibility of a Dynamic Type\n @ingroup dynamic_type\n @component dynamic_type_api\n\n @param[in,out] type Dynamic Type to set the extensibility for. This can be a structure, union, bitmask or enum type. This type must be in the CONSTRUCTING state and have no members added.\n @param[in] extensibility The extensibility to set (@ref dds_dynamic_type_extensibility).\n\n @return dds_return_t Return code. In case of an error, the return code field in the provided type is also set to this value.\n\n @retval DDS_RETCODE_OK\n            The extensibility is set successfully.\n @retval DDS_RETCODE_BAD_PARAMETER\n            One or more of the provided parameters are invalid.\n @retval DDS_RETCODE_PRECONDITION_NOT_MET\n            The provided type is not in the CONSTRUCTING state."]
    pub fn dds_dynamic_type_set_extensibility(
        type_: *mut dds_dynamic_type_t,
        extensibility: dds_dynamic_type_extensibility,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Set the bit-bound of a Dynamic Type\n @ingroup dynamic_type\n @component dynamic_type_api\n\n @param[in,out] type Dynamic Type to set the bit-bound for. This can be a bitmask or enum type.\n @param[in] bit_bound The bit-bound value to set, in the (including) range 1..32 for enum and 1..64 for bitmask.\n\n @return dds_return_t Return code. In case of an error, the return code field in the provided type is also set to this value.\n\n @retval DDS_RETCODE_OK\n            The bit-bound is set successfully.\n @retval DDS_RETCODE_BAD_PARAMETER\n            One or more of the provided parameters are invalid.\n @retval DDS_RETCODE_PRECONDITION_NOT_MET\n            The provided type is not in the CONSTRUCTING state."]
    pub fn dds_dynamic_type_set_bit_bound(
        type_: *mut dds_dynamic_type_t,
        bit_bound: u16,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Set the nested flag of a Dynamic Type\n @ingroup dynamic_type\n @component dynamic_type_api\n\n @param[in,out] type Dynamic Type to set the nested flag for. This can be a structure or union type.\n @param[in] is_nested Whether the nested flag is set.\n\n @return dds_return_t Return code. In case of an error, the return code field in the provided type is also set to this value.\n\n @retval DDS_RETCODE_OK\n            The flag is set successfully.\n @retval DDS_RETCODE_BAD_PARAMETER\n            One or more of the provided parameters are invalid.\n @retval DDS_RETCODE_PRECONDITION_NOT_MET\n            The provided type is not in the CONSTRUCTING state."]
    pub fn dds_dynamic_type_set_nested(
        type_: *mut dds_dynamic_type_t,
        is_nested: bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Set the auto-id kind of a Dynamic Type\n @ingroup dynamic_type\n @component dynamic_type_api\n\n @param[in,out] type Dynamic Type to set the auto-id kind for. This can be a structure or union type.\n @param[in] value The auto-id kind, see @ref dds_dynamic_type_autoid.\n\n @return dds_return_t Return code. In case of an error, the return code field in the provided type is also set to this value.\n\n @retval DDS_RETCODE_OK\n            The value is set successfully.\n @retval DDS_RETCODE_BAD_PARAMETER\n            One or more of the provided parameters are invalid.\n @retval DDS_RETCODE_PRECONDITION_NOT_MET\n            The provided type is not in the CONSTRUCTING state."]
    pub fn dds_dynamic_type_set_autoid(
        type_: *mut dds_dynamic_type_t,
        value: dds_dynamic_type_autoid,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Add a member to a Dynamic Type\n @ingroup dynamic_type\n @component dynamic_type_api\n\n This function is used to add a member to a Dynamic Type. The parent type can be a structure,\n union, enumeration or bitmask type. The parent type the member is added to takes over the\n ownership of the member type and dereferences the member type when it is deleted.\n (@see dds_dynamic_type_ref for re-using a type)\n\n @param[in,out] type The Dynamic type to add the member to.\n @param[in] member_descriptor The member descriptor that has the properties of the member to add, @see dds_dynamic_member_descriptor.\n\n @return dds_return_t Return code. In case of an error, the return code field in the provided type is also set to this value.\n\n @retval DDS_RETCODE_OK\n            The member is added successfully.\n @retval DDS_RETCODE_BAD_PARAMETER\n            One or more of the provided parameters are invalid.\n @retval DDS_RETCODE_PRECONDITION_NOT_MET\n            The provided type (non the member type) is not in the CONSTRUCTING state."]
    pub fn dds_dynamic_type_add_member(
        type_: *mut dds_dynamic_type_t,
        member_descriptor: dds_dynamic_member_descriptor_t,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Add a literal to a Dynamic Enum Type\n @ingroup dynamic_type\n @component dynamic_type_api\n\n This function is used to add a literal to a Dynamic Enum Type.\n\n @param[in,out] type The Dynamic enum type to add the member to.\n @param[in] name The name of the literal to add.\n @param[in] value The value for the literal (@see dds_dynamic_enum_literal_value).\n @param[in] is_default Indicates if the literal if default for the enum.\n\n @return dds_return_t Return code. In case of an error, the return code field in the provided type is also set to this value.\n\n @retval DDS_RETCODE_OK\n            The member is added successfully\n @retval DDS_RETCODE_BAD_PARAMETER\n            One or more of the provided parameters are invalid.\n @retval DDS_RETCODE_PRECONDITION_NOT_MET\n            The provided type is not in the CONSTRUCTING state."]
    pub fn dds_dynamic_type_add_enum_literal(
        type_: *mut dds_dynamic_type_t,
        name: *const ::std::ffi::c_char,
        value: dds_dynamic_enum_literal_value_t,
        is_default: bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Add a field to a Dynamic bitmask Type\n @ingroup dynamic_type\n @component dynamic_type_api\n\n This function is used to add a field to a Dynamic bitmask Type.\n\n @param[in,out] type The Dynamic bitmask type to add the field to.\n @param[in] name The name of the field to add.\n @param[in] position The position for the field (@see DDS_DYNAMIC_BITMASK_POSITION_AUTO).\n\n @return dds_return_t Return code. In case of an error, the return code field in the provided type is also set to this value.\n\n @retval DDS_RETCODE_OK\n            The member is added successfully\n @retval DDS_RETCODE_BAD_PARAMETER\n            One or more of the provided parameters are invalid.\n @retval DDS_RETCODE_PRECONDITION_NOT_MET\n            The provided type is not in the CONSTRUCTING state."]
    pub fn dds_dynamic_type_add_bitmask_field(
        type_: *mut dds_dynamic_type_t,
        name: *const ::std::ffi::c_char,
        position: u16,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Set the key flag for a Dynamic Type member\n @ingroup dynamic_type\n @component dynamic_type_api\n\n @param[in,out] type Dynamic Type that contains the member to set the key flag for (must be a structure type).\n @param[in] member_id The ID of the member to set the flag for.\n @param[in] is_key Indicates whether the key flag should be set or cleared.\n\n @return dds_return_t Return code. In case of an error, the return code field in the provided type is also set to this value.\n\n @retval DDS_RETCODE_OK\n            The flag is updated successfully.\n @retval DDS_RETCODE_BAD_PARAMETER\n            One or more of the provided parameters are invalid.\n @retval DDS_RETCODE_PRECONDITION_NOT_MET\n            The provided type is not in the CONSTRUCTING state."]
    pub fn dds_dynamic_member_set_key(
        type_: *mut dds_dynamic_type_t,
        member_id: u32,
        is_key: bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Set the optional flag for a Dynamic Type member\n @ingroup dynamic_type\n @component dynamic_type_api\n\n @param[in,out] type Dynamic Type that contains the member to set the optional flag for (must be a structure type).\n @param[in] member_id The ID of the member to set the flag for.\n @param[in] is_optional Indicates whether the optional flag should be set or cleared.\n\n @return dds_return_t Return code. In case of an error, the return code field in the provided type is also set to this value.\n\n @retval DDS_RETCODE_OK\n            The flag is updated successfully.\n @retval DDS_RETCODE_BAD_PARAMETER\n            One or more of the provided parameters are invalid.\n @retval DDS_RETCODE_PRECONDITION_NOT_MET\n            The provided type is not in the CONSTRUCTING state."]
    pub fn dds_dynamic_member_set_optional(
        type_: *mut dds_dynamic_type_t,
        member_id: u32,
        is_optional: bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Set the external flag for a Dynamic Type member\n @ingroup dynamic_type\n @component dynamic_type_api\n\n @param[in,out] type Dynamic Type that contains the member to set the external flag for (must be a structure or union type).\n @param[in] member_id The ID of the member to set the flag for.\n @param[in] is_external Indicates whether the external flag should be set or cleared.\n\n @return dds_return_t Return code. In case of an error, the return code field in the provided type is also set to this value.\n\n @retval DDS_RETCODE_OK\n            The flag is updated successfully.\n @retval DDS_RETCODE_BAD_PARAMETER\n            One or more of the provided parameters are invalid.\n @retval DDS_RETCODE_PRECONDITION_NOT_MET\n            The provided type is not in the CONSTRUCTING state."]
    pub fn dds_dynamic_member_set_external(
        type_: *mut dds_dynamic_type_t,
        member_id: u32,
        is_external: bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Set the hash ID flag and hash field name for a Dynamic Type member\n @ingroup dynamic_type\n @component dynamic_type_api\n\n @param[in,out] type Dynamic Type that contains the member to set the flag and hash-name for (must be a structure or union type).\n @param[in] member_id The ID of the member to set the flag and hash-name for.\n @param[in] hash_member_name The hash-name that should be used for calculating the member ID.\n\n @return dds_return_t Return code. In case of an error, the return code field in the provided type is also set to this value.\n\n @retval DDS_RETCODE_OK\n            The flag is updated successfully.\n @retval DDS_RETCODE_BAD_PARAMETER\n            One or more of the provided parameters are invalid.\n @retval DDS_RETCODE_PRECONDITION_NOT_MET\n            The provided type is not in the CONSTRUCTING state."]
    pub fn dds_dynamic_member_set_hashid(
        type_: *mut dds_dynamic_type_t,
        member_id: u32,
        hash_member_name: *const ::std::ffi::c_char,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Set the must-understand flag for a Dynamic Type member\n @ingroup dynamic_type\n @component dynamic_type_api\n\n @param[in,out] type Dynamic Type that contains the member to set the must-understand flag for (must be a structure type).\n @param[in] member_id The ID of the member to set the flag for.\n @param[in] is_must_understand Indicates whether the must-understand flag should be set or cleared.\n\n @return dds_return_t Return code. In case of an error, the return code field in the provided type is also set to this value.\n\n @retval DDS_RETCODE_OK\n            The flag is updated successfully.\n @retval DDS_RETCODE_BAD_PARAMETER\n            One or more of the provided parameters are invalid.\n @retval DDS_RETCODE_PRECONDITION_NOT_MET\n            The provided type is not in the CONSTRUCTING state."]
    pub fn dds_dynamic_member_set_must_understand(
        type_: *mut dds_dynamic_type_t,
        member_id: u32,
        is_must_understand: bool,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Registers a Dynamic Type\n @ingroup dynamic_type\n @component dynamic_type_api\n\n This function registers a dynamic type, making it immutable and finalizing\n its definition. A type that is registered, get the state 'RESOLVED' and is\n stored in the type library.\n\n @param[in] type A pointer to the dynamic type to be registered.\n @param[out] type_info A pointer to a pointer to a ddsi_typeinfo structure that holds information about the registered type.\n\n @return dds_return_t Return code.\n\n @retval DDS_RETCODE_OK\n            The type was successfully registered.\n @retval DDS_RETCODE_BAD_PARAMETER\n            One or more of the provided parameters are invalid.\n @retval DDS_RETCODE_PRECONDITION_NOT_MET\n            The provided type is not in the CONSTRUCTING state.\n @retval DDS_RETCODE_OUT_OF_RESOURCES\n            Not enough resources to create the type."]
    pub fn dds_dynamic_type_register(
        type_: *mut dds_dynamic_type_t,
        type_info: *mut *mut ddsi_typeinfo,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Reference a Dynamic Type\n @ingroup dynamic_type\n @component dynamic_type_api\n\n References a Dynamic Type and increases the ref-count of the type. This\n can e.g. be used to re-use a subtype when constructing a type.\n\n @param type Dynamic Type to reference\n\n @return dds_dynamic_type_t Dynamic Type with increased ref-count"]
    pub fn dds_dynamic_type_ref(type_: *mut dds_dynamic_type_t) -> dds_dynamic_type_t;
}
unsafe extern "C" {
    #[doc = " @brief Unref a Dynamic Type\n\n @param type The Dynamic Type to dereference.\n\n @return dds_return_t Return code.\n\n @retval DDS_RETCODE_OK\n            The type was successfully registered.\n @retval DDS_RETCODE_BAD_PARAMETER\n            One or more of the provided parameters are invalid.\n @retval DDS_RETCODE_PRECONDITION_NOT_MET\n            The provided type is not in the CONSTRUCTING state."]
    pub fn dds_dynamic_type_unref(type_: *mut dds_dynamic_type_t) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Duplicate a Dynamic Type\n @ingroup dynamic_type\n @component dynamic_type_api\n\n Duplicates a Dynamic Type. Dependencies of the type are not duplicated,\n but their ref-count is increased.\n\n @param src The type to duplicate.\n\n @return dds_dynamic_type_t A duplicate of the source type."]
    pub fn dds_dynamic_type_dup(src: *const dds_dynamic_type_t) -> dds_dynamic_type_t;
}
unsafe extern "C" {
    #[doc = " @brief Request a loan from an entity.\n @ingroup loan\n\n Borrow a sample from the entity, which currently must be a writer. This sample\n can then be returned using @ref dds_return_loan or can be used to publish data\n using @ref dds_write or @ref dds_writedispose.\n\n If the topic type has a fixed size (and so no internal pointers) and a PSMX interface is configured,\n the memory will be borrowed from the PSMX implementation, which allows Cyclone to avoid copies\n and/or serialization if there is no need for sending the data over a network interface or storing it\n in the WHC.\n\n @param[in] entity The entity to request loans from.\n @param[out] sample Where to store the address of the loaned sample.\n\n @returns A dds_return_t indicating success or failure.\n\n @retval DDS_RETCODE_OK\n             The operation was successful.\n @retval DDS_RETCODE_BAD_PARAMETER\n             One or more parameters are invalid.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n             The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n             The entity has already been deleted.\n @retval DDS_RETCODE_ERROR\n             An unfortunate incident occurred."]
    pub fn dds_request_loan(
        entity: dds_entity_t,
        sample: *mut *mut ::std::ffi::c_void,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Return loaned samples to a reader or writer\n @ingroup loan\n @component read_data\n\n Used to release middleware-owned samples returned by a read/take operation and samples\n borrowed from the writer using @ref dds_request_loan.\n\n For reader loans, the @ref dds_read and @ref dds_take operations implicitly return\n outstanding loans referenced by the sample array passed in.  Looping until no data is\n returned therefore often eliminates the need for calling this function.\n\n For writer loans, a @ref dds_write operation takes over the loan.  Consequently, this\n function is only needed in the exceptional case where a loan is taken but ultimately\n not used to publish data.\n\n @param[in] entity The entity that the loan(s) belong to. If a read or query condition is passed in for the entity, the reader for that condition is used.\n @param[in,out] buf An array of (pointers to) samples, some or all of which will be set to null pointers.\n @param[in] bufsz The size of the buffer.\n\n @returns A dds_return_t indicating success or failure\n @retval DDS_RETCODE_OK\n             - the operation was successful\n             - a no-op if bufsz <= 0, otherwise\n             - buf[0] .. buf[k-1] were successfully returned loans, k = bufsz or buf[k] = null\n             - buf[0] is set to a null pointer, buf[k > 0] undefined\n @retval DDS_RETCODE_BAD_PARAMETER\n             - the entity parameter is not a valid parameter\n             - buf is null, or bufsz > 0 and buf[0] = null\n             - a non-loan was encountered (all loans are still returned)\n @retval DDS_RETCODE_PRECONDITION_NOT_MET\n             - bufsz > 0 and buf[0] != null but not a loan, nothing done\n @retval DDS_RETCODE_UNSUPPORTED\n             - (for writer loans) invoked on a writer not supporting loans.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n             - the operation is invoked on an inappropriate object."]
    pub fn dds_return_loan(
        entity: dds_entity_t,
        buf: *mut *mut ::std::ffi::c_void,
        bufsz: i32,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup loan\n @component read_data\n @brief Check if a shared memory is available to reader/writer.\n\n @note dds_request_loan_of_size can be used if and only if\n dds_is_shared_memory_available returns true.\n\n @param[in] entity the handle of the entity\n\n @returns true if shared memory is available, false otherwise"]
    pub fn dds_is_shared_memory_available(entity: dds_entity_t) -> bool;
}
unsafe extern "C" {
    #[doc = " @brief Request a loan of a specified size from an entity.\n @ingroup loan\n\n Borrow a sample of a specified size from the entity, which currently must be a\n writer. This sample can then be returned using @ref dds_return_loan or can be\n used to publish data using @ref dds_write or @ref dds_writedispose.\n\n @note The function can only be used if dds_is_shared_memory_available is\n       true for the writer.\n\n @param[in] writer The entity to request loans from.\n @param[in] size the requested loan size\n @param[out] sample Where to store the address of the loaned sample.\n\n @returns DDS_RETCODE_OK if successful, DDS_RETCODE_ERROR otherwise"]
    pub fn dds_request_loan_of_size(
        writer: dds_entity_t,
        size: usize,
        sample: *mut *mut ::std::ffi::c_void,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @ingroup deprecated\n @component read_data\n @brief Check if a Loan is available to reader/writer\n @deprecated Use @ref dds_request_loan instead, returns 0 if loan is not available\n\n The loan is available if the shared memory is enabled and all the constraints\n to enable shared memory are met and the type is fixed\n @note dds_loan_sample can be used if and only if\n dds_is_loan_available returns true.\n\n @param[in] entity the handle of the entity\n\n @returns loan available or not"]
    pub fn dds_is_loan_available(entity: dds_entity_t) -> bool;
}
unsafe extern "C" {
    #[doc = " @ingroup deprecated\n @component read_data\n @brief Loan a sample from the writer.\n @deprecated Use @ref dds_request_loan\n @note This function is to be used with dds_write to publish the loaned\n sample.\n @note The function can only be used if dds_is_loan_available is\n       true for the writer.\n\n @param[in] writer the writer to loan the buffer from\n @param[out] sample the loaned sample\n\n @returns DDS_RETCODE_OK if successful, DDS_RETCODE_ERROR otherwise"]
    pub fn dds_loan_sample(
        writer: dds_entity_t,
        sample: *mut *mut ::std::ffi::c_void,
    ) -> dds_return_t;
}
pub const dds_qos_kind_DDS_PARTICIPANT_QOS: dds_qos_kind = 0;
pub const dds_qos_kind_DDS_PUBLISHER_QOS: dds_qos_kind = 1;
pub const dds_qos_kind_DDS_SUBSCRIBER_QOS: dds_qos_kind = 2;
pub const dds_qos_kind_DDS_TOPIC_QOS: dds_qos_kind = 3;
pub const dds_qos_kind_DDS_READER_QOS: dds_qos_kind = 4;
pub const dds_qos_kind_DDS_WRITER_QOS: dds_qos_kind = 5;
#[doc = " @brief All kind of entities for which qos can be stored in Profile.\n @ingroup qos_provider\n @component qos_provider_api"]
pub type dds_qos_kind = ::std::ffi::c_uint;
#[doc = " @brief All kind of entities for which qos can be stored in Profile.\n @ingroup qos_provider\n @component qos_provider_api"]
pub use self::dds_qos_kind as dds_qos_kind_t;
#[doc = " @brief Sample structure of the Qos Provider.\n @ingroup qos_provider\n @component qos_provider_api"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dds_qos_provider {
    _unused: [u8; 0],
}
pub type dds_qos_provider_t = dds_qos_provider;
unsafe extern "C" {
    #[doc = " @brief Initialize Qos Provider.\n @ingroup qos_provider\n @component qos_provider_api\n\n Create dds_qos_provider with provided system definition file path.\n\n @param[in] path - String that contains system definition inself or path to system defenition file.\n @param[in,out] provider - Pointer to the Qos Provider structure.\n\n @return a DDS return code"]
    pub fn dds_create_qos_provider(
        path: *const ::std::ffi::c_char,
        provider: *mut *mut dds_qos_provider_t,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Initialize Qos Provider with certain scope.\n @ingroup qos_provider\n @component qos_provider_api\n\n Create dds_qos_provider with provided system definition file path and scope.\n\n @param[in] path - String that contains system definition inself or path to system defenition file.\n @param[in,out] provider - Pointer to the Qos Provider structure.\n @param[in] key - String that contains pattern of interested qos from `path` in format '<library name>::<profile name>::<entity name>'.\n\n @return a DDS return code"]
    pub fn dds_create_qos_provider_scope(
        path: *const ::std::ffi::c_char,
        provider: *mut *mut dds_qos_provider_t,
        key: *const ::std::ffi::c_char,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Get Qos from Qos Provider.\n @ingroup qos_provider\n @component qos_provider_api\n\n Provide access to dds_qos_t from dds_qos_provider by full key and type of qos entity.\n\n @param[in] provider - Pointer to the Qos Provider structure.\n @param[in] type - Type of entity which Qos to get.\n @param[in] key - Full qualify name of Qos to get in format '<library name>::<profile name>::<entity name>'.\n @param[in,out] qos - Pointer to the Qos structure.\n\n @return a DDS return code"]
    pub fn dds_qos_provider_get_qos(
        provider: *const dds_qos_provider_t,
        type_: dds_qos_kind_t,
        key: *const ::std::ffi::c_char,
        qos: *mut *const dds_qos_t,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Finalize Qos Provider.\n @ingroup qos_provider\n @component qos_provider_api\n\n Release resources allocated by dds_qos_provider.\n\n @param[in] provider - Pointer to the Qos Provider structure."]
    pub fn dds_delete_qos_provider(provider: *mut dds_qos_provider_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ddsi_typeid {
    _unused: [u8; 0],
}
#[doc = " @brief DDS Type Identifier (XTypes)\n @ingroup dds\n DOC_TODO"]
pub type dds_typeid_t = ddsi_typeid;
#[doc = " @brief DDS Type Information (XTypes)\n @ingroup dds\n DOC_TODO"]
pub type dds_typeinfo_t = ddsi_typeinfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ddsi_typeobj {
    _unused: [u8; 0],
}
#[doc = " @brief DDS Type Object (XTypes)\n @ingroup dds\n DOC_TODO"]
pub type dds_typeobj_t = ddsi_typeobj;
#[doc = " @brief DDSI parameter list\n @ingroup dds\n DOC_TODO"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ddsi_plist {
    _unused: [u8; 0],
}
#[doc = " @anchor ddsi_sertype\n @brief DDSI sertype\n @ingroup dds\n DOC_TODO"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ddsi_sertype {
    _unused: [u8; 0],
}
#[doc = " @anchor ddsi_serdata\n @brief DDSI Serdata\n @ingroup dds\n DOC_TODO"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ddsi_serdata {
    _unused: [u8; 0],
}
#[doc = " @brief DDSI Config\n @ingroup dds\n DOC_TODO"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ddsi_config {
    _unused: [u8; 0],
}
#[doc = "< See @ref DDS_INCONSISTENT_TOPIC_STATUS"]
pub const dds_status_id_DDS_INCONSISTENT_TOPIC_STATUS_ID: dds_status_id = 0;
#[doc = "< See @ref DDS_OFFERED_DEADLINE_MISSED_STATUS"]
pub const dds_status_id_DDS_OFFERED_DEADLINE_MISSED_STATUS_ID: dds_status_id = 1;
#[doc = "< See @ref DDS_REQUESTED_DEADLINE_MISSED_STATUS"]
pub const dds_status_id_DDS_REQUESTED_DEADLINE_MISSED_STATUS_ID: dds_status_id = 2;
#[doc = "< See @ref DDS_OFFERED_INCOMPATIBLE_QOS_STATUS"]
pub const dds_status_id_DDS_OFFERED_INCOMPATIBLE_QOS_STATUS_ID: dds_status_id = 3;
#[doc = "< See @ref DDS_REQUESTED_INCOMPATIBLE_QOS_STATUS"]
pub const dds_status_id_DDS_REQUESTED_INCOMPATIBLE_QOS_STATUS_ID: dds_status_id = 4;
#[doc = "< See @ref DDS_SAMPLE_LOST_STATUS"]
pub const dds_status_id_DDS_SAMPLE_LOST_STATUS_ID: dds_status_id = 5;
#[doc = "< See @ref DDS_SAMPLE_REJECTED_STATUS"]
pub const dds_status_id_DDS_SAMPLE_REJECTED_STATUS_ID: dds_status_id = 6;
#[doc = "< See @ref DDS_DATA_ON_READERS_STATUS"]
pub const dds_status_id_DDS_DATA_ON_READERS_STATUS_ID: dds_status_id = 7;
#[doc = "< See @ref DDS_DATA_AVAILABLE_STATUS"]
pub const dds_status_id_DDS_DATA_AVAILABLE_STATUS_ID: dds_status_id = 8;
#[doc = "< See @ref DDS_LIVELINESS_LOST_STATUS"]
pub const dds_status_id_DDS_LIVELINESS_LOST_STATUS_ID: dds_status_id = 9;
#[doc = "< See @ref DDS_LIVELINESS_CHANGED_STATUS"]
pub const dds_status_id_DDS_LIVELINESS_CHANGED_STATUS_ID: dds_status_id = 10;
#[doc = "< See @ref DDS_PUBLICATION_MATCHED_STATUS"]
pub const dds_status_id_DDS_PUBLICATION_MATCHED_STATUS_ID: dds_status_id = 11;
#[doc = "< See @ref DDS_SUBSCRIPTION_MATCHED_STATUS"]
pub const dds_status_id_DDS_SUBSCRIPTION_MATCHED_STATUS_ID: dds_status_id = 12;
#[doc = " @defgroup entity_status (Entity Status)\n @ingroup entity\n All entities have a set of \"status conditions\"\n (following the DCPS spec), read peeks, take reads & resets (analogously to read &\n take operations on reader). The \"mask\" allows operating only on a subset of the statuses.\n Enabled status analogously to DCPS spec.\n @{\n/\n/**\n @brief These identifiers are used to generate the bitshifted identifiers.\n By using bitflags instead of these IDs the process of building status masks is\n simplified to using simple binary OR operations.\n DOC_TODO fix the refs"]
pub type dds_status_id = ::std::ffi::c_uint;
#[doc = " @defgroup entity_status (Entity Status)\n @ingroup entity\n All entities have a set of \"status conditions\"\n (following the DCPS spec), read peeks, take reads & resets (analogously to read &\n take operations on reader). The \"mask\" allows operating only on a subset of the statuses.\n Enabled status analogously to DCPS spec.\n @{\n/\n/**\n @brief These identifiers are used to generate the bitshifted identifiers.\n By using bitflags instead of these IDs the process of building status masks is\n simplified to using simple binary OR operations.\n DOC_TODO fix the refs"]
pub use self::dds_status_id as dds_status_id_t;
#[doc = "<DataReader has already accessed the sample by read"]
pub const dds_sample_state_DDS_SST_READ: dds_sample_state = 1;
#[doc = "<DataReader has not accessed the sample before"]
pub const dds_sample_state_DDS_SST_NOT_READ: dds_sample_state = 2;
#[doc = " Read state for a data value"]
pub type dds_sample_state = ::std::ffi::c_uint;
#[doc = " Read state for a data value"]
pub use self::dds_sample_state as dds_sample_state_t;
#[doc = " DataReader is accessing the sample for the first time when the instance is alive"]
pub const dds_view_state_DDS_VST_NEW: dds_view_state = 4;
#[doc = " DataReader accessed the sample before"]
pub const dds_view_state_DDS_VST_OLD: dds_view_state = 8;
#[doc = " View state of an instance relative to the samples"]
pub type dds_view_state = ::std::ffi::c_uint;
#[doc = " View state of an instance relative to the samples"]
pub use self::dds_view_state as dds_view_state_t;
#[doc = " Samples received for the instance from the live data writers"]
pub const dds_instance_state_DDS_IST_ALIVE: dds_instance_state = 16;
#[doc = " Instance was explicitly disposed by the data writer"]
pub const dds_instance_state_DDS_IST_NOT_ALIVE_DISPOSED: dds_instance_state = 32;
#[doc = " Instance has been declared as not alive by data reader as there are no live data writers writing that instance"]
pub const dds_instance_state_DDS_IST_NOT_ALIVE_NO_WRITERS: dds_instance_state = 64;
#[doc = " Defines the state of the instance"]
pub type dds_instance_state = ::std::ffi::c_uint;
#[doc = " Defines the state of the instance"]
pub use self::dds_instance_state as dds_instance_state_t;
#[doc = " Contains information about the associated data value"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dds_sample_info {
    #[doc = " Sample state"]
    pub sample_state: dds_sample_state_t,
    #[doc = " View state"]
    pub view_state: dds_view_state_t,
    #[doc = " Instance state"]
    pub instance_state: dds_instance_state_t,
    #[doc = " Indicates whether there is a data associated with a sample\n  - true, indicates the data is valid\n  - false, indicates the data is invalid, no data to read"]
    pub valid_data: bool,
    #[doc = " timestamp of a data instance when it is written"]
    pub source_timestamp: dds_time_t,
    #[doc = " handle to the data instance"]
    pub instance_handle: dds_instance_handle_t,
    #[doc = " handle to the publisher"]
    pub publication_handle: dds_instance_handle_t,
    #[doc = " count of instance state change from NOT_ALIVE_DISPOSED to ALIVE"]
    pub disposed_generation_count: u32,
    #[doc = " count of instance state change from NOT_ALIVE_NO_WRITERS to ALIVE"]
    pub no_writers_generation_count: u32,
    #[doc = " indicates the number of samples of the same instance that follow the current one in the collection"]
    pub sample_rank: u32,
    #[doc = " difference in generations between the sample and most recent sample of the same instance that appears in the returned collection"]
    pub generation_rank: u32,
    #[doc = " difference in generations between the sample and most recent sample of the same instance when read/take was called"]
    pub absolute_generation_rank: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_sample_info"][::std::mem::size_of::<dds_sample_info>() - 64usize];
    ["Alignment of dds_sample_info"][::std::mem::align_of::<dds_sample_info>() - 8usize];
    ["Offset of field: dds_sample_info::sample_state"]
        [::std::mem::offset_of!(dds_sample_info, sample_state) - 0usize];
    ["Offset of field: dds_sample_info::view_state"]
        [::std::mem::offset_of!(dds_sample_info, view_state) - 4usize];
    ["Offset of field: dds_sample_info::instance_state"]
        [::std::mem::offset_of!(dds_sample_info, instance_state) - 8usize];
    ["Offset of field: dds_sample_info::valid_data"]
        [::std::mem::offset_of!(dds_sample_info, valid_data) - 12usize];
    ["Offset of field: dds_sample_info::source_timestamp"]
        [::std::mem::offset_of!(dds_sample_info, source_timestamp) - 16usize];
    ["Offset of field: dds_sample_info::instance_handle"]
        [::std::mem::offset_of!(dds_sample_info, instance_handle) - 24usize];
    ["Offset of field: dds_sample_info::publication_handle"]
        [::std::mem::offset_of!(dds_sample_info, publication_handle) - 32usize];
    ["Offset of field: dds_sample_info::disposed_generation_count"]
        [::std::mem::offset_of!(dds_sample_info, disposed_generation_count) - 40usize];
    ["Offset of field: dds_sample_info::no_writers_generation_count"]
        [::std::mem::offset_of!(dds_sample_info, no_writers_generation_count) - 44usize];
    ["Offset of field: dds_sample_info::sample_rank"]
        [::std::mem::offset_of!(dds_sample_info, sample_rank) - 48usize];
    ["Offset of field: dds_sample_info::generation_rank"]
        [::std::mem::offset_of!(dds_sample_info, generation_rank) - 52usize];
    ["Offset of field: dds_sample_info::absolute_generation_rank"]
        [::std::mem::offset_of!(dds_sample_info, absolute_generation_rank) - 56usize];
};
impl Default for dds_sample_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Contains information about the associated data value"]
pub type dds_sample_info_t = dds_sample_info;
#[doc = " @brief Sample structure of the Builtin topic DcpsParticipant.\n @ingroup builtintopic"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dds_builtintopic_participant {
    #[doc = "< The GUID that uniquely identifies the participant on the network"]
    pub key: dds_guid_t,
    #[doc = "< The QoS of the participant"]
    pub qos: *mut dds_qos_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_builtintopic_participant"]
        [::std::mem::size_of::<dds_builtintopic_participant>() - 24usize];
    ["Alignment of dds_builtintopic_participant"]
        [::std::mem::align_of::<dds_builtintopic_participant>() - 8usize];
    ["Offset of field: dds_builtintopic_participant::key"]
        [::std::mem::offset_of!(dds_builtintopic_participant, key) - 0usize];
    ["Offset of field: dds_builtintopic_participant::qos"]
        [::std::mem::offset_of!(dds_builtintopic_participant, qos) - 16usize];
};
impl Default for dds_builtintopic_participant {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Sample structure of the Builtin topic DcpsParticipant.\n @ingroup builtintopic"]
pub type dds_builtintopic_participant_t = dds_builtintopic_participant;
#[doc = " @brief Structure of a key in the Builtin topic DcpsTopic.\n @ingroup builtintopic"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct dds_builtintopic_topic_key {
    #[doc = "< 16-byte unique identifier"]
    pub d: [::std::ffi::c_uchar; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_builtintopic_topic_key"]
        [::std::mem::size_of::<dds_builtintopic_topic_key>() - 16usize];
    ["Alignment of dds_builtintopic_topic_key"]
        [::std::mem::align_of::<dds_builtintopic_topic_key>() - 1usize];
    ["Offset of field: dds_builtintopic_topic_key::d"]
        [::std::mem::offset_of!(dds_builtintopic_topic_key, d) - 0usize];
};
#[doc = " @brief Structure of a key in the Builtin topic DcpsTopic.\n @ingroup builtintopic"]
pub type dds_builtintopic_topic_key_t = dds_builtintopic_topic_key;
#[doc = " @brief Sample structure of the Builtin topic DcpsTopic.\n @ingroup builtintopic"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dds_builtintopic_topic {
    #[doc = "< The GUID that uniquely identifies the topic on the network"]
    pub key: dds_builtintopic_topic_key_t,
    #[doc = "< The name of the topic, potentially unicode."]
    pub topic_name: *mut ::std::ffi::c_char,
    #[doc = "< The name of the type, potentially unicode."]
    pub type_name: *mut ::std::ffi::c_char,
    #[doc = "< The QoS of the topic"]
    pub qos: *mut dds_qos_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_builtintopic_topic"][::std::mem::size_of::<dds_builtintopic_topic>() - 40usize];
    ["Alignment of dds_builtintopic_topic"]
        [::std::mem::align_of::<dds_builtintopic_topic>() - 8usize];
    ["Offset of field: dds_builtintopic_topic::key"]
        [::std::mem::offset_of!(dds_builtintopic_topic, key) - 0usize];
    ["Offset of field: dds_builtintopic_topic::topic_name"]
        [::std::mem::offset_of!(dds_builtintopic_topic, topic_name) - 16usize];
    ["Offset of field: dds_builtintopic_topic::type_name"]
        [::std::mem::offset_of!(dds_builtintopic_topic, type_name) - 24usize];
    ["Offset of field: dds_builtintopic_topic::qos"]
        [::std::mem::offset_of!(dds_builtintopic_topic, qos) - 32usize];
};
impl Default for dds_builtintopic_topic {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Sample structure of the Builtin topic DcpsTopic.\n @ingroup builtintopic"]
pub type dds_builtintopic_topic_t = dds_builtintopic_topic;
#[doc = " @brief Sample structure of the Builtin topic DcpsPublication and DcpsSubscription.\n @ingroup builtintopic"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dds_builtintopic_endpoint {
    #[doc = "< The GUID that uniquely identifies the endpoint on the network"]
    pub key: dds_guid_t,
    #[doc = "< The GUID of the participant this endpoint belongs to."]
    pub participant_key: dds_guid_t,
    #[doc = "< The instance handle the participant assigned to this enpoint."]
    pub participant_instance_handle: dds_instance_handle_t,
    #[doc = "< The name of the topic, potentially unicode."]
    pub topic_name: *mut ::std::ffi::c_char,
    #[doc = "< The name of the type, potentially unicode."]
    pub type_name: *mut ::std::ffi::c_char,
    #[doc = "< The QoS of the endpoint"]
    pub qos: *mut dds_qos_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dds_builtintopic_endpoint"]
        [::std::mem::size_of::<dds_builtintopic_endpoint>() - 64usize];
    ["Alignment of dds_builtintopic_endpoint"]
        [::std::mem::align_of::<dds_builtintopic_endpoint>() - 8usize];
    ["Offset of field: dds_builtintopic_endpoint::key"]
        [::std::mem::offset_of!(dds_builtintopic_endpoint, key) - 0usize];
    ["Offset of field: dds_builtintopic_endpoint::participant_key"]
        [::std::mem::offset_of!(dds_builtintopic_endpoint, participant_key) - 16usize];
    ["Offset of field: dds_builtintopic_endpoint::participant_instance_handle"]
        [::std::mem::offset_of!(dds_builtintopic_endpoint, participant_instance_handle) - 32usize];
    ["Offset of field: dds_builtintopic_endpoint::topic_name"]
        [::std::mem::offset_of!(dds_builtintopic_endpoint, topic_name) - 40usize];
    ["Offset of field: dds_builtintopic_endpoint::type_name"]
        [::std::mem::offset_of!(dds_builtintopic_endpoint, type_name) - 48usize];
    ["Offset of field: dds_builtintopic_endpoint::qos"]
        [::std::mem::offset_of!(dds_builtintopic_endpoint, qos) - 56usize];
};
impl Default for dds_builtintopic_endpoint {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @brief Sample structure of the Builtin topic DcpsPublication and DcpsSubscription.\n @ingroup builtintopic"]
pub type dds_builtintopic_endpoint_t = dds_builtintopic_endpoint;
unsafe extern "C" {
    #[doc = " @brief Enable entity.\n @ingroup entity\n @component generic_entity\n\n @note Delayed entity enabling is not supported yet (CHAM-96).\n\n This operation enables the dds_entity_t. Created dds_entity_t objects can start in\n either an enabled or disabled state. This is controlled by the value of the\n entityfactory policy on the corresponding parent entity for the given\n entity. Enabled entities are immediately activated at creation time meaning\n all their immutable QoS settings can no longer be changed. Disabled Entities are not\n yet activated, so it is still possible to change their immutable QoS settings. However,\n once activated the immutable QoS settings can no longer be changed.\n Creating disabled entities can make sense when the creator of the DDS_Entity\n does not yet know which QoS settings to apply, thus allowing another piece of code\n to set the QoS later on.\n\n The default setting of DDS_EntityFactoryQosPolicy is such that, by default,\n entities are created in an enabled state so that it is not necessary to explicitly call\n dds_enable on newly-created entities.\n\n The dds_enable operation produces the same results no matter how\n many times it is performed. Calling dds_enable on an already\n enabled DDS_Entity returns DDS_RETCODE_OK and has no effect.\n\n If an Entity has not yet been enabled, the only operations that can be invoked\n on it are: the ones to set, get or copy the QosPolicy settings, the ones that set\n (or get) the Listener, the ones that get the Status and the dds_get_status_changes\n operation (although the status of a disabled entity never changes). Other operations\n will return the error DDS_RETCODE_NOT_ENABLED.\n\n Entities created with a parent that is disabled, are created disabled regardless of\n the setting of the entityfactory policy.\n\n If the entityfactory policy has autoenable_created_entities\n set to TRUE, the dds_enable operation on the parent will\n automatically enable all child entities created with the parent.\n\n The Listeners associated with an Entity are not called until the\n Entity is enabled. Conditions associated with an Entity that\n is not enabled are \"inactive\", that is, have a trigger_value which is FALSE.\n\n @param[in]  entity  The entity to enable.\n\n @returns A dds_return_t indicating success or failure.\n\n @retval DDS_RETCODE_OK\n             The listeners of to the entity have been successfully been copied\n             into the specified listener parameter.\n @retval DDS_RETCODE_ERROR\n             An internal error has occurred.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n             The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n             The entity has already been deleted.\n @retval DDS_RETCODE_PRECONDITION_NOT_MET\n             The parent of the given Entity is not enabled."]
    pub fn dds_enable(entity: dds_entity_t) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Delete given entity.\n @ingroup entity\n @component generic_entity\n\n This operation will delete the given entity. It will also automatically\n delete all its children, childrens' children, etc entities.\n\n @param[in]  entity  Entity to delete.\n\n @returns A dds_return_t indicating success or failure.\n\n @retval DDS_RETCODE_OK\n             The entity and its children (recursive are deleted).\n @retval DDS_RETCODE_ERROR\n             An internal error has occurred.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n             The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n             The entity has already been deleted."]
    pub fn dds_delete(entity: dds_entity_t) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Get entity publisher.\n @ingroup entity\n @component entity_relations\n\n This operation returns the publisher to which the given entity belongs.\n For instance, it will return the Publisher that was used when\n creating a DataWriter (when that DataWriter was provided here).\n\n @param[in]  writer  Entity from which to get its publisher.\n\n @returns A valid entity or an error code.\n\n @retval >0\n             A valid publisher handle.\n @retval DDS_RETCODE_ERROR\n             An internal error has occurred.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n             The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n             The entity has already been deleted."]
    pub fn dds_get_publisher(writer: dds_entity_t) -> dds_entity_t;
}
unsafe extern "C" {
    #[doc = " @brief Get entity subscriber.\n @ingroup entity\n @component entity_relations\n\n This operation returns the subscriber to which the given entity belongs.\n For instance, it will return the Subscriber that was used when\n creating a DataReader (when that DataReader was provided here).\n\n @param[in]  entity  Entity from which to get its subscriber.\n\n @returns A valid subscriber handle or an error code.\n\n @retval >0\n             A valid subscriber handle.\n @retval DDS_RETCODE_ERROR\n             An internal error has occurred.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n             The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n             The entity has already been deleted.\n DOC_TODO: Link to generic dds entity relations documentation."]
    pub fn dds_get_subscriber(entity: dds_entity_t) -> dds_entity_t;
}
unsafe extern "C" {
    #[doc = " @brief Get entity datareader.\n @ingroup entity\n @component entity_relations\n\n This operation returns the datareader to which the given entity belongs.\n For instance, it will return the DataReader that was used when\n creating a ReadCondition (when that ReadCondition was provided here).\n\n @param[in]  entity  Entity from which to get its datareader.\n\n @returns A valid reader handle or an error code.\n\n @retval >0\n             A valid reader handle.\n @retval DDS_RETCODE_ERROR\n             An internal error has occurred.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n             The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n             The entity has already been deleted.\n DOC_TODO: Link to generic dds entity relations documentation."]
    pub fn dds_get_datareader(entity: dds_entity_t) -> dds_entity_t;
}
unsafe extern "C" {
    #[doc = " @brief Get the mask of a condition.\n @ingroup condition\n @component entity_status\n\n This operation returns the mask that was used to create the given\n condition.\n\n @param[in]  condition  Read or Query condition that has a mask.\n @param[out] mask       Where to store the mask of the condition.\n\n @returns A dds_return_t indicating success or failure.\n\n @retval DDS_RETCODE_OK\n             Success (given mask is set).\n @retval DDS_RETCODE_ERROR\n             An internal error has occurred.\n @retval DDS_RETCODE_BAD_PARAMETER\n             The mask arg is NULL.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n             The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n             The entity has already been deleted."]
    pub fn dds_get_mask(condition: dds_entity_t, mask: *mut u32) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Returns the instance handle that represents the entity.\n @ingroup entity\n @component generic_entity\n\n @param[in]   entity  Entity of which to get the instance handle.\n @param[out]  ihdl    Pointer to dds_instance_handle_t.\n\n @returns A dds_return_t indicating success or failure.\n\n @retval DDS_RETCODE_OK\n             Success.\n @retval DDS_RETCODE_ERROR\n             An internal error has occurred.\n DOC_TODO: Check list of return codes is complete."]
    pub fn dds_get_instance_handle(
        entity: dds_entity_t,
        ihdl: *mut dds_instance_handle_t,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Returns the GUID that represents the entity in the network,\n and therefore only supports participants, readers and writers.\n @ingroup entity\n @component generic_entity\n\n @param[in]   entity  Entity of which to get the instance handle.\n @param[out]  guid    Where to store the GUID.\n\n @returns A dds_return_t indicating success or failure.\n\n @retval DDS_RETCODE_OK\n             Success.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n             The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ERROR\n             An internal error has occurred.\n\n DOC_TODO: Check list of return codes is complete."]
    pub fn dds_get_guid(entity: dds_entity_t, guid: *mut dds_guid_t) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Read the status set for the entity\n @ingroup entity_status\n @component entity_status\n\n This operation reads the status(es) set for the entity based on\n the enabled status and mask set. It does not clear the read status(es).\n\n @param[in]  entity  Entity on which the status has to be read.\n @param[out] status  Returns the status set on the entity, based on the enabled status.\n @param[in]  mask    Filter the status condition to be read, 0 means all statuses\n\n @returns A dds_return_t indicating success or failure.\n\n @retval DDS_RETCODE_OK\n             Success.\n @retval DDS_RETCODE_BAD_PARAMETER\n             The entity parameter is not a valid parameter, status is a null pointer or\n             mask has bits set outside the status range.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n             The operation is invoked on an inappropriate object or mask has status\n             bits set that are undefined for the type of entity.\n @retval DDS_RETCODE_ALREADY_DELETED\n             The entity has already been deleted."]
    pub fn dds_read_status(entity: dds_entity_t, status: *mut u32, mask: u32) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Read the status set for the entity\n @ingroup entity_status\n @component entity_status\n\n This operation reads the status(es) set for the entity based on the enabled\n status and mask set. It clears the status set after reading.\n\n @param[in]  entity  Entity on which the status has to be read.\n @param[out] status  Returns the status set on the entity, based on the enabled status.\n @param[in]  mask    Filter the status condition to be read, 0 means all statuses\n\n @returns A dds_return_t indicating success or failure.\n\n @retval DDS_RETCODE_OK\n             Success.\n @retval DDS_RETCODE_BAD_PARAMETER\n             The entity parameter is not a valid parameter, status is a null pointer or\n             mask has bits set outside the status range.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n             The operation is invoked on an inappropriate object or mask has status\n             bits set that are undefined for the type of entity.\n @retval DDS_RETCODE_ALREADY_DELETED\n             The entity has already been deleted."]
    pub fn dds_take_status(entity: dds_entity_t, status: *mut u32, mask: u32) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Get changed status(es)\n @ingroup entity_status\n @component entity_status\n\n This operation returns the status changes since they were last read.\n\n @param[in]  entity  Entity on which the statuses are read.\n @param[out] status  Returns the current set of triggered statuses.\n\n @returns A dds_return_t indicating success or failure.\n\n @retval DDS_RETCODE_OK\n             Success.\n @retval DDS_RETCODE_BAD_PARAMETER\n             The entity parameter is not a valid parameter.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n             The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n             The entity has already been deleted."]
    pub fn dds_get_status_changes(entity: dds_entity_t, status: *mut u32) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @anchor dds_get_status_mask\n @brief Get enabled status on entity\n @ingroup entity_status\n @component entity_status\n\n This operation returns the status enabled on the entity\n\n @param[in]  entity  Entity to get the status.\n @param[out] mask    Mask of enabled statuses set on the entity.\n\n @returns A dds_return_t indicating success or failure.\n\n @retval DDS_RETCODE_OK\n             Success.\n @retval DDS_RETCODE_BAD_PARAMETER\n             The entity parameter is not a valid parameter.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n             The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n             The entity has already been deleted."]
    pub fn dds_get_status_mask(entity: dds_entity_t, mask: *mut u32) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @anchor dds_set_status_mask\n @brief Set status enabled on entity\n @ingroup entity_status\n @component entity_status\n\n This operation enables the status(es) based on the mask set\n\n @param[in]  entity  Entity to enable the status.\n @param[in]  mask    Status value that indicates the status to be enabled.\n\n @returns A dds_return_t indicating success or failure.\n\n @retval DDS_RETCODE_OK\n             Success.\n @retval DDS_RETCODE_BAD_PARAMETER\n             The entity parameter is not a valid parameter.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n             The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n             The entity has already been deleted."]
    pub fn dds_set_status_mask(entity: dds_entity_t, mask: u32) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Get entity QoS policies.\n @ingroup entity_qos\n @component entity_qos\n\n This operation allows access to the existing set of QoS policies\n for the entity.\n\n @param[in]  entity  Entity on which to get qos.\n @param[out] qos     Pointer to the qos structure that returns the set policies.\n\n @returns A dds_return_t indicating success or failure. The QoS object will have\n at least all QoS relevant for the entity present and the corresponding dds_qget_...\n will return true.\n\n @retval DDS_RETCODE_OK\n             The existing set of QoS policy values applied to the entity\n             has successfully been copied into the specified qos parameter.\n @retval DDS_RETCODE_ERROR\n             An internal error has occurred.\n @retval DDS_RETCODE_BAD_PARAMETER\n             The qos parameter is NULL.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n             The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n             The entity has already been deleted.\n\n DOC_TODO: Link to generic QoS information documentation."]
    pub fn dds_get_qos(entity: dds_entity_t, qos: *mut dds_qos_t) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Set entity QoS policies.\n @ingroup entity_qos\n @component entity_qos\n\n This operation replaces the existing set of Qos Policy settings for an\n entity. The parameter qos must contain the struct with the QosPolicy\n settings which is checked for self-consistency.\n\n The set of QosPolicy settings specified by the qos parameter are applied on\n top of the existing QoS, replacing the values of any policies previously set\n (provided, the operation returned DDS_RETCODE_OK).\n\n Not all policies are changeable when the entity is enabled.\n\n @note Currently only Latency Budget and Ownership Strength are changeable QoS\n       that can be set.\n\n @param[in]  entity  Entity from which to get qos.\n @param[in]  qos     Pointer to the qos structure that provides the policies.\n\n @returns A dds_return_t indicating success or failure.\n\n @retval DDS_RETCODE_OK\n             The new QoS policies are set.\n @retval DDS_RETCODE_ERROR\n             An internal error has occurred.\n @retval DDS_RETCODE_BAD_PARAMETER\n             The qos parameter is NULL.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n             The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n             The entity has already been deleted.\n @retval DDS_RETCODE_IMMUTABLE_POLICY\n             The entity is enabled and one or more of the policies of the QoS\n             are immutable.\n @retval DDS_RETCODE_INCONSISTENT_POLICY\n             A few policies within the QoS are not consistent with each other.\n\n DOC_TODO: Link to generic QoS information documentation."]
    pub fn dds_set_qos(entity: dds_entity_t, qos: *const dds_qos_t) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Get entity listeners.\n @ingroup entity_listener\n @component entity_listener\n\n This operation allows access to the existing listeners attached to\n the entity.\n\n @param[in]  entity   Entity on which to get the listeners.\n @param[out] listener Pointer to the listener structure that returns the\n                      set of listener callbacks.\n\n @returns A dds_return_t indicating success or failure.\n\n @retval DDS_RETCODE_OK\n             The listeners of to the entity have been successfully been\n             copied into the specified listener parameter.\n @retval DDS_RETCODE_ERROR\n             An internal error has occurred.\n @retval DDS_RETCODE_BAD_PARAMETER\n             The listener parameter is NULL.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n             The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n             The entity has already been deleted.\n\n DOC_TODO: Link to (generic) Listener and status information."]
    pub fn dds_get_listener(entity: dds_entity_t, listener: *mut dds_listener_t) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Set entity listeners.\n @ingroup entity_listener\n @component entity_listener\n\n This operation attaches a dds_listener_t to the dds_entity_t. Only one\n Listener can be attached to each Entity. If a Listener was already\n attached, this operation will replace it with the new one. In other\n words, all related callbacks are replaced (possibly with NULL).\n\n A call to this operation will immediately invoke any listener callbacks for\n which the corresponding status flag is set. It may cause spurious invocations,\n including multiple invocations for one listener. For most cases this is unlikely,\n but for the DATA_ON_READERS listeners it is quite likely, though not certain.\n\n When listener parameter is NULL, all listener callbacks that were possibly\n set on the Entity will be removed.\n\n @note Not all listener callbacks are related to all entities.\n\n ## Communication Status\n For each communication status, the StatusChangedFlag flag is initially set to\n FALSE. It becomes TRUE whenever that plain communication status changes. For\n each plain communication status activated in the mask, the associated\n Listener callback is invoked and the communication status is reset\n to FALSE, as the listener implicitly accesses the status which is passed as a\n parameter to that operation.\n The status is reset prior to calling the listener, so if the application calls\n the get_<status_name> from inside the listener it will see the\n status already reset.\n\n ## Status Propagation\n In case a related callback within the Listener is not set, the Listener of\n the Parent entity is called recursively, until a Listener with the appropriate\n callback set has been found and called. This allows the application to set\n (for instance) a default behaviour in the Listener of the containing Publisher\n and a DataWriter specific behaviour when needed. In case the callback is not\n set in the Publishers' Listener either, the communication status will be\n propagated to the Listener of the DomainParticipant of the containing\n DomainParticipant. In case the callback is not set in the DomainParticipants'\n Listener either, the Communication Status flag will be set, resulting in a\n possible WaitSet trigger.\n\n @param[in]  entity    Entity on which to get the listeners.\n @param[in]  listener  Pointer to the listener structure that contains the\n                       set of listener callbacks (maybe NULL).\n\n @returns A dds_return_t indicating success or failure.\n\n @retval DDS_RETCODE_OK\n             The listeners of to the entity have been successfully been\n             copied into the specified listener parameter.\n @retval DDS_RETCODE_ERROR\n             An internal error has occurred.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n             The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n             The entity has already been deleted.\n DOC_TODO: Link to (generic) Listener and status information."]
    pub fn dds_set_listener(entity: dds_entity_t, listener: *const dds_listener_t) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Creates a new instance of a DDS participant in a domain\n @ingroup domain_participant\n @component participant\n\n This function creates a new participant in the specified domain id, implicitly creating\n a domain entity if one doesn't exist for the specified domain id.  The domain entity\n can exist as a consequence of the existence of another participant in it, or because it\n was explicitly created using @ref dds_create_domain or @ref\n dds_create_domain_with_rawconfig.  If the domain entity has not been created yet, a new\n domain entity is created using a configuration taken from the CYCLONEDDS_URI\n environment variable.\n\n The domain id may be specified as DDS_DOMAIN_DEFAULT, in which case the behaviour\n depends on whether some domain entity already exists or not.  If there is at least one,\n the one with the lowest id will be used.  If there are none, one is created with the\n domain id taken from the first domain id specified in the configuration file (i.e.,\n with a Domain element with the id attribute not \"any\"), and if no domain id is\n specified in the configuration file, domain id 0 is used.\n\n The domain configuration is constructed by amending the default configuration with the\n Domain configuration (fragments) for which the domain id is specifed as \"any\" and those\n for which the domain id matches the specified domain id (not DDS_DOMAIN_DEFAULT) in the\n order in which they are encountered in the configuration.\n\n @param[in]  domain The domain in which to create the participant.\n @param[in]  qos The QoS to set on the new participant (can be NULL).\n @param[in]  listener Any listener functions associated with the new participant (can be NULL).\n\n @returns A valid participant handle or an error code.\n\n @retval >0\n             A valid participant handle.\n @retval DDS_RETCODE_NOT_ALLOWED_BY_SECURITY\n             An invalid DDS Security configuration was specified (whether\n             that be missing or incorrect entries, expired certificates,\n             or anything else related to the security settings and\n             implementation).\n @retval DDS_RETCODE_PRECONDITION_NOT_MET\n             Some security properties specified in the QoS, but the Cyclone\n             build does not include support for DDS Security.\n @retval DDS_RETCODE_OUT_OF_RESOURCES\n             Some resource limit (maximum participants, memory, handles,\n             &c.) prevented creation of the participant.\n @retval DDS_RETCODE_ERROR\n             The \"CYCLONEDDS_URI\" environment variable lists non-existent\n             or invalid configuration files, or contains invalid embedded\n             configuration items; or an unspecified internal error has\n             occurred."]
    pub fn dds_create_participant(
        domain: dds_domainid_t,
        qos: *const dds_qos_t,
        listener: *const dds_listener_t,
    ) -> dds_entity_t;
}
unsafe extern "C" {
    #[doc = " @brief Creates a domain with a given configuration\n @ingroup domain\n @component domain\n\n To explicitly create a domain based on a configuration passed as a string.  A domain\n created in this manner must be explicitly deleted by calling @ref dds_delete on the\n domain (or on DDS_CYCLONEDDS_HANDLE).\n\n It will not be created if a domain with the given domain id already exists.  This could\n have been created implicitly by a previous call to this function, @ref\n dds_create_participant or @ref dds_create_domain_with_rawconfig.\n\n The domain configuration is constructed by amending the default configuration with the\n Domain configuration (fragments) for which the domain id is specifed as \"any\" and those\n for which the domain id matches the specified domain id in the order in which they are\n encountered in the configuration.\n\n Using NULL or \"\" as config will create a domain with default settings.\n\n @param[in]  domain The domain to be created. DDS_DEFAULT_DOMAIN is not allowed.\n @param[in]  config A configuration string containing file names and/or XML fragments representing the configuration.\n\n @returns A valid entity handle or an error code.\n\n @retval DDS_RETCODE_BAD_PARAMETER\n             Illegal value for domain id or the configfile parameter is NULL.\n @retval DDS_RETCODE_PRECONDITION_NOT_MET\n             The domain already existed and cannot be created again.\n @retval DDS_RETCODE_ERROR\n             An internal error has occurred."]
    pub fn dds_create_domain(
        domain: dds_domainid_t,
        config: *const ::std::ffi::c_char,
    ) -> dds_entity_t;
}
unsafe extern "C" {
    #[doc = " @brief Creates a domain with a given configuration, specified as an\n initializer (unstable interface)\n @ingroup domain\n @component domain\n @unstable\n\n To explicitly create a domain based on a configuration passed as a raw initializer\n rather than as an XML string. This allows bypassing the XML parsing, but tightly\n couples the initializing to implementation.  See\n dds/ddsi/ddsi_config.h:ddsi_config_init_default for a way to initialize the default\n configuration.  A domain created in this manner must be explicitly deleted by calling\n @ref dds_delete on the domain (or on DDS_CYCLONEDDS_HANDLE).\n\n It will not be created if a domain with the given domain id already exists.  This could\n have been created implicitly by a previous call to this function, @ref\n dds_create_participant or @ref dds_create_domain_with_rawconfig.\n\n Please be aware that the given domain_id always takes precedence over the\n configuration.\n\n @param[in]  domain The domain to be created. DDS_DEFAULT_DOMAIN is not allowed.\n @param[in]  config A configuration initializer.  The lifetime of any pointers\n             in config must be at least that of the lifetime of the domain.\n\n @returns A valid entity handle or an error code.\n\n @retval DDS_RETCODE_BAD_PARAMETER\n             Illegal value for domain id or the config parameter is NULL.\n @retval DDS_RETCODE_PRECONDITION_NOT_MET\n             The domain already existed and cannot be created again.\n @retval DDS_RETCODE_ERROR\n             An internal error has occurred."]
    pub fn dds_create_domain_with_rawconfig(
        domain: dds_domainid_t,
        config: *const ddsi_config,
    ) -> dds_entity_t;
}
unsafe extern "C" {
    #[doc = " @brief Get entity parent.\n @ingroup entity\n @component entity_relations\n\n This operation returns the parent to which the given entity belongs.\n For instance, it will return the Participant that was used when\n creating a Publisher (when that Publisher was provided here).\n\n When a reader or a writer are created with a participant, then a\n subscriber or publisher are created implicitly.\n This function will return the implicit parent and not the used\n participant.\n\n @param[in]  entity  Entity from which to get its parent.\n\n @returns A valid entity handle or an error code.\n\n @retval >0\n             A valid entity handle.\n @retval DDS_ENTITY_NIL\n             Called with a participant.\n @retval DDS_RETCODE_ERROR\n             An internal error has occurred.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n             The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n             The entity has already been deleted.\n DOC_TODO: Link to generic dds entity relations documentation."]
    pub fn dds_get_parent(entity: dds_entity_t) -> dds_entity_t;
}
unsafe extern "C" {
    #[doc = " @brief Get entity participant.\n @ingroup entity\n @component entity_relations\n\n This operation returns the participant to which the given entity belongs.\n For instance, it will return the Participant that was used when\n creating a Publisher that was used to create a DataWriter (when that\n DataWriter was provided here).\n\n DOC_TODO: Link to generic dds entity relations documentation.\n\n @param[in]  entity  Entity from which to get its participant.\n\n @returns A valid entity or an error code.\n\n @retval >0\n             A valid participant handle.\n @retval DDS_RETCODE_ERROR\n             An internal error has occurred.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n             The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n             The entity has already been deleted."]
    pub fn dds_get_participant(entity: dds_entity_t) -> dds_entity_t;
}
unsafe extern "C" {
    #[doc = " @brief Get entity children.\n @ingroup entity\n @component entity_relations\n\n This operation returns the children that the entity contains.\n For instance, it will return all the Topics, Publishers and Subscribers\n of the Participant that was used to create those entities (when that\n Participant is provided here).\n\n This functions takes a pre-allocated list to put the children in and\n will return the number of found children. It is possible that the given\n size of the list is not the same as the number of found children. If\n less children are found, then the last few entries in the list are\n untouched. When more children are found, then only 'size' number of\n entries are inserted into the list, but still complete count of the\n found children is returned. Which children are returned in the latter\n case is undefined.\n\n When supplying NULL as list and 0 as size, you can use this to acquire\n the number of children without having to pre-allocate a list.\n\n When a reader or a writer are created with a participant, then a\n subscriber or publisher are created implicitly.\n When used on the participant, this function will return the implicit\n subscriber and/or publisher and not the related reader/writer.\n\n @param[in]  entity   Entity from which to get its children.\n @param[out] children Pre-allocated array to contain the found children.\n @param[in]  size     Size of the pre-allocated children's list.\n\n @returns Number of children or an error code.\n\n @retval >=0\n             Number of found children (can be larger than 'size').\n @retval DDS_RETCODE_ERROR\n             An internal error has occurred.\n @retval DDS_RETCODE_BAD_PARAMETER\n             The children parameter is NULL, while a size is provided.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n             The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n             The entity has already been deleted."]
    pub fn dds_get_children(
        entity: dds_entity_t,
        children: *mut dds_entity_t,
        size: usize,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Get the domain id to which this entity is attached.\n @ingroup entity\n @component entity_relations\n\n When creating a participant entity, it is attached to a certain domain.\n All the children (like Publishers) and childrens' children (like\n DataReaders), etc are also attached to that domain.\n\n This function will return the original domain ID when called on\n any of the entities within that hierarchy.  For entities not associated\n with a domain, the id is set to DDS_DOMAIN_DEFAULT.\n\n @param[in]  entity   Entity from which to get its children.\n @param[out] id       Pointer to put the domain ID in.\n\n @returns A dds_return_t indicating success or failure.\n\n @retval DDS_RETCODE_OK\n             Domain ID was returned.\n @retval DDS_RETCODE_ERROR\n             An internal error has occurred.\n @retval DDS_RETCODE_BAD_PARAMETER\n             The id parameter is NULL.\n @retval DDS_RETCODE_ILLEGAL_OPERATION\n             The operation is invoked on an inappropriate object.\n @retval DDS_RETCODE_ALREADY_DELETED\n             The entity has already been deleted."]
    pub fn dds_get_domainid(entity: dds_entity_t, id: *mut dds_domainid_t) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Get participants of a domain.\n @ingroup domain\n @component participant\n\n This operation acquires the participants created on a domain and returns\n the number of found participants.\n\n This function takes a domain id with the size of pre-allocated participant's\n list in and will return the number of found participants. It is possible that\n the given size of the list is not the same as the number of found participants.\n If less participants are found, then the last few entries in an array stay\n untouched. If more participants are found and the array is too small, then the\n participants returned are undefined.\n\n @param[in]  domain_id    The domain id.\n @param[out] participants The participant for domain.\n @param[in]  size         Size of the pre-allocated participant's list.\n\n @returns Number of participants found or and error code.\n\n @retval >0\n             Number of participants found.\n @retval DDS_RETCODE_ERROR\n             An internal error has occurred.\n @retval DDS_RETCODE_BAD_PARAMETER\n             The participant parameter is NULL, while a size is provided."]
    pub fn dds_lookup_participant(
        domain_id: dds_domainid_t,
        participants: *mut dds_entity_t,
        size: usize,
    ) -> dds_return_t;
}
unsafe extern "C" {
    #[doc = " @brief Creates a new topic with default type handling.\n @ingroup topic\n @component topic\n\n The type name for the topic is taken from the generated descriptor. Topic\n matching is done on a combination of topic name and type name. Each successful\n call to dds_create_topic creates a new topic entity sharing the same QoS\n settings with all other topics of the same name.\n\n @param[in]  participant  Participant on which to create the topic.\n @param[in]  descriptor   An IDL generated topic descriptor.\n @param[in]  name         Name of the topic.\n @param[in]  qos          QoS to set on the new topic (can be NULL).\n @param[in]  listener     Any listener functions associated with the new topic (can be NULL).\n\n @returns A valid, unique topic handle or an error code.\n\n @retval >=0\n             A valid unique topic handle.\n @retval DDS_RETCODE_BAD_PARAMETER\n             Either participant, descriptor, name or qos is invalid.\n @retval DDS_RETCODE_INCONSISTENT_POLICY\n             QoS mismatch between qos and an existing topic's QoS.\n @retval DDS_RETCODE_PRECONDITION_NOT_MET\n             Mismatch between type name in descriptor and pre-existing\n             topic's type name."]
    pub fn dds_create_topic(
        participant: dds_entity_t,
        descriptor: *const dds_topic_descriptor_t,
        name: *const ::std::ffi::c_char,
        qos: *const dds_qos_t,
        listener: *const dds_listener_t,
    ) -> dds_entity_t;
}
unsafe extern "C" {
    #[doc = " @brief Creates a new topic with provided type handling.\n @ingroup topic\n @component topic\n\n The name for the type is taken from the provided \"sertype\" object. Type\n matching is done on a combination of topic name and type name. Each successful\n call to dds_create_topic creates a new topic entity sharing the same QoS\n settings with all other topics of the same name.\n\n In case this function returns a valid handle, the ownership of the provided\n sertype is handed over to Cyclone. On return, the caller gets in the sertype parameter a\n pointer to the sertype that is actually used by the topic. This can be the provided sertype\n (if this sertype was not yet known in the domain), or a sertype thas was\n already known in the domain.\n\n @param[in]     participant  Participant on which to create the topic.\n @param[in]     name         Topic name\n @param[in,out] sertype      Internal description of the type . On return, the sertype parameter is set to the actual sertype that is used by the topic.\n @param[in]     qos          QoS to set on the new topic (can be NULL).\n @param[in]     listener     Any listener functions associated with the new topic (can be NULL).\n @param[in]     sedp_plist   Ignored (should be NULL, may be enforced in the future).\n\n @returns A valid, unique topic handle or an error code. Iff a valid handle, the domain takes ownership of provided serdata.\n\n @retval >=0\n             A valid unique topic handle.\n @retval DDS_RETCODE_BAD_PARAMETER\n             Either participant, descriptor, name or qos is invalid.\n @retval DDS_RETCODE_INCONSISTENT_POLICY\n             QoS mismatch between qos and an existing topic's QoS.\n @retval DDS_RETCODE_PRECONDITION_NOT_MET\n             Mismatch between type name in sertype and pre-existing\n             topic's type name."]
    pub fn dds_create_topic_sertype(
        participant: dds_entity_t,
        name: *const ::std::ffi::c_char,
        sertype: *mut *mut ddsi_sertype,
        qos: *const dds_qos_t,
        listener: *const dds_listener_t,
        sedp_plist: *const ddsi_plist,
    ) -> dds_entity_t;
}
unsafe extern "C" {
